{
"notes": [
	{
		"bookid" : 1,
		"bookname" : "Genesis",
		"chapterid" : 1,
		"verseid" : 1,
		"versetext" : "In the beginning God created the heaven and the earth.",
		"verseref" : ",Genesis 1:1",
		"versecomment" : "Only pride or ignorance can keep one from believing that God is the creator of all the visible and invisible universe.",
		"quitetimedate" : "2018-10-19"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 61,
		"verseid" : 1,
		"versetext" : "Hear my cry, O God; attend unto my prayer.",
		"verseref" : null,
		"versecomment" : "Such prayer speaks of David's utter reliance upon God. Being a mighty warrior, beloved of his people and his army he had a lot of power and liberty to do many things. But he instead just pours himself out before God in utter dependence. We must learn to walk in full reliance upon God and that is by no means to live a passive life but that for every action I take it's directed and approved by God.",
		"quitetimedate" : "2018-10-19"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 1,
		"versetext" : "Truly my soul waiteth upon God: from him cometh my salvation.",
		"verseref" : null,
		"versecomment" : "The one who has a habit of waiting upon the Lord is never disappointed, frustrated or anxious about anything. Waiting upon the Lord is the key to our walk with God. His ways are higher than us but we may feel and complain that he is silent and slow. When we see the only immediate solution of the problem He sees the eternal solution of the problem. We must learn to wait upon the Lord. All those things which make us rush we must avoid. By not waiting upon the Lord we risk too much and it costs too much.\r\n\r\nAs a child of God we sould be able to declare this with clear concience that \"from him cometh my salvation\". We cannot have occassional confirmation of this blessed truth. We should have this confirmation, confidence and clarity every moment. Only He is our salvation and from no where else.",
		"quitetimedate" : "2018-10-20"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 71,
		"verseid" : 1,
		"versetext" : "In thee, O LORD, do I put my trust: let me never be put to confusion.",
		"verseref" : null,
		"versecomment" : "David repeatedly declares that he trusts in God. While putting trust in God may sound flowery but we must know that when we put trust in Him we sign off to go by His ways. We completely throw ourselves on Him, not that we become passive in the process but for every little step we do exactly as He guides us. Without adding our own knowledge, emotions and plans into it. When we throw ourselves in utter reliance upon Him that's where we know that we will not live in any confusion any more.",
		"quitetimedate" : "2018-11-27"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 75,
		"verseid" : 1,
		"versetext" : "Unto thee, O God, do we give thanks, unto thee do we give thanks: for that thy name is near thy wondrous works declare.",
		"verseref" : null,
		"versecomment" : "The one characteristic stands out for a serious follower of Christ is that he ponders on the things God has created. He ponders on works of God. We at times so much filled with our own little things that we forget and at times even avoid to pause and take a look at God's marvelous works. When we contemplate on how He has created all the indescribable creation and that how He sustains all of that from centuries before we were and after we are gone, we cannot but praise God. Once we contemplate on immensity of His power we will be able to rest assured in Him for all little issues we are surrounded with on this side of eternity. ",
		"quitetimedate" : "2018-12-16"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 76,
		"verseid" : 1,
		"versetext" : "In Judah is God known: his name is great in Israel.",
		"verseref" : null,
		"versecomment" : "God is known among His people. If I claim the God of the Bible to be my God, He must be known in me and thru me. Having God within me and him not to be known is very impossible. Do people perceive God in me? People did perceive God in Joseph, in Daniel and in many others. God must be known in me. O God, I am ashamed to say that I cannot claim that He is known in me. Pardon me O God for not having that lie where you can shine  thru in me. ",
		"quitetimedate" : "2018-12-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 4,
		"verseid" : 1,
		"versetext" : "And Jesus being full of the Holy Ghost returned from Jordan, and was led by the Spirit into the wilderness,",
		"verseref" : null,
		"versecomment" : "Jesus being full of the Holy Spirit had no sign of laughter or any crazy things as it is taught today in the false version of Christianity. Being full of Holy Spirit did not turn out for Him in any Party of ecstasy. Often it has happened for the men of God that when they were full of Holy Spirit they were led to the wilderness. ",
		"quitetimedate" : "2019-02-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 10,
		"verseid" : 1,
		"versetext" : "After these things the LORD appointed other seventy also, and sent them two and two before his face into every city and place, whither he himself would come.",
		"verseref" : null,
		"versecomment" : "Jesus appointed \"other\" seventy also. These are obviously not his 12 disciples. God always has His chosen working for Him and so we must be careful about being quick in judgment who God's servant is and who is not. For sure we must discern based on God's words those who are the wolves in sheep's clothing. ",
		"quitetimedate" : "2019-05-11"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 137,
		"verseid" : 1,
		"versetext" : "By the rivers of Babylon, there we sat down, yea, we wept, when we remembered Zion.",
		"verseref" : null,
		"versecomment" : "We must be weeping if we are not in Zion, we have nothing to do with Babylon. Even if it rivers of Babylon, rivers are usually the place of serenity and quietness but we cannot have rested there. Our rest is only in Zion. We must not be Christians who are in Zion weeping over the things we had in Babylon like Israelites who couldn't shake off the memories of Egypt while they were on their way to the promised land. ",
		"quitetimedate" : "2019-05-21"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 1,
		"versetext" : "And it came to pass, that, as he was praying in a certain place, when he ceased, one of his disciples said unto him, Lord, teach us to pray, as John also taught his disciples.",
		"verseref" : null,
		"versecomment" : "Disciples constantly witnessed the prayer life of Jesus and that made them to desire the same and not just do it but to do it in the right way. So they asked Jesus to teach them to pray. Jesus could have taught them in the past but Jesus never seemed to have asked disciples to pray. His example made them desire and also do it. Our lives must be so that who watches us may be inspired to do the godly things they see us doing. Jesus indeed has taught that our lives must be exemplary. Our lives must be teaching in itself.\r\n\r\nThe other important thing to note here is that John taught his listeners to pray. John couldn't have taught that if he himself didn't do it. Prayer life is a so important for a Christian and neglecting it has dire consequences.",
		"quitetimedate" : "2019-05-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 1,
		"versetext" : "Then drew near unto him all the publicans and sinners for to hear him.",
		"verseref" : null,
		"versecomment" : "Jesus audience attracted publicans and sinners and that speaks a lot. The people whom we consider sinners and hooligans are sometimes are the biggest responders of the gospel.",
		"quitetimedate" : "2019-07-24"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 1,
		"versetext" : "And he spake a parable unto them to this end, that men ought always to pray, and not to faint;",
		"verseref" : null,
		"versecomment" : "Jesus always gave parable to a certain end. There was a lesson in each parable. He gave this parable to the end that we may understand the importance of prayer. Persistent prayer is not pestering. It is a great privilege. If God wants us not to pray about something then He will make it clear to us but until then we must be persistent in our prayer. Any prayer which is selfless can be and should be persistent. Fainting is somehow going into the mode where we start doubting God's ability to hear our prayer or His ability to do it. But we know for sure that neither is true. God loves the prayers of His saints because that gives Him assurance of surrendered and reliant heart and He never despises such heart.",
		"quitetimedate" : "2019-08-28"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 1,
		"versetext" : "And Jesus entered and passed through Jericho.",
		"verseref" : null,
		"versecomment" : "Jesus is on His way to Jerusalem and He passes thro Jerusalem.",
		"quitetimedate" : "2019-09-10"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 20,
		"verseid" : 1,
		"versetext" : "And it came to pass, that on one of those days, as he taught the people in the temple, and preached the gospel, the chief priests and the scribes came upon him with the elders,",
		"verseref" : null,
		"versecomment" : "There is never in the history greater opposition to the truth but from the so-called spiritual leaders. In the time of Nehemiah also he always had to face the threats from inside. We must not lose our hearts when we face this situation as we know that the author and finisher of our faith, our Lord and Savior Jesus Christ walked thru that path already.",
		"quitetimedate" : "2019-10-03"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 1,
		"versetext" : "And he looked up, and saw the rich men casting their gifts into the treasury.",
		"verseref" : null,
		"versecomment" : "God watches all of our actions. He was watching then and He is watching even now.",
		"quitetimedate" : "2019-10-15"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 2,
		"verseid" : 1,
		"versetext" : "And the third day there was a marriage in Cana of Galilee; and the mother of Jesus was there:",
		"verseref" : null,
		"versecomment" : "Probably this is the third day of John witnessing about Jesus. He was already baptized by John and also endured the forty days of wilderness experience.",
		"quitetimedate" : "2019-12-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 4,
		"verseid" : 1,
		"versetext" : "When therefore the LORD knew how the Pharisees had heard that Jesus made and baptized more disciples than John,",
		"verseref" : null,
		"versecomment" : "People flocked to Jesus to get baptized and John slowly faded. The people once who were feared by the Pharisees about John are now losing the memory of John. Till the point that Herod dared to throw John into prison and there was no uproar in the public about it! John confirmed from the beginning that he was not Christ but just a precursor of Him. John's humbleness paved the way for Jesus and His disciples to baptize more people.",
		"quitetimedate" : "2019-12-31"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 5,
		"verseid" : 1,
		"versetext" : "After this there was a feast of the Jews; and Jesus went up to Jerusalem.",
		"verseref" : null,
		"versecomment" : "Jesus went to attend the feast! This shows that Jesus did honor the the days of feasts which were given to Moses for the Jews. Bible does not encourage us to revile against the good customs and traditions given to us by our forefathers as far as those traditions are not turning God into itself. Mosaic law was not sufficient for salvation but surely was great aid towards it. Not that by keeping the tradition we can attain God but God wants us to not to rebel against the good traditions set by men as far as those traditions contradict God's word.",
		"quitetimedate" : "2020-01-10"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 16,
		"verseid" : 1,
		"versetext" : "These things have I spoken unto you, that ye should not be offended.",
		"verseref" : "1 Peter 4:12",
		"versecomment" : "1 Peter 4:12",
		"quitetimedate" : "2020-04-27"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 61,
		"verseid" : 2,
		"versetext" : "From the end of the earth will I cry unto thee, when my heart is overwhelmed: lead me to the rock that is higher than I.",
		"verseref" : null,
		"versecomment" : "King David when his heart was overwhelmed he cried out to God for help. Many times we do not cry out to God for help because of our ego and pride. We try to solve all issues ourselves or if at all when we cry out to God we want to just solve issues for us so we can live the way we want. Both approaches can lead us to greater loss and damage. We should humble ourselves and admit that only God is our help and refuge in the times of troubles not for the personal selfish agendas but out of the heart which is so committed and given up to God.",
		"quitetimedate" : "2018-10-19"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 2,
		"versetext" : "He only is my rock and my salvation; he is my defence; I shall not be greatly moved.",
		"verseref" : null,
		"versecomment" : "When God is our rock and our salvation there is no force in the entire universe to move us or in other words, there is no greater safety and security as we have in our God. HE is unmovable rock. When we walk humbly with Him in carrying out every smallest detail what he asks to do we can claim this promise. Every promise and confirmation we can have in God comes with great responsibility.\r\n\r\nHow soon it is before we realize that all earthly promises are very futile in nature! But not so with our God. He promises and never ever turns away from it. The one who has deeply experienced the love of God would never ever look for anything else to get satisfied and will not eb satisfied with anything else unless He\/She sits in His presnce and drink from His selfless and eternal love.",
		"quitetimedate" : "2018-10-20"
	},
	{
		"bookid" : 1,
		"bookname" : "Genesis",
		"chapterid" : 1,
		"verseid" : 2,
		"versetext" : "And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters.",
		"verseref" : null,
		"versecomment" : "There are theories which says there is a big gap of time between verse 1 & 2. ",
		"quitetimedate" : "2018-10-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 2,
		"versetext" : "And after six days Jesus taketh with him Peter, and James, and John, and leadeth them up into an high mountain apart by themselves: and he was transfigured before them.",
		"verseref" : null,
		"versecomment" : "What happened during these six days is not recorded but I believe He spent time in prayer and in close intimacy with His Father in heaven. Jesus never took vacation for sure. He exactly knew what He is going to do everyday and after six days and sixty days and even past his resurrection. But we know that He had a great prayer life spending hours and whole night in prayer quite often. Before He was goign to go through this glorious event of transfiguration He must have prayed.",
		"quitetimedate" : "2018-10-22"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 4,
		"verseid" : 2,
		"versetext" : "Being forty days tempted of the devil. And in those days he did eat nothing: and when they were ended, he afterward hungered.",
		"verseref" : null,
		"versecomment" : "When attacks of Devil are multiplied the only way to stand is by fasting & spending time with God. Fasting has a great impact on the life of a Christian. Jesus did not eat anything for forty days and He did not die or become faint. God who created our bodies is able to sustain us without food. \r\n\r\nO God forgive me as I have neglected your word, my personal prayer time and especially fasting and it has damaged my walk with you so greatly. Forgive me O Father for the sake of thy name. Amen.",
		"quitetimedate" : "2019-02-20"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 110,
		"verseid" : 2,
		"versetext" : "The LORD shall send the rod of thy strength out of Zion: rule thou in the midst of thine enemies.",
		"verseref" : null,
		"versecomment" : "Our God is mighty and when He is with His people, they rule in the midst of their enemies. Now, this is difficult to believe but we must. Being a follower of Christ, the living God of Abraham, Isaac, and Jacob we must know our standing with our God. There are times we do not understand how much safer we are by being under His mighty wings and we are tormented. But we should understand that He makes His people rule in the midst of the enemies. ",
		"quitetimedate" : "2019-03-30"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 10,
		"verseid" : 2,
		"versetext" : "Therefore said he unto them, The harvest truly is great, but the labourers are few: pray ye therefore the Lord of the harvest, that he would send forth labourers into his harvest.",
		"verseref" : null,
		"versecomment" : "When Jesus mentioned about few laborers, He asked for prayer that God may send forth laborers. He did not ask to pray for people to donate more money but to pray to God that He would send the laborers. God is never out of resources and hence, so-called Gods servants who go around asking for money for ministry is not biblical and should not be encouraged.",
		"quitetimedate" : "2019-05-11"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 137,
		"verseid" : 2,
		"versetext" : "We hanged our harps upon the willows in the midst thereof.",
		"verseref" : null,
		"versecomment" : "there is nothing to sing about in Babylon. In the place of sin and sinfulness, we never can worship God with all our heart.",
		"quitetimedate" : "2019-05-21"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 2,
		"versetext" : "And he said unto them, When ye pray, say, Our Father which art in heaven, Hallowed be thy name. Thy kingdom come. Thy will be done, as in heaven, so in earth.",
		"verseref" : null,
		"versecomment" : "There is no Holy Father on earth as some teach and practice. There is only one Holy Father and his dwelling is in Heaven. He surely lives within us thru His son Jesus Christ. ",
		"quitetimedate" : "2019-05-25"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 146,
		"verseid" : 2,
		"versetext" : "While I live will I praise the LORD: I will sing praises unto my God while I have any being.",
		"verseref" : null,
		"versecomment" : "It's life long commitment and determination David made that He will praise the Lord while he lives. In other words, he will praise the Lord all the days if his life. Added to that he goes further and says that he will be singing praises while he has any being and that indicates beyond the physical life. We know that our existence or our being is not just physical and even when we cease to exist physically our being are forever and hence we will be praising God all our days on this earth and beyond the grave where we will continue in our being. This is mind-boggling for our finite ",
		"quitetimedate" : "2019-06-02"
	},
	{
		"bookid" : 20,
		"bookname" : "Proverbs",
		"chapterid" : 10,
		"verseid" : 2,
		"versetext" : "Treasures of wickedness profit nothing: but righteousness delivereth from death.",
		"verseref" : null,
		"versecomment" : "Any wise person does not look for the immediate profit in life rather he would look for the long term values. Treasure collected by means of wickedness does not profit at all. It may bring temporary respect, riches or fame but it is useless to bring inner peace in one's life. The rest which every soul longs for and that very longing is put by God Himself and only God can fulfill it.",
		"quitetimedate" : "2019-07-13"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 2,
		"versetext" : "And the Pharisees and scribes murmured, saying, This man receiveth sinners, and eateth with them.",
		"verseref" : null,
		"versecomment" : "Jesus spending time with sinners, eating with them was not equal to partying or banqueting with them as some falsely believe. We must know the difference between friendship and fellowship. Friendship does not require deep agreements while fellowship does. Friends can have differences, fellowship cant afford that. Fellowship requires one heart while friendship doesn't. Going to other extreme using Jesus as an example of hanging out with sinners would cost too much. We must understand the boundaries and stay within those boundaries. But at the same time, we must not shy away from spending time with those who don't know Christ. For the sake of gospel, we should be able to sit, talk, eat with those who don't know Christ.",
		"quitetimedate" : "2019-07-24"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 20,
		"verseid" : 2,
		"versetext" : "And spake unto him, saying, Tell us, by what authority doest thou these things? or who is he that gave thee this authority?",
		"verseref" : null,
		"versecomment" : "It is not that the Pharisees didn't know with what power Jesus was doing all the mighty works and also His preaching. It was more just to catch Him somehow in His words. We must seek God's help to understand the motives behind questions, there are times when the questioner would not have pure motives but to find something in our answers with which they would attack us.",
		"quitetimedate" : "2019-10-03"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 2,
		"versetext" : "And he saw also a certain poor widow casting in thither two mites.",
		"verseref" : null,
		"versecomment" : "This poor widow must be casting her two mites in a way that it may not draw much attention of others. As she walks along with rich people to the offering box, within her she must be feeling so small. But she walked with great faith. She gave away what all she had.",
		"quitetimedate" : "2019-10-15"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 2,
		"versetext" : "Every branch in me that beareth not fruit he taketh away: and every branch that beareth fruit, he purgeth it, that it may bring forth more fruit.",
		"verseref" : null,
		"versecomment" : "We must understand and accept the fact that God does not and will not keep the branch which does not tied fruit. This should alert us greatly and make us to do that introspection if we are yielding fruits or not. Fruits always is not the # of people we can claim we brought to Christ. Fruits are the cultivation of godly virtues in us. If we don't have fruits than we are using heavenly resources for not and God doesn't allow that to happen. \r\n\r\nOn the other hand if we are fruit bearers than God wants u to increasein fruit bearing and hence He will does the pruning. Pruning also requires cutting and that might heart. There may be beautiful looking little sprout but God knows that it is not healthy for our growth and He may take that nice looking sprout out of us so that we may produce the fruits which He desires in us. Even though the experience of pruning may not be pleasant but outcome will surely be very pleasant for us and also for His glory.",
		"quitetimedate" : "2020-04-19"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 18,
		"verseid" : 2,
		"versetext" : "And Judas also, which betrayed him, knew the place: for Jesus ofttimes resorted thither with his disciples.",
		"verseref" : null,
		"versecomment" : "Garden of Gathesamene was not first time for Jesus and His disciples. As the verse suggests it was place Jesus and His disciples been frequently for fellowship, teaching and praying. Judas knew this very well.",
		"quitetimedate" : "2020-05-12"
	},
	{
		"bookid" : 1,
		"bookname" : "Genesis",
		"chapterid" : 1,
		"verseid" : 3,
		"versetext" : "And God said, Let there be light: and there was light.",
		"verseref" : "Joshua 1:1,Job 1:1,Leviticus 3:5,2 Kings 5:5,2 Chronicles 10:10,John 1:1",
		"versecomment" : "John represented as the light",
		"quitetimedate" : "2018-10-19"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 3,
		"versetext" : "How long will ye imagine mischief against a man? ye shall be slain all of you: as a bowing wall shall ye be, and as a tottering fence.",
		"verseref" : null,
		"versecomment" : "David was a king and a warrior. He was always surrounded by the enemies, at times from within and at times from outside. There were times when the forces against him were more powerful than him. But his heart was so set upon the God of Abraham, Isaac, and Jacob that he knew deep down in his heart that all his enemies will not stand as far as God of Israel is on his side. What a great confirmation! When our heart is set on the Lord we can enjoy this great promise! No matter who our enemy is, we are safe and secure without any doubt. We are covered in His arms and in the covert of His wings and that is our greatest security. We can joyfully and truthfully can declare that because my God is my defence all my enemies will be removed.",
		"quitetimedate" : "2018-10-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 3,
		"versetext" : "And his raiment became shining, exceeding white as snow; so as no fuller on earth can white them.",
		"verseref" : "Isaiah 1:18",
		"versecomment" : "The glory of God is incomparable. His clothes became exceedingly white that the three witnesses could not compare in their natural context. It was supernatural. There are things only God can do. We can do our best and doing certain things with utmost care and excellence and take pride in it but when we compare with what God has done we just stand amaze and worship Him. His glory and doings are past understanding of any man on this earth.",
		"quitetimedate" : "2018-10-22"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 71,
		"verseid" : 3,
		"versetext" : "Be thou my strong habitation, whereunto I may continually resort: thou hast given commandment to save me; for thou art my rock and my fortress.",
		"verseref" : null,
		"versecomment" : "The habitation we have in the Lord is unshakeable, unmovable and everlasting. We can continually resort into that habitation. There is no fortress as our God, the God of Abraham, Isaac and Jacob. We must remember this deepest and blessed truth forever even though at times it may not make sense, God never changes and He still is our fortress and our Rock. ",
		"quitetimedate" : "2018-11-27"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 10,
		"verseid" : 3,
		"versetext" : "Go your ways: behold, I send you forth as lambs among wolves.",
		"verseref" : null,
		"versecomment" : "The message is clear that we are as lambs among the wolves and hence trying to be anything but lambs will disqualify us as sent by Him. Also as lamb is incapable to fight against wolves, in fact, lamb in front of wolf always is in danger of its life and so we are as sent by God. But the secret here is that we are not at the discretion of wolves rather we are covered by God Almighty Himself and without His permission, there is no wolf who would be able to touch us or lay their hands on us.",
		"quitetimedate" : "2019-05-11"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 146,
		"verseid" : 3,
		"versetext" : "Put not your trust in princes, nor in the son of man, in whom there is no help.",
		"verseref" : null,
		"versecomment" : "God has spoken to me this thing again and again so many times that I do not have to put my hope in princes or any human being because they are finite and fallible. In the best of their strength and wisdom, they are so limited and hence looking for help in them is futile and fragile.",
		"quitetimedate" : "2019-06-02"
	},
	{
		"bookid" : 20,
		"bookname" : "Proverbs",
		"chapterid" : 10,
		"verseid" : 3,
		"versetext" : "The LORD will not suffer the soul of the righteous to famish: but he casteth away the substance of the wicked.",
		"verseref" : null,
		"versecomment" : "A righteous may be hated when most of the people around him are filled with an average opinion about righteousness. He suffers from the lonely and deep anguish within to flee from such condition. God knows such soul and He cares for such who do not bow down to average and compromised holiness. God knows even the weakness of a righteous man and He cares enough to instruct such man to rescue him from his own follies.",
		"quitetimedate" : "2019-07-13"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 3,
		"versetext" : "And he said, Of a truth I say unto you, that this poor widow hath cast in more than they all:",
		"verseref" : null,
		"versecomment" : "God does not look at the amount, He looks at the heart. Sacrificial giving has the highest regards in God's eyes. We may not be able to give much but if we give with all our hearts and full trust in God that he will take care of our needs, it pleases Him greatly. That kind of giving in God's eyes is the highest giving. This widow had the last 2 mites left. She was a widow and hence she had no support in an earthly manner. We don't know what kind of Job she had but we know that she was poor. She gave it all. Jesus immediately rewarded her with greatest personal recognition. She gave more than all. \r\n\r\nGod wants us to be such a giver. When we pile more for us it drags into the evil and we always will end up justifying ourselves about our greed for money. But we must learn to give sacrificially and God who has never failed will never fail in the future as well. He is the owner of all the wealth of this earth and outside the earth. He doesnt need to borrow from anyone and His economy never ever goes down. We must give without reservations.",
		"quitetimedate" : "2019-10-15"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 2,
		"verseid" : 3,
		"versetext" : "And when they wanted wine, the mother of Jesus saith unto him, They have no wine.",
		"verseref" : null,
		"versecomment" : "Mary shows up as a caring woman a virtue which also proves that she was a godly woman. She was a guest or probably in close acquaintance of the host but she cared for the event which she could have easily avoided and disregarded. She knew for sure that Jesus can do something. She knew that Jesus was not rich and could not have bought the wine but she knew that He is not just an ordinary son but the Son of God. She approached Him immediately out of care and necessity. ",
		"quitetimedate" : "2019-12-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 3,
		"verseid" : 3,
		"versetext" : "Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God.",
		"verseref" : null,
		"versecomment" : "It seems that Nicodemus though being a Pharisee, knew deep down in his heart that Jesus is sent from God and he did admit it as well. He told that to Jesus too. But to all his good talk the answer he received from Jesus was straight forward. \"Except a man be born again, he cannot see the kingdom of God\". Jesus was not taken up by the praise he received but He instead pointed the real need Nicodemus had and that to be born again. The words of Nicodemus had no effect on Jesus, He didn't get caught up in the bliss of praise and good words. Jesus didn't even thank Nicodemus for what good things he said about Him. Out of great concern, Jesus was more focused on saving Nicodemus from his ignorance and show him the truth about the kingdom of God and how and who can enter in it.",
		"quitetimedate" : "2019-12-25"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 4,
		"verseid" : 3,
		"versetext" : "He left Judaea, and departed again into Galilee.",
		"verseref" : null,
		"versecomment" : "Jesus was not running away from Pharisees out of fear but He had all His timings exact for all events which took place in His life. He had a divine appointment to fulfill in Samaria.",
		"quitetimedate" : "2019-12-31"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 18,
		"verseid" : 3,
		"versetext" : "Judas then, having received a band of men and officers from the chief priests and Pharisees, cometh thither with lanterns and torches and weapons.",
		"verseref" : null,
		"versecomment" : "Authorities of this world more often sides with evil than the godly. Judas got an army on His side against Jesus. We as a follower of Christ should not be surprised when authorities do not respond to our cause and side with ungodly. \r\n\r\nWhy they had to come equipped with armed force to arrest Jesus? Was there any record of Jesus and His disciples of any kind of violence in the past? They all were aware of it. Then why they had to come with weapons ? Not sure but probably they may have prepared if they have to face the job of people who may be upset with arrest of Jesus!\r\n\r\nOn the other hand why Judas did what he did? What did he saw Jesus doing for three years daily walking with Him that made him so upset with Jesus that he decided to betray Jesus. Following Jesus with wrong motive surely does not go too far. Thinking of Jesus according to our standard will bring nothing but disappointment and frustration. Following God requires full surrender or else the moment will come when we may end up hating Him more than we loved Him.",
		"quitetimedate" : "2020-05-12"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 3,
		"versetext" : "And said, Hail, King of the Jews! and they smote him with their hands.",
		"verseref" : null,
		"versecomment" : "When leader takes wrong steps follower are either forced to take same wrong steps to please their leader or they are boldened in their evil to take evil steps which indirectly are already approved by the action of their leader.",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 61,
		"verseid" : 4,
		"versetext" : "I will abide in thy tabernacle for ever: I will trust in the covert of thy wings. Selah.",
		"verseref" : null,
		"versecomment" : "David did not desire for the luxury of the palace rather his desire was to live in the tabernacle or in other words in God's presence forever. He would trust the covert of God's wings over his own wisdom, wealth or power. We must so fully digest this undeniable truth that we cannot trust anything else but the mighty wings of God almighty spread over us. Let not devil deceive us by any means that God is invisible and distant. Our God is much more real that anything our eyes can see and our hand can touch. We can trust him for eternity.",
		"quitetimedate" : "2018-10-19"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 4,
		"versetext" : "They only consult to cast him down from his excellency: they delight in lies: they bless with their mouth, but they curse inwardly. Selah.",
		"verseref" : null,
		"versecomment" : "At times our enemies are not all who come with swords and spears, they may come with lying words of peace and comfort while they are filled with curse and anger towards us. This can be tricky for us to understand but our God who weighs the very thoughts of every man saves us from such deceptions and tricks as well. \r\n\r\nIn God, we are secure not just by apparent enemies but even from deceivers as well who come near to us in the mask of a friend to harm us. How faithful God we have and how great are His promises!",
		"quitetimedate" : "2018-10-20"
	},
	{
		"bookid" : 1,
		"bookname" : "Genesis",
		"chapterid" : 1,
		"verseid" : 4,
		"versetext" : "And God saw the light, that it was good: and God divided the light from the darkness.",
		"verseref" : null,
		"versecomment" : "God carefully examined all His creation.",
		"quitetimedate" : "2018-10-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 4,
		"versetext" : "And there appeared unto them Elias with Moses: and they were talking with Jesus.",
		"verseref" : null,
		"versecomment" : "It is such a humbling experience that Jesus was talking to Elias & Moses. We don't know what they did talk. But Jesus being God the son why He had any need to counsel or have discussion with Elias & Moses? This was talking to dead people, this was real. God had need to talk to Elias & Moses. All we Christians should understand that we need to humble enough to contact\/talk\/discuss things with our fellow brothers and sisters. If Jesus being God saw need to talk to Elias & Moses how much more should we?",
		"quitetimedate" : "2018-10-22"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 71,
		"verseid" : 4,
		"versetext" : "Deliver me, O my God, out of the hand of the wicked, out of the hand of the unrighteous and cruel man.",
		"verseref" : null,
		"versecomment" : "David requests God to save him from the hand of the wicked! He was a king and can easily judge the wicked man but he instead prays to God to be his deliverer. We must rely on God Almighty to save us from wicked, unrighteous and cruel men. We may act and react in our limited understanding but He would execute judgment upon wicked, unrighteous and cruel in His eternal wisdom. The only we can have sound sleep is to rest in the Lord that He will deliver us from the unrighteous.",
		"quitetimedate" : "2018-11-27"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 76,
		"verseid" : 4,
		"versetext" : "Thou art more glorious and excellent than the mountains of prey.",
		"verseref" : null,
		"versecomment" : "God is far more glorious and excellent than the any glorious mountains or anything in the nature.",
		"quitetimedate" : "2018-12-20"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 110,
		"verseid" : 4,
		"versetext" : "The LORD hath sworn, and will not repent, Thou art a priest for ever after the order of Melchizedek.",
		"verseref" : null,
		"versecomment" : "When God of Abraham, Isaac and, Jacob sworn about something there is no power in the known world or unknown world which can change it. There is none to challenge Him and so we must be at peace.",
		"quitetimedate" : "2019-03-30"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 4,
		"versetext" : "For all these have of their abundance cast in unto the offerings of God: but she of her penury hath cast in all the living that she had.",
		"verseref" : null,
		"versecomment" : "Jesus confirmed that this widow gave even she was extremely poor and she gave it all. What a great life! How great was her faith! She did not murmur that money was misused in the temple. Many people don't give raising the concern that offerings are misused but we must know that God is careful enough to make them accountable who misuse offerings.",
		"quitetimedate" : "2019-10-15"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 2,
		"verseid" : 4,
		"versetext" : "Jesus saith unto her, Woman, what have I to do with thee? mine hour is not yet come.",
		"verseref" : null,
		"versecomment" : "The answer Jesus gave to His mother seems to be harsh but probably Jesus wanted to do nothing out of family pressure or influence. He had come to His Father's will and not His own or His mother's will. This was not an act of disobedience or humiliation but drawing a line and making it known that He is come to do His Father's will only.",
		"quitetimedate" : "2019-12-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 4,
		"versetext" : "Abide in me, and I in you. As the branch cannot bear fruit of itself, except it abide in the vine; no more can ye, except ye abide in me.",
		"verseref" : null,
		"versecomment" : "The great responsibility and an honor is upon us to bear fruits for the Lord but we can't do it ourselves. We must be drawing all energy and required resources from Him. He is our only resource and none else. If we try to bear fruits in our own power and strength we will fail. Devil always will encourage us that we can do without God but nothing is further from the truth. ",
		"quitetimedate" : "2020-04-19"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 18,
		"verseid" : 4,
		"versetext" : "Jesus therefore, knowing all things that should come upon him, went forth, and said unto them, Whom seek ye?",
		"verseref" : null,
		"versecomment" : "This was profound question from Jesus and should have opened their eyes but the devil blinded their eyes and they couldn't see. Why do they sought Jesus? To arrest and to kill! To fulfill the plan they had planned. The plan to do away with this person that chief priest does not feel threatened and Romans don't fill threatened. But that momentary feeling of safety just pushed them to eternal damnation! They sought Jesus so their life goes well.\r\nWhy do we seek Jesus? He is asking us today. Let us sit down and lay out our reasons honestly why we love Him.",
		"quitetimedate" : "2020-05-12"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 4,
		"versetext" : "Pilate therefore went forth again, and saith unto them, Behold, I bring him forth to you, that ye may know that I find no fault in him.",
		"verseref" : null,
		"versecomment" : "Pilate's second verbal admittance that he did not find any fault in Jesus. ",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 5,
		"versetext" : "And Peter answered and said to Jesus, Master, it is good for us to be here: and let us make three tabernacles; one for thee, and one for Moses, and one for Elias.",
		"verseref" : null,
		"versecomment" : "There are times that the heavenly bliss falls upon us and we do just want to stay in that state never to come out. The presence of God and the glory of God is so powerful that once a person truly grasps it and experiences it he\/she would never ever want to leave that place or state. I know it has happened to me so many times that the utter blissfulness of place of worship and time of worship has just grabbed me to my core and to depart from that place or situation feels sad. Probably this would be the experience of every follower of Christ. And so did it happen with Peter too. Peter was quite expressive by his nature and so he was the first to make this suggestion to stay there for a long period of time as he was suggesting even to make a tabernacle and in other words to pitch the tent.",
		"quitetimedate" : "2018-10-22"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 5,
		"versetext" : "My soul, wait thou only upon God; for my expectation is from him.",
		"verseref" : null,
		"versecomment" : "One of the great secrets of David's life was his continued dependence and waiting on the Lord. Over the period we have arrived at the place where everything around needs to happen instantly. Not aligning with that lifestyle would put us in the bucket of a fool. But we must understand that there is no option of waiting on the Lord in our walk with the Lord. that is the only way we can grow in the Lord and enjoy His eternally blissful presence.\r\n\r\nAll our expectations must be from Him. Expectation outside of Him will be futile, disappointing and betraying. We must enjoy what we receive from Him in every area of our life.",
		"quitetimedate" : "2018-10-24"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 76,
		"verseid" : 5,
		"versetext" : "The stouthearted are spoiled, they have slept their sleep: and none of the men of might have found their hands.",
		"verseref" : null,
		"versecomment" : "There are no mighty men who have stood before God....many mighty men came and are gone forever. But He lives forever and ever. He was before the earth was and He will be there when it is gone. He is unfathomable and unsearchable. Only prideful can have problem to surrender under Him. It would be utter foolishness to be able to comprehend the finiteness of us and still be so prideful to think that we can outlive Him! O God help me to understand the count of my days and the immensity of your infinite vastness.",
		"quitetimedate" : "2018-12-20"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 146,
		"verseid" : 5,
		"versetext" : "Happy is he that hath the God of Jacob for his help, whose hope is in the LORD his God:",
		"verseref" : null,
		"versecomment" : "But it is absolutely blessed who has put his hope in the Lord and that he knows deep down in his heart so firmly that God of Jacob is his help. The God who made heaven and earth and so even heaven and the earth so hence nothing in heaven and earth can do any harm while God of Jacob is the one who saves.",
		"quitetimedate" : "2019-06-02"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 2,
		"verseid" : 5,
		"versetext" : "His mother saith unto the servants, Whatsoever he saith unto you, do it.",
		"verseref" : null,
		"versecomment" : "Even though Jesus' answer did not sound affirmative still Mary dared to tell servants to to do what He may say. This gives us clear indication that Jesus did not deny to help the situation but His talk to Mary was for whole different meaning. Mary knew it, she was with Him for 30 long years. Watching Him daily doing daily chores a perfectly obedient son to have. Probably this must have been her first public talk to Jesus or we do not know if it was a private talk between her and Jesus. But she was convinced that Jesus would not but help the situation.",
		"quitetimedate" : "2019-12-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 16,
		"verseid" : 5,
		"versetext" : "But now I go my way to him that sent me; and none of you asketh me, Whither goest thou?",
		"verseref" : null,
		"versecomment" : "Jesus was sure where He was going and that is the fact for every follower of Christ. We know where we are going and that is to our heavenly Father. It's not a wishful guess but it's solid confirmation and an unfailing promise of God we have in Christ.",
		"quitetimedate" : "2020-04-29"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 17,
		"verseid" : 5,
		"versetext" : "And now, O Father, glorify thou me with thine own self with the glory which I had with thee before the world was.",
		"verseref" : null,
		"versecomment" : "Here Jesus shows His existence from eternity past before even world was created. This should help us to know deeply that Jesus was God and He is and will be God forever.",
		"quitetimedate" : "2020-05-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 5,
		"versetext" : "Then came Jesus forth, wearing the crown of thorns, and the purple robe. And Pilate saith unto them, Behold the man!",
		"verseref" : null,
		"versecomment" : "The followers of Christ are shamed in this world. Evil people puts them on display to mock them and shame them as they did to Jesus.",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 6,
		"versetext" : "For he wist not what to say; for they were sore afraid.",
		"verseref" : null,
		"versecomment" : "Probably this is the experience of every believer how the view and touch of His glory make us so speechless. And the fear of God's presence which so vastly different than the normal fear of danger. The fear we feel in God's presence is not life-threatening but is undescribably blissful and joyful. \r\n\r\nWhat Peter said was not wrong by any means. He was so much caught up by the experience he just had and he just wanted to stay there as long as he can in that celestially blissful moments.",
		"quitetimedate" : "2018-10-22"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 6,
		"versetext" : "He only is my rock and my salvation: he is my defence; I shall not be moved.",
		"verseref" : null,
		"versecomment" : "What an unshaken confirmation that God of Abraham, Isaac and Jacob is our rock, our salvation, our defence and that is the only reason we can be sure that we also will be unshaken and unmovable. All weapon formed against us by devil will not work and will never work as far as He is at our defence.",
		"quitetimedate" : "2018-10-24"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 75,
		"verseid" : 6,
		"versetext" : "For promotion cometh neither from the east, nor from the west, nor from the south.",
		"verseref" : null,
		"versecomment" : "This is for me as I meditate upon it. Yes people on the earth has power and when that power is in the hands of unjust people who oppress us and do not recognize us when we think we should have been, it hurts. But we do not work or perform our duties to receive the praises from men. There is no honest work done under the sun which is not done for our heavenly father. When we work it is for the Lord and we must have this fixed in our heart. He is watching over our work and labor and He is our rewarder. We must not be baffled and tormented within ourselves when we are pushed aside dishonestly. Our reward is not gone, it is always there with God and He will lift us up in due times.",
		"quitetimedate" : "2018-12-16"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 77,
		"verseid" : 6,
		"versetext" : "I call to remembrance my song in the night: I commune with mine own heart: and my spirit made diligent search.",
		"verseref" : null,
		"versecomment" : "Here is the picture of a man who seems to be extremely troubled. We don't know the cause of his troubles but it seems he is bent by the burden of his soul. He has no rest in the day or no rest in the night. He is not able to speak and not able to sleep. He has searched the history for the help but nothing seems to be helping him. He is just like a Christian in the Pilgrim's Progress. ",
		"quitetimedate" : "2018-12-22"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 1,
		"verseid" : 6,
		"versetext" : "There was a man sent from God, whose name was John.",
		"verseref" : null,
		"versecomment" : "John had a great witness that he was sent by God. We should covet this title over any other title the Christendom can give us. There are self-centered Christians who have grabbed many titles but they lack only one title \"sent by God\". They may presume it to be so but sadly their life would speak the opposite. Compare them with the life of John and that presumption would vanish faster than we can think.\r\n\r\nWe must be the one sent from God to carry out specific tasks for His glory. For every believer, God has a certain task to fulfill in his\/her earthly journey. Jesus had a task to fulfill His Father's will to die on the cross. John had a task to be the forerunner of the Messiah. Abraham had a task to become the father of faith. and so on...We all have a task and we should find it out for God's glory. I wish no one would bear the false notion that God has given him a task to be a billionaire. Only those who have such secret desires and do not have the courage to openly tell that they are greedy hide behind using God to somehow legitimize such earthly desires.",
		"quitetimedate" : "2019-12-12"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 12,
		"verseid" : 6,
		"versetext" : "This he said, not that he cared for the poor; but because he was a thief, and had the bag, and bare what was put therein.",
		"verseref" : null,
		"versecomment" : "When a person acts in such a way that he may be perceived as spiritual and godly but still behind the scene in his\/her heart he\/she has nothing but personal and selfish agendas, he\/she gets nothing but the rebuke from the Lord. How serious it is, to be honest, and clean our intentions before God who knows every corner of our heart and our invisible being which consists of thoughts, intentions, and emotions is also quite readable for Him! Who can hide from God! Absolutely no one!",
		"quitetimedate" : "2020-03-20"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 16,
		"verseid" : 6,
		"versetext" : "But because I have said these things unto you, sorrow hath filled your heart.",
		"verseref" : null,
		"versecomment" : "There are times when telling the truth is far more important then suppressing it. Jesus told all things to disciples which may have weighed heavy on them but it was needed to be told and Jesus did. We as a follower of Christ should never shy away from telling or practicing the truth we have received in Christ.",
		"quitetimedate" : "2020-04-29"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 18,
		"verseid" : 6,
		"versetext" : "As soon then as he had said unto them, I am he, they went backward, and fell to the ground.",
		"verseref" : null,
		"versecomment" : "Evil may get bolden over the time but the glimpse of Holiness of God and the radiance of His glory is to powerful for evil to withstand. Just by hearing from Jesus' mouth who he was devil was already fallen and defeated. ",
		"quitetimedate" : "2020-05-12"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 6,
		"versetext" : "When the chief priests therefore and officers saw him, they cried out, saying, Crucify him, crucify him. Pilate saith unto them, Take ye him, and crucify him: for I find no fault in him.",
		"verseref" : null,
		"versecomment" : "When the chief priest and officers saw Jesus in His already dire condition as by this time He was already flogged and filled with excruciating pain by the thorns which was constantly pricking His head, they cried out to crucify him. Let's remember that these evil men knew that they cannot put Jesus to death and so they were after Pilate to instigate Roman law on Him.\r\n\r\nEvil has one characteristic that the one who is pissed by devil would seek more evil at the sight of evil. Brutality is the product of evil multiplying over itself.",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 7,
		"versetext" : "And there was a cloud that overshadowed them: and a voice came out of the cloud, saying, This is my beloved Son: hear him.",
		"verseref" : null,
		"versecomment" : "The voice from heaven roared and advised them to listen to Him. This was I believe by no mean a rebuke but surely was a correction. Peter just wanted to stay in this exceedingly blissful moment but not so with God. God surely wants His children to experience the blissfulness of His presence but He also wants us to go out and witness to the world sitting in the darkness and ready to perish. And only those who have experienced God's presence so deeply can go out and make deep impact in the world of darkness.",
		"quitetimedate" : "2018-10-22"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 7,
		"versetext" : "In God is my salvation and my glory: the rock of my strength, and my refuge, is in God.",
		"verseref" : null,
		"versecomment" : "David's repetition of this words shows how much he is convinced and caught up in this belief and the conviction. My glory, my strength, my refuge is my God. Once we taste His presence and the eternally unchanging promises it would be so difficult for us to live in any other hope outside of Him. As years pass by we understand more and more how shacky this world is and how false & empty are its promises. And in that utter hopelessness and emptiness to know that God of Israel is our all in all is undescribably joyful.",
		"quitetimedate" : "2018-10-24"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 110,
		"verseid" : 7,
		"versetext" : "He shall drink of the brook in the way: therefore shall he lift up the head.",
		"verseref" : null,
		"versecomment" : "Verse 5, 6 & 7 speaks about how God rises up in His anger to deal with evil people. No matter they are mightiest kings on this earth but in His might, He just dissipates them like a vanishing smoke! His wrath is the last thing anyone would like to face.\r\n\r\nO Lord, hide me now under thy wings as I face the evil which sometimes I think is too big to deal with. Fill my soul with thy presence and let me rest in thee that cannot be shaken. Amen.",
		"quitetimedate" : "2019-03-30"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 137,
		"verseid" : 7,
		"versetext" : "Remember, O LORD, the children of Edom in the day of Jerusalem; who said, Rase it, rase it, even to the foundation thereof.",
		"verseref" : null,
		"versecomment" : "Our duty is to cry out to God of Abraham, Isaac, and Jacob who is our true deliverer and defender. Yes enemy may try to destroy us but God will surely show His mighty arms on our behalf to protect us and keep us.",
		"quitetimedate" : "2019-05-21"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 146,
		"verseid" : 7,
		"versetext" : "Which executeth judgment for the oppressed: which giveth food to the hungry. The LORD looseth the prisoners:",
		"verseref" : null,
		"versecomment" : "There is a great comfort for a child of God realizing and trusting the fact that He executes the judgment for the oppressed. He knows how to get downtrodden and persecuted out of their troubles. He might allow a certain situation as training for his children but He never will let them fall into shame.",
		"quitetimedate" : "2019-06-02"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 7,
		"versetext" : "I say unto you, that likewise joy shall be in heaven over one sinner that repenteth, more than over ninety and nine just persons, which need no repentance.",
		"verseref" : null,
		"versecomment" : "Jesus no way appeals that ninety-nine were self-righteous when he says they didn't need repentance but He was simply emphasizing the fact that God takes great joy in getting the lost sheep back. A repenting sinner is a great joy to the Lord. Other ninety-nine were always with Him. But Father's heart was not happy until he found that one lost sheep. ",
		"quitetimedate" : "2019-07-24"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 5,
		"verseid" : 7,
		"versetext" : "The impotent man answered him, Sir, I have no man, when the water is troubled, to put me into the pool: but while I am coming, another steppeth down before me.",
		"verseref" : null,
		"versecomment" : "We are also like this man with infirmity. We do know that we need to change and that we are suffering from sin a spiritual disease for very long. We go to  our own Bethesda to get healed. We try good deeds, probably to serve in the church and may other good works and we think that it will make us whole. But we find that there are others doing those things better than us and reaping the reward for it. We struggle to get rid of our spiritual disease which is much more deadly and fatal than physical disease. \r\n\r\nHere there is no proof that this Bethesda was from above or the angel was sent by God to stir the water. God would not do such horrible things to impotent people that from that great multitude only one person would be healed. God would not mock impotent people like this. His love and care is so much that leaving everyone except one in their state of infirmity is not possible. We have no reason to believe that this whole healing custom was from above. Such is all the remedies offered by this world. They are man made remedies and leaves many in their state of infirmity giving them false hope year after year and many unfortunately continue living in this false hope and finally die in this false hope.\r\n\r\nBut Jesus steps into the picture and this man is healed who was suffering since last 38 years. He is asking us today \"Wilt thou be made whole?\". Are we ready to tel Him that yes Lord I have tried everything year after year but for no avail.",
		"quitetimedate" : "2020-01-10"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 7,
		"versetext" : "If ye abide in me, and my words abide in you, ye shall ask what ye will, and it shall be done unto you.",
		"verseref" : null,
		"versecomment" : "The promise here is not just that whatever ye ask it will be done but there is a condition, \"if ye abide in me\" that is the condition. And the one who abides in the Lord never seems of his own. The one who abides in the Lord has his will fully surrendered to Him and hence he will not can not ask anything outside His will. And in that sense whatever he\/she asks God promises that He will do.",
		"quitetimedate" : "2020-04-19"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 7,
		"versetext" : "The Jews answered him, We have a law, and by our law he ought to die, because he made himself the Son of God.",
		"verseref" : null,
		"versecomment" : "What a contradiction here, just few verses ago they said their law does not allow them to put Him to death and now they are saying that their law requires that He should be put to death. What changed so much in such a short period of time!",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 61,
		"verseid" : 8,
		"versetext" : "So will I sing praise unto thy name for ever, that I may daily perform my vows.",
		"verseref" : null,
		"versecomment" : "David daily performed his vows. Our problem is we are occasionally meet God and most of the times only to have Him pull us out of all troubles and no more. We must be consistent in our walk with God. Reading and meditating God's words, in our prayer life and carrying out all the actions he shows us on daily basis. ",
		"quitetimedate" : "2018-10-19"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 62,
		"verseid" : 8,
		"versetext" : "Trust in him at all times; ye people, pour out your heart before him: God is a refuge for us. Selah.",
		"verseref" : null,
		"versecomment" : "David calls out others to trust in Him at all times because he did and he experienced the vastness of His mercy and the solid security in Him. David calls out others to pour their heart before God. Pouring our heart before anyone except God would be fatal and utterly disappointing and would make us vulnerable to dangers but pouring our heart before God is extremely relieving. He does not talk behind our backs, He takes our restless heart, sinful heart, wounded heart and replaces it with the new heart. He brings great healing and eternal hope to us. ",
		"quitetimedate" : "2018-10-24"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 11,
		"verseid" : 8,
		"versetext" : "And many spread their garments in the way: and others cut down branches off the trees, and strawed them in the way.",
		"verseref" : null,
		"versecomment" : "One thing is sure that this was not the first time Jesus was entering into the city of Jerusalem. Why never in the past the city got into such tumult and in a spirit of celebration? What made them do the things they did to make Jesus entry into the city so glorious? We don't know much about that but we know one thing that they were all filled with such a joy that they shouted \"Hosanna\" at the top of their lungs. ",
		"quitetimedate" : "2018-11-19"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 146,
		"verseid" : 8,
		"versetext" : "The LORD openeth the eyes of the blind: the LORD raiseth them that are bowed down: the LORD loveth the righteous:",
		"verseref" : null,
		"versecomment" : "God of Jacob lifts them who are bowed down because of the oppressor. God has never failed to deliver righteous out of the hand of oppressor and from evil people.",
		"quitetimedate" : "2019-06-02"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 2,
		"verseid" : 8,
		"versetext" : "And he saith unto them, Draw out now, and bear unto the governor of the feast. And they bare it.",
		"verseref" : null,
		"versecomment" : "The pots were containers of the waters for guests to wash themselves before they come in. It wasn't meant to contain something to drink out from. The command of Jesus to fill it with water was okay to obey for the servants but command to draw out of it and serve the master of the event thinking that it is wine must have been very hard on the servants. But \"they bare it\". \r\n\r\nGod may ask us to something which may not seem very logical to us but if we obey it would be good for us. We must obey what God asks us to do as there is nothing but eternal blessing in obeying His voice. If the servants had not obeyed that even would have been disaster. Someone would have lost his job and host must have lot to be ashamed of. But an willing act of doing what He asked to do made that event incredibly great!",
		"quitetimedate" : "2019-12-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 3,
		"verseid" : 8,
		"versetext" : "The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit.",
		"verseref" : null,
		"versecomment" : "To the inquiry of Nicodemus, how a full-grown man can be born again, Jesus first clarified that a man needs to be born again by the water and the Spirit. That is by word and by Holy Spirit. But still, Nicodemus failed to understand the concept of being born again. Then Jesus responded to him by giving an example of wind which is so invisible and no once say this is the wind by pointing a finger, it is not a shape or form or a thing which can be seen but its presence and effects are clearly felt. In the same way, the experience of being born again is not something physical but it is purely spiritual and cannot be explained in fleshly terms. A presence of person who is born again can be clearly felt and is so effective.",
		"quitetimedate" : "2019-12-23"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 8,
		"versetext" : "Herein is my Father glorified, that ye bear much fruit; so shall ye be my disciples.",
		"verseref" : null,
		"versecomment" : "If we are fruit bearing it would never be for our own glory but it will always will be for His glory. And also for us to qualify as His disciples we must be fruit bearing.",
		"quitetimedate" : "2020-04-19"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 11,
		"verseid" : 9,
		"versetext" : "And they that went before, and they that followed, cried, saying, Hosanna; Blessed is he that cometh in the name of the Lord:",
		"verseref" : null,
		"versecomment" : "How did they know that He was coming in the name of the Lord? Who made all this arrangement to make people say the things they said? But one thing we know that they were all sincere and quite genuine in this very unusual way of worship and honour they offered to Jesus on that day. ",
		"quitetimedate" : "2018-11-19"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 13,
		"verseid" : 9,
		"versetext" : "But take heed to yourselves: for they shall deliver you up to councils; and in the synagogues ye shall be beaten: and ye shall be brought before rulers and kings for my sake, for a testimony against them.",
		"verseref" : null,
		"versecomment" : "Jesus was talking about the times of persecution His disciples would face. Was Jesus trying to discourage them? Of course not, He was telling them the truth without any coverups or sugar coating. Jesus told them the truth what they will endure for the sake of His name.\r\n\r\nOur God is a God of love, God of compassion but He is God of the truth as well. He does not give any false promises and does not give any false impression to His followers that they will have all rosy path to walk on. He indeed tells us that walking in His ways has cost attached to it. Being rejected, persecuted and even killed is the undeniable part of our Christian walk. Anyone trying to explain contrary to that is trying to make Jesus a liar.",
		"quitetimedate" : "2018-12-05"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 77,
		"verseid" : 9,
		"versetext" : "Hath God forgotten to be gracious? hath he in anger shut up his tender mercies? Selah.",
		"verseref" : null,
		"versecomment" : "This man has so many questions about God. Seems like he has waited too long and there seems to be the absence of God as he perceives. He thinks God has forgotten him, God is so angry at him! He seems to be struggling to find the answer of all he is going through.",
		"quitetimedate" : "2018-12-22"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 146,
		"verseid" : 9,
		"versetext" : "The LORD preserveth the strangers; he relieveth the fatherless and widow: but the way of the wicked he turneth upside down.",
		"verseref" : null,
		"versecomment" : "He preserveth the strangers. This is a great relief for those like me who are strange and the foreigners in the land. His promises are unfailing and unchangeable.",
		"quitetimedate" : "2019-06-02"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 1,
		"verseid" : 9,
		"versetext" : "That was the true Light, which lighteth every man that cometh into the world.",
		"verseref" : null,
		"versecomment" : "Our savior Jesus Christ is the only light and no else beside Him. And it lighteth \"everyman\" so no one has an excuse that he\/she didn't receive the light. Rejecting light is not equal to not seeing the light, rather it is rejecting after seeing it and that's where we will be judged. We will not be judged for what we didn't know but we surely will be judged for what we knew and didn't respect.",
		"quitetimedate" : "2019-12-12"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 9,
		"versetext" : "As the Father hath loved me, so have I loved you: continue ye in my love.",
		"verseref" : null,
		"versecomment" : "The source of love is our Father in heaven. All other sources run dry very quickly. These days devil has succeeded to lure people to believe that the source of love is the media, all emotional stories on the screen are not true love. The true love is from the Father who gave His only begotten son to die on the cross for our sins and it's the love of the Son who offered Himself willingly to die on the cross on our behalf. And He is asking us to continue in His love. The moment that love chord is broken we will be devastated.",
		"quitetimedate" : "2020-04-22"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 10,
		"versetext" : "And he said unto them, Behold, when ye are entered into the city, there shall a man meet you, bearing a pitcher of water; follow him into the house where he entereth in.",
		"verseref" : null,
		"versecomment" : "This is another incident where the name of the person whose house is being used it not mentioned. Such a grand event, the last supper and the owner of the house where it took place is never mentioned. We must be ready to do this kind of service where we do not look in the front but God who watches over everything does recognize our service for His glory. We must get rid of even the smallest intention of being seen by people. ",
		"quitetimedate" : "2019-11-14"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 3,
		"verseid" : 10,
		"versetext" : "Jesus answered and said unto him, Art thou a master of Israel, and knowest not these things?",
		"verseref" : null,
		"versecomment" : "Yet one more inquiry of Nicodemus where Jesus had to challenge his knowledge of being a Pharisee. How is it possible that being so near to scripture and all that prophets spoke not understood by a master of Israel! Jesus showed Nicodemus his real blindness. It is possible that we may have memorized entire scripture and not understood it the way God wants us to understand it.",
		"quitetimedate" : "2019-12-23"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 5,
		"verseid" : 10,
		"versetext" : "The Jews therefore said unto him that was cured, It is the sabbath day: it is not lawful for thee to carry thy bed.",
		"verseref" : null,
		"versecomment" : "Jews were lost in the legalities and did not care about the deliverance. Being a slave of the law without understanding the law or understanding God's heart behind it can be fatal for spiritual life, such a keeping of law cannot produce a better follower of Christ, on contrary, it may end up producing an enemy fo, God. ",
		"quitetimedate" : "2020-01-13"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 12,
		"verseid" : 10,
		"versetext" : "But the chief priests consulted that they might put Lazarus also to death;",
		"verseref" : null,
		"versecomment" : "Pharisees became so blind in their wickedness that they sought to kill Lazarus as well and the only reason was that because of Lazarus walking around risen from the dead many Jews had believed in Jesus. What was Jesus' fault here? Which law did He break? None! But His presence became a threat for the these Pharisees who were so much carried away by their own wicked heart. They wanted all honor and glory as a spiritual leader and they saw Jesus as a threat to their glory!",
		"quitetimedate" : "2020-03-20"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 10,
		"versetext" : "If ye keep my commandments, ye shall abide in my love; even as I have kept my Father's commandments, and abide in his love.",
		"verseref" : null,
		"versecomment" : "Jesus asked to continue in His love and now here He showed how we can continue in His love. By keeping His commandments. Not in a legalistic terms but from the heart. If we keep His commandments we will be able to remain in His love.",
		"quitetimedate" : "2020-04-22"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 3,
		"verseid" : 11,
		"versetext" : "Verily, verily, I say unto thee, We speak that we do know, and testify that we have seen; and ye receive not our witness.",
		"verseref" : null,
		"versecomment" : "Here is the great secret of how to become a witness for God. We must speak the things that we do know and testify that we have seen. We cannot become a witness unless we have experienced the power of God ourselves. We cant become witnesses unless the real work has happened in our hearts first. We cannot show Christ unless Christ is within us. We must wait before God on our knees to receive from Him so that we can give to others or else all our labor we think we are doing for the Lord will be in vain producing nothing.\r\n\r\nIt may be possible that our witness may be rejected but rejection will never take away what we have received from the Lord.",
		"quitetimedate" : "2019-12-25"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 11,
		"versetext" : "These things have I spoken unto you, that my joy might remain in you, and that your joy might be full.",
		"verseref" : null,
		"versecomment" : "God's words always brings joy. It brings boredom only to those whose heart is not set in His words. Only in Him our joy can be fulfilled. Men have tried so many other ways thru ages to bring joy and happiness, they advertise all the time how much joy and piece you can have if you get what this world has to offer and everything has failed. People are still broken, they have wealth and health and power and influence and still they don't have joy because they believed lies of devil and traded true joy with temporal one. But we can be sure that in Him our joy is fulfilled and no where else.",
		"quitetimedate" : "2020-04-22"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 18,
		"verseid" : 11,
		"versetext" : "Then said Jesus unto Peter, Put up thy sword into the sheath: the cup which my Father hath given me, shall I not drink it?",
		"verseref" : null,
		"versecomment" : "Jesus did not accept the defense in His favor. He was determined to fulfill Father's will. He was not shaken by the great sympathy shown by one of his very beloved disciple. Jesus was ready to drink the cup. There are times the rescue may seem like a blessing but we must know and should have discernment from above whether that rescue is going to keep us in God's Will or throw us out of God's Will.",
		"quitetimedate" : "2020-05-12"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 11,
		"versetext" : "Jesus answered, Thou couldest have no power at all against me, except it were given thee from above: therefore he that delivered me unto thee hath the greater sin.",
		"verseref" : null,
		"versecomment" : "This is a great truth that all powers are given from above and so no one can boast that he got powers by his own. People can throw dices but God decides the outcome. \r\n\r\nAlso when we suffer from the authorities we must not murmur or grudge but rather submit to the will of one who would judge the way authorities are exercised.",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 12,
		"verseid" : 12,
		"versetext" : "And they sought to lay hold on him, but feared the people: for they knew that he had spoken the parable against them: and they left him, and went their way.",
		"verseref" : null,
		"versecomment" : "In my view, if I knew that Jesus was addressing me exposing me my evil heart to me I would repent and avail the forgiveness from Him. But this spiritual blind leaders had blinded themselves so much in their sinfulness that even after they realized that Jesus was referring to them and exposing their evil heart to them they even sought more evil instead of repenting. ",
		"quitetimedate" : "2018-11-28"
	},
	{
		"bookid" : 19,
		"bookname" : "Psalms",
		"chapterid" : 77,
		"verseid" : 12,
		"versetext" : "I will meditate also of all thy work, and talk of thy doings.",
		"verseref" : null,
		"versecomment" : "V10-12 seems to be answer he has found! He now understands that it was his infirmity that he couldn't see God's working but then he decides to remember all the years he has seen the mighty hand of the God almighty. When he remembers God's mighty hand and His marvelous works He is relieved. He seems to be at rest now that God is not sitting idle but even in midst of the apparent silence God is at work without any doubt.",
		"quitetimedate" : "2018-12-22"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 12,
		"versetext" : "And it came to pass, when he was in a certain city, behold a man full of leprosy: who seeing Jesus fell on his face, and besought him, saying, Lord, if thou wilt, thou canst make me clean.",
		"verseref" : null,
		"versecomment" : "\"Lord, if thou wilt\" was not a tone of lack of faith but rather it was the tone of utter submission to the Lordship of Jesus. It was the example of totally surrendered will. He knew that Jesus can make him clean and he did desire to be clean. ",
		"quitetimedate" : "2019-03-10"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 12,
		"versetext" : "Those by the way side are they that hear; then cometh the devil, and taketh away the word out of their hearts, lest they should believe and be saved.",
		"verseref" : null,
		"versecomment" : "Words heard but not meditated and pondered will be taken away by the devil for sure. Each type of land here Jesus has compared with the heart of the listener. What do we do with God's word? If are not disciplined to chew on it and hid it in our heart as David used to do then we are living at the risk of living in spiritual starvation. Careless towards Gods word has cost too much in my own life and in the lives of many. A mediocre Christian life is the product of being careless toward God's words.",
		"quitetimedate" : "2019-04-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 12,
		"versetext" : "Then said he also to him that bade him, When thou makest a dinner or a supper, call not thy friends, nor thy brethren, neither thy kinsmen, nor thy rich neighbours; lest they also bid thee again, and a recompence be made thee.",
		"verseref" : null,
		"versecomment" : "Jesus was not trying to teach avoid friends or family members here but He was teaching about the very idea of thinking about getting the return when doing something of others. Anything done to others with a thought of being recompensed is not really done to others in reality, it is a selfish act and at the center of that seemingly help is not the one who is being helped but rather you being recompensed or the thought of being repaid. We might feel great about ourselves when we help others like this but in God's measures it is nothing but a selfish act and God will not approve this as a help.",
		"quitetimedate" : "2019-07-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 12,
		"versetext" : "And the younger of them said to his father, Father, give me the portion of goods that falleth to me. And he divided unto them his living.",
		"verseref" : null,
		"versecomment" : "the one thing which is very surprising here is that Father actually doing what younger son asked him to do. Obviously, we can understand that the younger son is bit independent and his ask is way too much ahead of time. The property he can claim or should claim is after his father's death but here we see he is asking his portion while his father is still alive. And we do not see any arguments from father's side. The picture of God here is very interesting. God will not argue with us if we persist in our demands. He will allow the things to happen what we ask of Him. Only that we will have to go thru very through times, thru depression, thru irrecoverable loss, etc... But our God never forces His will upon us. ",
		"quitetimedate" : "2019-07-28"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 12,
		"versetext" : "He said therefore, A certain nobleman went into a far country to receive for himself a kingdom, and to return.",
		"verseref" : null,
		"versecomment" : "John 14:3 - And if I go and prepare a place for you, I will come back and take you to be with me that you also may be where I am.",
		"quitetimedate" : "2019-09-18"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 3,
		"verseid" : 12,
		"versetext" : "If I have told you earthly things, and ye believe not, how shall ye believe, if I tell you of heavenly things?",
		"verseref" : null,
		"versecomment" : "There is a degree in which God can reveal and show us things. If we cannot understand the simple things God is showing us from our day to day events and from nature which we can see with our eyes, God will not be able to show us the things which are in the Holy and spiritual realm. God wants us to learn from what we are experiencing in nature and in our day to day life. Once we go to that stage where we understand what is clearly visible in nature He will show us the things which is beyond the natural realm and much deeper things, heavenly things. ",
		"quitetimedate" : "2019-12-25"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 12,
		"versetext" : "This is my commandment, That ye love one another, as I have loved you.",
		"verseref" : null,
		"versecomment" : "To love one another is not a suggestion but a commandment, not something good to have but must to have.",
		"quitetimedate" : "2020-04-22"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 12,
		"versetext" : "And from thenceforth Pilate sought to release him: but the Jews cried out, saying, If thou let this man go, thou art not Caesar's friend: whosoever maketh himself a king speaketh against Caesar.",
		"verseref" : null,
		"versecomment" : "When these evil men could not prove anything worthy of death in Him they tactfully brought the pressure on Pilate. Jesus did not deny that He is a king and they got exactly what they needed, an accusation valid to make a case against Him that He was defying Roman reigns.",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 13,
		"versetext" : "And they brought young children to him, that he should touch them: and his disciples rebuked those that brought them.",
		"verseref" : null,
		"versecomment" : "\"They\" brought young children to Jesus that Jesus may touch them. Do we bring our children to the Lord that He may touch them. It cannot be physical now but surely it much better and easier now to bring our children to the Lord in prayer on our knees. Not doing so we are putting our children in danger. We give devil a free pass that he may devour our children. every parent has this great blessed responsibility to bring their children to the Lord no matter how grown they are. And God in his unfailing faithfulness will surely touch them and bless them.",
		"quitetimedate" : "2018-11-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 13,
		"versetext" : "And he put forth his hand, and touched him, saying, I will: be thou clean. And immediately the leprosy departed from him.",
		"verseref" : null,
		"versecomment" : "There are so many uncleanness in our lives but the touch of Jesus can make us clean immediately. His touch is all we need and it is surely available all the time. The question is are we ready and expectant to receive that touch or deep down in our heart we are enjoying our uncleanness?",
		"quitetimedate" : "2019-03-11"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 13,
		"versetext" : "And when the Lord saw her, he had compassion on her, and said unto her, Weep not.",
		"verseref" : null,
		"versecomment" : "Let us not forget that the God we serve is full of compassion. Let not devil believe us otherwise. When Jesus saw this woman who was a widow and also that she had lost her son as well, He had compassion on her. She received mercy even without asking for it! As a follower of Christ, there are so many times in our lives where God has done His work without we even asking or praying. His care and love are beyond our comprehension. ",
		"quitetimedate" : "2019-04-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 13,
		"versetext" : "They on the rock are they, which, when they hear, receive the word with joy; and these have no root, which for a while believe, and in time of temptation fall away.",
		"verseref" : null,
		"versecomment" : "This group accepts the words but again there is no root. This is the group who thinks that they are the center of God's words and not the God so when troubled times comes they reject Gods words because they think that it didn't work for them. This group receives the word but do not understand that God is sovereign in all His doings. They fail to understand that troubled times are not God's way to harass His people but rather to cultivate them and prepare them for the greater and divine purpose.",
		"quitetimedate" : "2019-04-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 10,
		"verseid" : 13,
		"versetext" : "Woe unto thee, Chorazin! woe unto thee, Bethsaida! for if the mighty works had been done in Tyre and Sidon, which have been done in you, they had a great while ago repented, sitting in sackcloth and ashes.",
		"verseref" : null,
		"versecomment" : "Jesus laments over the city of Chorazin, the mighty and great works were done in the city but they did not honor God or obviously did not turn from their sins. When God works in our lives there must be an affirmative response from our side in repentance and turning away from our sins. Chorazin was a Jewish city and had very much access to the teaching of the law as well as frequent teaching from Jesus. But they could not understand the value of God;'s working in them and they did not turn to God. Jesus sighed over that city and also mentioned that on the day of judgment the trouble of that city would be worse than the Tyre & Sidon. \r\nWe must not neglect God's working in our lives. We must come back to Him in repentance and also with the heart filled with thanksgiving. With the heart turned away from sins. As God enlarges His mercy day by day, neglecting of the same enlarges His judgment equally. We will be asked in the proportion we are given.",
		"quitetimedate" : "2019-05-13"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 13,
		"versetext" : "But when thou makest a feast, call the poor, the maimed, the lame, the blind:",
		"verseref" : null,
		"versecomment" : "when we help those who will not be able to repay us back, that would make us real generous in the eyes of the Lord. Because there is really the giving here, a sacrificial giving. Sacrificial giving does cost. Any giving which has not cost you is not a giving at all. We should be able to help and give to those who we know will never be able to repay and that would be the real giving in the eyes of the Lord.",
		"quitetimedate" : "2019-07-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 13,
		"versetext" : "And not many days after the younger son gathered all together, and took his journey into a far country, and there wasted his substance with riotous living.",
		"verseref" : null,
		"versecomment" : "The things done in our won wisdom does not go too far. The resources spent on worldly manner vanishes faster than we can think. We must let God take hold of all of our resources or it will be spent on the things which will never satisfy us and in the end, we will have great regret. Doing things in our own way will take us far from God. The only way we can do things in our own way is by going far away from God. Being close to God we would never lose our resources because He gives us heavenly wisdom to spend our resources in a very fruitful way. Riotous living is impossible when we are close to God. Sinful living is impossible when we are close to God. It requires to go to a far country where we have no word of God or voice of God that we can hear. ",
		"quitetimedate" : "2019-07-28"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 13,
		"versetext" : "And he called his ten servants, and delivered them ten pounds, and said unto them, Occupy till I come.",
		"verseref" : null,
		"versecomment" : "Mark 16:25 And He said to them, Go into all the world and preach the gospel to every creature.",
		"quitetimedate" : "2019-09-18"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 13,
		"versetext" : "And it shall turn to you for a testimony.",
		"verseref" : null,
		"versecomment" : "What are the things in our lives which can turn into a testimony? According to Jesus going through persecution could be a testimony.",
		"quitetimedate" : "2019-10-19"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 13,
		"versetext" : "Greater love hath no man than this, that a man lay down his life for his friends.",
		"verseref" : null,
		"versecomment" : "Jesus here is asking to go to the level where we may have to lay down our life for others. His bar of what it is to follow Him are always beyond the understanding or acceptance of a hypocrite who just wants others to know how godly he is but would not be ready even to spare few dollars for someone unless he sees some return favor. As a follower of Christ we are supposed to be ready to be vulnerable for others even to the point where we may be used despitefully, we are still supposed to give and help. \r\n\r\nChristian Life is not for the crafty people who under the guise of being prudent and wise take advantage of others generosity but it for those who make themselves vulnerable enough to be used despitefully by others and to the point where they may lose their very life for others. But surely their reward in heaven will be great! ",
		"quitetimedate" : "2020-04-22"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 14,
		"versetext" : "And when he came to his disciples, he saw a great multitude about them, and the scribes questioning with them.",
		"verseref" : null,
		"versecomment" : "Looking at the situation it is clear that the disciples weren't with Jesus. They were out in the street and as far people knew them as the followers of Christ crowd had expectation from them. As a follower of Christ people in the public square will have expectations from us and they will come to question us and make us accountable for our faith and they are not doing anything wrong in that. ",
		"quitetimedate" : "2018-10-26"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 14,
		"versetext" : "But when Jesus saw it, he was much displeased, and said unto them, Suffer the little children to come unto me, and forbid them not: for of such is the kingdom of God.",
		"verseref" : null,
		"versecomment" : "May be because ignorance or annoyance disciples were not happy people bringing their children to Jesus. What a sad picture that many times our spiritual leaders are the ones who causes little ones to come to Christ. How much careful we must be as parents or elders that we may not become the reason for little children to stay away from the Lord. Jesus loves children come to Him and those are the precious souls He created in first place and so how He could but love them!",
		"quitetimedate" : "2018-11-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 14,
		"versetext" : "And he charged him to tell no man: but go, and shew thyself to the priest, and offer for thy cleansing, according as Moses commanded, for a testimony unto them.",
		"verseref" : null,
		"versecomment" : "Jesus wanted this healed leper to show himself to the priest so according to the Mosaic law priest can make all the checks on him to declare him clean. Work of God is always in accordance with the laws He has set. All His works are verifiable and no man can ever complain against it.",
		"quitetimedate" : "2019-03-11"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 14,
		"versetext" : "And he came and touched the bier: and they that bare him stood still. And he said, Young man, I say unto thee, Arise.",
		"verseref" : null,
		"versecomment" : "Jesus touched the bier. We also need this touch. His touch makes history. Jesus spoke to a dead person. What we believe to be death is different for the God almighty. He who created everything out of nothing and the one who is the author of life has power over the death as well. And we live in this glorious hope that He has given us eternal life and even this body dies we will live forever in His presence. Deadman heard the voice of Jesus. We might feel like we are a dead man but let us know and understand and believe this fact that He has the authority over death as well! ",
		"quitetimedate" : "2019-04-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 14,
		"versetext" : "And that which fell among thorns are they, which, when they have heard, go forth, and are choked with cares and riches and pleasures of this life, and bring no fruit to perfection.",
		"verseref" : null,
		"versecomment" : "This group receives the word but it is not their priority. Their life is in pleasure and riches of this world. They are so much preoccupied with their earthly state and they end up in fruitless life fro God. An earthly mind is enmity with God. We must not trade God's words for any earthly riches or comfort ever.",
		"quitetimedate" : "2019-04-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 14,
		"versetext" : "And thou shalt be blessed; for they cannot recompense thee: for thou shalt be recompensed at the resurrection of the just.",
		"verseref" : null,
		"versecomment" : "To be called by God as blessed comes only by giving to them who would never be able to repay. Our God Himself is like that, He has given to us things which we will never be able to repay and we must follow His example in full.",
		"quitetimedate" : "2019-07-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 14,
		"versetext" : "And when he had spent all, there arose a mighty famine in that land; and he began to be in want.",
		"verseref" : null,
		"versecomment" : "Devil is extremely schemeful. He will wait till we are spent way too far. He will throw us into the famine when we have nothing to save us from. He knows how to kill and destroy. He keeps us in high spirit all the time while we are severely hurting ourselves thinking that we are having great fun. He knows that day is coming where we will have nothing and we will starve to death. The devil always keeps us in a false assumption that we are on top of the world until that moment comes where we realize that we are nowhere and we are about to die. Devil is so skillful in betraying people. He cannot do any better than that. He is betrayer from the beginning and so he will be till God destroys him in the lake of fire. ",
		"quitetimedate" : "2019-07-28"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 14,
		"versetext" : "And the Pharisees also, who were covetous, heard all these things: and they derided him.",
		"verseref" : "2 Timothy 3:2",
		"versecomment" : "The lovers of money cannot handle the message of Jesus seriously when He said you cannot serve two masters, God and money. Money can really become our master and rightly so with the worldly people whose whole life and all its values revolve around the money. Money is their goal, their joy, their satisfaction, and their strength. Pharisees mocked Jesus for His teaching about money. May God save us and deliver us from the love of money. ",
		"quitetimedate" : "2019-08-02"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 20,
		"verseid" : 14,
		"versetext" : "But when the husbandmen saw him, they reasoned among themselves, saying, This is the heir: come, let us kill him, that the inheritance may be ours.",
		"verseref" : null,
		"versecomment" : "It seems that the husbandmen or the keepers of the vineyard are driven by the gain. They must have agreed to terms of the owner when they accepted the job of keeping the vineyard but now they are consumed by their greed. Not only they refused to give an account of what they were doing but they beat up those who asked for the account. They showed no honesty toward the job they were given. The owner in His power would have removed these husbandmen in a moment but instead, He waited and gave them the chance to correct themselves. But they were already consumed in their greed.\r\n\r\nTheir greed reached to the height that they disregarded even the son of the owner an heir. They conspired and killed the son as well thinking that they have conquered. They thought that they have got what they planned.",
		"quitetimedate" : "2019-10-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 5,
		"verseid" : 14,
		"versetext" : "Afterward Jesus findeth him in the temple, and said unto him, Behold, thou art made whole: sin no more, lest a worse thing come unto thee.",
		"verseref" : null,
		"versecomment" : "This is a great warning for every follower of Christ and personally to me as well. Devil will not rest pursuing a child of God, throwing all kinds of temptations on his\/her way. And the devil knows from the experience which temptation will work the best. But we should know with the deepest conviction of our heart that our God is mighty and faithful to save us from any temptation. We must not go back to the sin from which He has cleansed us or the warning is so clear and loud. It is not just Jesus trying to instill fear in the hearts of this man. Jesus is saying this because it is surely a possibility and He knows it. ",
		"quitetimedate" : "2020-01-13"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 14,
		"versetext" : "Ye are my friends, if ye do whatsoever I command you.",
		"verseref" : null,
		"versecomment" : "We cannot pick and choose from what Jesus asks us to do. We must be ready to do whatever He commands us to do. We would never get the rank of being His friend by making choices but by surrendering all our choices at His feet.",
		"quitetimedate" : "2020-04-22"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 15,
		"versetext" : "And straightway all the people, when they beheld him, were greatly amazed, and running to him saluted him.",
		"verseref" : null,
		"versecomment" : "When people saw Jesus approaching they suddenly ran to Him. People were disappointed by disciples and they came to Jesus. It is apparent there was expectation and disciples had fallen short to that.",
		"quitetimedate" : "2018-10-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 15,
		"versetext" : "And he that was dead sat up, and began to speak. And he delivered him to his mother.",
		"verseref" : null,
		"versecomment" : "Deadman stood up and spoke. We don't know what He spoke but I believe he himself also knew what has just happened! This man knew clearly that Jesus brought him to life again. His mother got him back! Jesus handed him over to his mother. The life of this woman and this young man must have been changed forever. They must have remembered this every day until they died.",
		"quitetimedate" : "2019-04-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 15,
		"versetext" : "But that on the good ground are they, which in an honest and good heart, having heard the word, keep it, and bring forth fruit with patience.",
		"verseref" : null,
		"versecomment" : "This group is the one which is pleasing in the sight of God. This group receives the word and keeps it in the heart. Remember David, he says that he has hidden His words in his heart that he may not sin. Also, remember Mary, He kept the words in her heart. We need to treasure Gods words in our heart. There is no other way where we can be fruitful and pleasant in His eyes.",
		"quitetimedate" : "2019-04-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 15,
		"versetext" : "And he said unto them, Ye are they which justify yourselves before men; but God knoweth your hearts: for that which is highly esteemed among men is abomination in the sight of God.",
		"verseref" : "Psalms 51:6",
		"versecomment" : "The lovers of money may well justify themselves before men. They will say so many convincing things about their practice to gather money and do all sorts of things to pile up money and treasure on this earth. Some even use God's words, twisting it in their favor to justify their love and chase for money. But God knows their hearts. Remember, God cannot be fooled. we can fool the most intelligent man but never God. \r\n\r\nAlso, the highly esteemed among men due to their financial status sometimes just an abomination in the sight of God because He knows the hearts of men. God is not against the rich but He is surely against the ungodly and it is very likely that the riches makes one ungodly so deceitfully that one would refuse to even believe that he is ungodly. We never should attempt to be rich the way the world does. God will not approve it and we will ourselves with so many sorrows at the end.",
		"quitetimedate" : "2019-08-02"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 15,
		"versetext" : "And it came to pass, that when he was returned, having received the kingdom, then he commanded these servants to be called unto him, to whom he had given the money, that he might know how much every man had gained by trading.",
		"verseref" : null,
		"versecomment" : "Romans 14:12 So then each of us shall give an account of himself to God.\r\n2 Corinthians 5:10 For we must all appear before the judgment seat of Christ, that each one may receive the things done in the body, according to what he has done, whether good or bad.\r\nHebrews 9:27 And as it is appointed unto men once to die, but after this the judgment:\r\n",
		"quitetimedate" : "2019-09-18"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 15,
		"verseid" : 15,
		"versetext" : "Henceforth I call you not servants; for the servant knoweth not what his lord doeth: but I have called you friends; for all things that I have heard of my Father I have made known unto you.",
		"verseref" : null,
		"versecomment" : "Jesus calling us a friend is not small by any means. He makes everything known to us and it's great honor. God called Abraham a friend and He did not hide anything from him. Let us contemplate how honored we are when He calls us His friends.",
		"quitetimedate" : "2020-04-22"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 15,
		"versetext" : "But they cried out, Away with him, away with him, crucify him. Pilate saith unto them, Shall I crucify your King? The chief priests answered, We have no king but Caesar.",
		"verseref" : null,
		"versecomment" : "While Pilate a pagan authority was trying his best to rescue Jesus as he indeed knew in him that Jesus was falsely being accused, the spiritual authorities were so hung up on killing Him. Even though they were being oppressed by Romans on a daily basis and that is the reason they were seeking Messiah but now they affirmed that they are okay with Roman king. This the face of evil at full display. When so called outside godliness is exposed what actually is underneath the hood. The utter blood thirsty people.",
		"quitetimedate" : "2020-05-20"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 16,
		"versetext" : "And he asked the scribes, What question ye with them?",
		"verseref" : null,
		"versecomment" : "Jesus did not inquire of disciple about the conversation but he inquired of scribes or the people to know about what was going on. ",
		"quitetimedate" : "2018-10-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 4,
		"verseid" : 16,
		"versetext" : "And he came to Nazareth, where he had been brought up: and, as his custom was, he went into the synagogue on the sabbath day, and stood up for to read.",
		"verseref" : null,
		"versecomment" : "Jesus went to Synagogue as it was His custom to Go every sabbath day. Having a disciplined life is not being legalistic. We have started using these word jargon these days as it fits our convenience. When we are not disciplined in our prayer life and quiet time we easily make our escape saying that we are not legalistic. This is nothing but a devil's trap and we are willing to fall for it. \r\n\r\nIt seems that it was not only His custom to go to synagogue but also was to read from the scripture.",
		"quitetimedate" : "2019-02-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 16,
		"versetext" : "And he withdrew himself into the wilderness, and prayed.",
		"verseref" : null,
		"versecomment" : "It was Jesus custom to be alone with God. We lose so much not being alone with God. We become powerless and insensitive toward God and godly ways. We easily compromise and keep on drifting. It is dangerously harmful and at times fatal.",
		"quitetimedate" : "2019-03-14"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 16,
		"versetext" : "And there came a fear on all: and they glorified God, saying, That a great prophet is risen up among us; and, That God hath visited his people.",
		"verseref" : null,
		"versecomment" : "Why should fear fall on the people by seeing this very unusual miracle? Shouldn't they be filled with joy? When God works in such a miraculous and solid way there is no place for glory or praise for men. God deserves all glory and praise! People are filled with awe and fear when God works in such an unusual way. There is confirmation and a deep solace in the hearts of people that God has visited His people.",
		"quitetimedate" : "2019-04-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 16,
		"versetext" : "No man, when he hath lighted a candle, covereth it with a vessel, or putteth it under a bed; but setteth it on a candlestick, that they which enter in may see the light.",
		"verseref" : null,
		"versecomment" : "Is our candle lighted? If it is then it is impossible to cover it. No one can cover the fire, either it will burn the what covers it or cover will put it off. If we are ignited by the Holy Spirit and fire of the Holy Spirit is burning within us and people cannot see light in us then something ungodly is covering and overshadowing us. Such cover will either put us totally off and drag us away from the living God who wants us to have heavenly joy and abundant life. Or if this cover is brought by devil then it will be consumed by the fire of God burning within us. ",
		"quitetimedate" : "2019-04-15"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 16,
		"versetext" : "And he would fain have filled his belly with the husks that the swine did eat: and no man gave unto him.",
		"verseref" : null,
		"versecomment" : "This young man in his own wisdom has no other means but to look for some sustenance, so he goes to the citizen fo that far country. When we are away from God we are at the mercy of the evil people. We will be begging to the ungodly and worldly people. These people will give us a job which is obviously dirty. Worldly people have their fields and their swine and they will make us feed those swine. Swine are compared to the fools in God's words. Feeding swine is making ungodly fools fat. A job which we will hate every day and will make us vomit.\r\n\r\nThis young man reached to the point where his emptiness made him think that he can eat the same food what these swine are eating and indeed tried that. We will end up accepting, believing and practicing the things ungodly fools do thinking that that will satisfy our hunger and will save us from dying. All the people around him saw this young man almost dying and feeding himself on swine food but no one cared for him. This is what the devil does, he takes us on top of the hill and casts us down into a pit where others who are also in the pit would not care a bit about us. Remember, the devil does not come for any other reason but to kill and destroy.",
		"quitetimedate" : "2019-07-28"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 16,
		"versetext" : "The law and the prophets were until John: since that time the kingdom of God is preached, and every man presseth into it.",
		"verseref" : null,
		"versecomment" : "Jesus mentioned that the law and the prophets were until John. From John, it is a new covenant of preaching the kingdom of God and repentance. Jesus did not mean that Old testament is now obsolete. By no means. But He was suggesting that keeping of the law does not bring salvation rather it is the repentance of sins and trusting the lamb who taketh away the sins of this world.",
		"quitetimedate" : "2019-08-03"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 20,
		"verseid" : 16,
		"versetext" : "He shall come and destroy these husbandmen, and shall give the vineyard to others. And when they heard it, they said, God forbid.",
		"verseref" : null,
		"versecomment" : "These foolish husbandmen blinded by their greed believed that they have won the battle only to find in the end that they will be destroyed by the owner of the vineyard. What a great warning to us? What are we doing with all that God has entrusted with us? Are we giving good account to God or are we out of control with our own ideas and lust and greed?",
		"quitetimedate" : "2019-10-05"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 17,
		"versetext" : "And when he was gone forth into the way, there came one running, and kneeled to him, and asked him, Good Master, what shall I do that I may inherit eternal life?",
		"verseref" : null,
		"versecomment" : "This young man was looking for something which he knew his riches cannot give him. So he came to Jesus asking for that very thing - the eternal life. He came running and kneeling so he must have genuine desire to get what he was asking from Jesus. Also he must be sure that the only place he can go for eternal life is to go to Jesus.",
		"quitetimedate" : "2018-11-08"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 17,
		"versetext" : "For nothing is secret, that shall not be made manifest; neither any thing hid, that shall not be known and come abroad.",
		"verseref" : null,
		"versecomment" : "Such a message is comforting to those who have suffered because of the name of the Lord but is a dreadful judgment on them who have exercised their secret life filled with utter sinfulness. We all must know that there is nothing we can do to hide from God.",
		"quitetimedate" : "2019-04-15"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 17,
		"versetext" : "And it is easier for heaven and earth to pass, than one tittle of the law to fail.",
		"verseref" : null,
		"versecomment" : "Some have swung to the extreme saying Jesus made law obsolete by what he mentioned in verse 16. Many have fallen into that error and they have made God out of grace. But we must understand that Jesus immediately in verse 17 made a statement that no single title of the law will ever fail. Salvation is not by the law and rituals of the law are not required as Jesus fulfilled them all.",
		"quitetimedate" : "2019-08-03"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 17,
		"versetext" : "Verily I say unto you, Whosoever shall not receive the kingdom of God as a little child shall in no wise enter therein.",
		"verseref" : null,
		"versecomment" : "What does it mean to receive kingdom of God as a child? Children do not require big promises, with a very little offer they would trust. Children bind their all in the one they trust as if their entire life hangs on the one in whom they trust. Children are very dependent and reliant. Children are not crafty. Children are not greedy. ",
		"quitetimedate" : "2019-09-01"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 18,
		"versetext" : "And wheresoever he taketh him, he teareth him: and he foameth, and gnasheth with his teeth, and pineth away: and I spake to thy disciples that they should cast him out; and they could not.",
		"verseref" : null,
		"versecomment" : "Here is the sad account is given by people from the public square how their expectation from His disciples has failed. What grievous it would be to God's heart when we represent His name but fail to live by it. when we cannot demonstrate enough of His life in us. How grievous it would be His heart when we fail in the public square as a representative of Christ.",
		"quitetimedate" : "2018-10-26"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 18,
		"versetext" : "And Jesus said unto him, Why callest thou me good? there is none good but one, that is, God.",
		"verseref" : null,
		"versecomment" : "This young man was so sure in his heart about who Jesus was. He called Jesus with highest honor which is due only to God. ",
		"quitetimedate" : "2018-11-08"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 4,
		"verseid" : 18,
		"versetext" : "The Spirit of the Lord is upon me, because he hath anointed me to preach the gospel to the poor; he hath sent me to heal the brokenhearted, to preach deliverance to the captives, and recovering of sight to the blind, to set at liberty them that are bruised,",
		"verseref" : null,
		"versecomment" : "Jesus was very much aware that what He is going to read and tell to people is going to create some trouble but He did it anyway. He did not back off from what He was led to do by the Holy Spirit. Also what He was saying was about the great spiritual healing for the people who have seen nothing but spiritual devastation in their lives. ",
		"quitetimedate" : "2019-02-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 18,
		"versetext" : "Take heed therefore how ye hear: for whosoever hath, to him shall be given; and whosoever hath not, from him shall be taken even that which he seemeth to have.",
		"verseref" : null,
		"versecomment" : "Here is the other warning in red letters. Only hearing is not enough, we must take heed how we hear. If we do not hear carefully and properly then we will lose even that we have and it will be a big loss! But if we hear carefully God will add to what we have.",
		"quitetimedate" : "2019-04-15"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 18,
		"versetext" : "Whosoever putteth away his wife, and marrieth another, committeth adultery: and whosoever marrieth her that is put away from her husband committeth adultery.",
		"verseref" : null,
		"versecomment" : "Again Jesus confirmed that laws which are given for the godly living still stands. Anyone who put away his wife and marries another is committing adultery. Jesus even raised the bar further. Jesus addressed the issue of human heart here which does not like the covenantal binding. Being faithful in our earthly affairs is extremely important in our walk with God. God did not make us for no reason, He did not give us the law for no reason. He wants us to be holy as He is Holy and every word of the law is the stepping block for the same purpose. Only that in the new testament the sin is taken away once and for all by the living and Holy sacrifice of Jesus Christ. And so we are not required to have any rituals of animal sacrifice. But moral laws still stand and we should live by it.",
		"quitetimedate" : "2019-08-04"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 18,
		"versetext" : "And a certain ruler asked him, saying, Good Master, what shall I do to inherit eternal life?",
		"verseref" : null,
		"versecomment" : "Many people do have this grand and very important question. How can I be saved? How Can I have eternal life? As a human God has created us with the sense of infinity and however ungodly or unbelieving we maybe but there is something within us constantly face this question where will I go from here? What will it look like after I die? \r\n\r\nHere is the ruler who came to Christ with this very important question. It shows that he was seeking eternal life and he indeed wanted to obtain it.",
		"quitetimedate" : "2019-09-02"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 19,
		"versetext" : "He answereth him, and saith, O faithless generation, how long shall I be with you? how long shall I suffer you? bring him unto me.",
		"verseref" : null,
		"versecomment" : "These scolding words of Jesus was not for the people but rather they were for His disciples. Why would Jesus expect faith from the publicans? But He would surely expect faith from His disciples. Jesus rebuked His disciples publicly. When we fail God in the public square God would rebuke us and that is no way out of hatred but out of great expectation from being His followers. ",
		"quitetimedate" : "2018-10-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 4,
		"verseid" : 19,
		"versetext" : "To preach the acceptable year of the Lord.",
		"verseref" : null,
		"versecomment" : "He was talking about the blessed time they were at that particular moment that the God Himself was speaking to them and they were seeing Him with their own eyes. He was explaining His commission in a nutshell why He has come. Probably some of them or all from that congregation couldn't grasp it or didn't grasp it being influenced by the false teachers around them.\r\n\r\nHe read from Isaiah 61:1-2",
		"quitetimedate" : "2019-02-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 19,
		"versetext" : "And the whole multitude sought to touch him: for there went virtue out of him, and healed them all.",
		"verseref" : null,
		"versecomment" : "When whole the multitude wanted to touch Him He made Himself available and let the virtue go out and heal them all. Unlikely to what all the modern charlatans who call themselves healers and do not resemble the ministry of Jesus by any means.",
		"quitetimedate" : "2019-03-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 19,
		"versetext" : "And John calling unto him two of his disciples sent them to Jesus, saying, Art thou he that should come? or look we for another?",
		"verseref" : null,
		"versecomment" : "It is difficult to understand why John would ask such a question? John was a cousin brother of Jesus and he himself declared at the river Jordan about Jesus \"Behold the lamb of God\"! He said that He is the one who is the Messiah. What could possibly be the reason why John suddenly was not sure if he was sure about who Jesus is? Probably intense pain Herod had put on him which broke him mentally and physically where out of pain he spoke these things. Is it that he may have thought that Jesus would save him from the prison and all the torture he was going through and it never happened. Isn't it surprising that Jesus did not do the miracle of bringing John to get out of the hold of Herod!",
		"quitetimedate" : "2019-04-03"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 19,
		"versetext" : "And am no more worthy to be called thy son: make me as one of thy hired servants.",
		"verseref" : null,
		"versecomment" : "What a glorious thing happened to this young man. He came to his senses! God has spoken to us more than enough for us to come to our senses. We must reject the devil's promises of having a great fun-filled life. We must come to our senses when God's words are teaching us and speaking to us so clearly. This young man finally came to his senses and his heart was filled with repentance, true genuine repentance. He realized that in his father's house even the hired servant has more bread to satisfy them. Hired servants are not children. Hired servants have no inheritance, hired servants do not have the same status as the son. Those hired servants who may have been enjoying all the good things which they can get from their masters but still they never can have the privileges what a son can have. But this young man is now filled with great remorse and repentance. His heart has melted now realizing what a great loss he has incurred running around in his own wisdom. He realized that he has gone down lower than the hired servants and he is thinking that if my father considers me back as one of his hired servants than also it would be far better than the condition he is in right now. A condition so hopeless, a condition filled with stink, swine and selfish people all around, no one really caring for his need and his starvation.",
		"quitetimedate" : "2019-07-28"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 19,
		"versetext" : "There was a certain rich man, which was clothed in purple and fine linen, and fared sumptuously every day:",
		"verseref" : null,
		"versecomment" : "This parable seems to be a real story and not just an imaginary one. Jesus says \"certain rich man\" and also in the next verse \"certain beggar named Lazarus\". These are definitive words and hence there is enough indication that these two persons were real and not the imaginary one.",
		"quitetimedate" : "2019-08-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 19,
		"versetext" : "And Jesus said unto him, Why callest thou me good? none is good, save one, that is, God.",
		"verseref" : null,
		"versecomment" : "Jesus asked back, why he called Him \"good\". This also shows that this ruler exactly knew who Jesus was, that Jesus was God. This ruler indeed knew that the one who can answer this question is Jesus and no one else. He even knew the Godhood of Jesus. So, in theory, he had everything right about Jesus and that's why he came to Him with this question.",
		"quitetimedate" : "2019-09-02"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 5,
		"verseid" : 19,
		"versetext" : "Then answered Jesus and said unto them, Verily, verily, I say unto you, The Son can do nothing of himself, but what he seeth the Father do: for what things soever he doeth, these also doeth the Son likewise.",
		"verseref" : null,
		"versecomment" : "What a great surrender of Jesus being a Son of God from eternity, the God walking upon the earth, one with Father in every possible way but utterly submissive to His Father. Did nothing of Himself but what He saw His Father do. And He did not leave anything undone what He saw His Father doing. We must be such a follower of Christ. O Lord help me to be like you, to do only things which you want me to do and not leave anything undone which  you want me to do.",
		"quitetimedate" : "2020-01-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 19,
		"versetext" : "And Pilate wrote a title, and put it on the cross. And the writing was JESUS OF NAZARETH THE KING OF THE JEWS.",
		"verseref" : null,
		"versecomment" : "No one asked Pilate to put that note on the cross but just to make sure that he is seen as a friend of Caesar and also to please chief priest he put that label. The pressure of this world is powerful and getting swayed in the current is quite possible. ",
		"quitetimedate" : "2020-05-23"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 20,
		"versetext" : "And he answered and said unto him, Master, all these have I observed from my youth.",
		"verseref" : null,
		"versecomment" : "He had great life of keeping all commandments. So by now we can see that he had sincere desire, great desperation, conviction that he needs to go to Jesus and a very sincere life to claim that he kept all the commandments from his childhood. We can be very sincere in all aspects of our life. We may be genuinely seeking the Lord, we may be making sure everyday that we do the right thing. We may have great head knowledge that Jesus is the only one whom we can go to get eternal life.",
		"quitetimedate" : "2018-11-08"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 4,
		"verseid" : 20,
		"versetext" : "And he closed the book, and he gave it again to the minister, and sat down. And the eyes of all them that were in the synagogue were fastened on him.",
		"verseref" : null,
		"versecomment" : "Obviously what He read and what He said was uncommon for the congregation. They were all amazed and hence they had a look of anticipation. They wanted to hear more. Their look was an invitation for Jesus to speak more. Jesus had already returned to His seat but it seems that their fastened look was a clear indication that they wanted to hear more from Him or at least have Jesus make His case why He read what read and what He exactly meant by reading that scripture.",
		"quitetimedate" : "2019-02-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 20,
		"versetext" : "And he lifted up his eyes on his disciples, and said, Blessed be ye poor: for yours is the kingdom of God.",
		"verseref" : null,
		"versecomment" : "Lets, not the false teachers deceive us by any means promising us to be wealthy and healthy. The first blessedness Jesus ever spoke about was the blessedness of the poor. For such is the kingdom of God. Let the false teachers twist Gods words the way they want but we should not deflect from the pure meaning of Gods words.",
		"quitetimedate" : "2019-03-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 20,
		"versetext" : "He said unto them, But whom say ye that I am? Peter answering said, The Christ of God.",
		"verseref" : null,
		"versecomment" : "God is interested and concerned about how we see Him and perceive Him? For others, He may be just a good man or maybe a great prophet or a great teacher but who He is for us? For us is He our savior and our Lord? Do we see Him as Christ? ",
		"quitetimedate" : "2019-04-27"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 20,
		"versetext" : "And another said, I have married a wife, and therefore I cannot come.",
		"verseref" : null,
		"versecomment" : "Preoccupied people who considered their preoccupation more valuable than the supper invitation. In other words, they devalued the one who invited them to supper. There is a cost when we neglect and under prioritize the invitation from our Lord when invites us to His table. When we do not feed ourselves from His table we will just run around feeding ourselves on all kind of garbage food which devil has laid out under attractive food wrappers.\r\n\r\nWe must get out of our earthly business and honor the invitation of our heavenly Father to supper with Him. ",
		"quitetimedate" : "2019-07-16"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 15,
		"verseid" : 20,
		"versetext" : "And he arose, and came to his father. But when he was yet a great way off, his father saw him, and had compassion, and ran, and fell on his neck, and kissed him.",
		"verseref" : null,
		"versecomment" : "After he realized and remembered how much great trouble he has put himself in by living his father's house the next step he took was to arise and start walking back to his father. We must do the same. If we have fallen away in our foolishness, God's spirit is quickening us to realize how much grave trouble we have brought on ourselves. We must arise and start walking back to the Father. It is never late to return to Father. This young man left his job immediately when he remembered how much abundance he has in his father's home. He did not listen to anyone. Probably others may have advised him that you are already starving and it is not a good idea to leave this job now. They must have told him that hardly you could this one little job on which your survival hangs at this moment and why you would leave this job. They must have told him that you are not alone in this famine, there are so many like you so don't try to go now. But his eyes are now opened, he has found out all the lies he is being told, he has found out his own foolishness and now he is resolved to go back to his fathers home.\r\n\r\nAnd we also see here fathers heart constantly longing for his lost son. He must have waited there on a daily basis. Any glimpse of his son returning was this father's daily longing. And one day he found that there is a figure like his son walking toward home. He knew that it was his son. This father's longing heart filled with joy. Son was still a great way off since father saw him. He saw his son, he was there in his skin and bones. So unrecognizable, dark skin and stinking. Father's heart got filled with compassion, he could not contain it. Father ran toward his son, didn't care about anything. He didn't care about how fool he would look. He didn't care about his clean clothes. He didn't care about his status. He ran toward his son and fell on his neck. What could have been expected to be done from son we see now being done by his father. He almost fell on his neck and kissed him. This son was stinking from top to bottom but the father didn't care about it. He kissed his son. Father's heart is filled with joy which can not be described.\r\n\r\nSuch is our savior too. He didn't care about his heavenly status and glory. He ran toward us, he died for us on the cross. He gave Himself up so fully. What a great savior we have and a great Father we have. \r\n\r\nLord, I worship you as you have done this multiple times for me. I worship you O Lord for your incomprehensible love and forgiveness. You gave yourself up in full for me to redeem me and to save me. In your blood O Jesus, I pray that you cleanse me and wash me. Pardon me of all my sins and save from relying on my own wisdom. save me from all the entanglements fo the worldly joy which is so short-lived living my soul hungry and thirsty. Restore me by your side in your eternal mercy and fill me with the heavenly nourishment. In Jesus Amen.",
		"quitetimedate" : "2019-07-28"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 17,
		"verseid" : 20,
		"versetext" : "And when he was demanded of the Pharisees, when the kingdom of God should come, he answered them and said, The kingdom of God cometh not with observation:",
		"verseref" : null,
		"versecomment" : "Being the teachers of the law Pharisees could not get what the Kingdom of God is. Jesus quite often talked about it and Pharisees could not understand it. They thought it to be external something which they can observe and see. ",
		"quitetimedate" : "2019-08-19"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 6,
		"verseid" : 20,
		"versetext" : "But he saith unto them, It is I; be not afraid.",
		"verseref" : null,
		"versecomment" : "These words are so profound in our lives. When God tells us that \"It is I; be not afraid\" we surely have no reason to be afraid of anything. Assurance God gives never fails. We can rest in this amazing, heavenly promise \"be not afraid\". We may have the worst circumstances and we may have the experience of the valley of the shadow of death but we can trust His words with all our heart \"be not afraid\". What great promises we have in Him?",
		"quitetimedate" : "2020-01-24"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 20,
		"versetext" : "This title then read many of the Jews: for the place where Jesus was crucified was nigh to the city: and it was written in Hebrew, and Greek, and Latin.",
		"verseref" : null,
		"versecomment" : "Because the place was near to the city and probably close to the road many read this label. Some may have been filled with sorrow knowing that this very man had fed them, healed them and taught them. Some may have not paid any attention at all being so much preoccupied with their own business. Some may have participated in the vary act of leading Him to the cross. But there certainly was momentary triumph of the evil here. Pilate was relieved of the turmoil. Chief priests were relieved of the threat they were seeing in Jesus. Some others must have thought that if He was of no use calling Himself Messiah while He didn't do anything particularly to lead any army against Romans. ",
		"quitetimedate" : "2020-05-23"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 21,
		"versetext" : "And he asked his father, How long is it ago since this came unto him? And he said, Of a child.",
		"verseref" : null,
		"versecomment" : "Here is a father whose son from his childhood is demon possessed. He had come to disciples with utter desperation because he must have heard how disciples indeed had cast out demons and healed the sick. Seeing his son quite often almost at the brink of death. ",
		"quitetimedate" : "2018-10-26"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 21,
		"versetext" : "Then Jesus beholding him loved him, and said unto him, One thing thou lackest: go thy way, sell whatsoever thou hast, and give to the poor, and thou shalt have treasure in heaven: and come, take up the cross, and follow me.",
		"verseref" : null,
		"versecomment" : "Jesus really loved him why? because this man was sincere in his desire but having too much of self in him. Jesus knew that that self needs to taken out. Jesus knew that this man loved his riches so much and that was keeping him from truly come to the terms of God. The worldly riches had become a snare for him to live for God. So Jesus asked him to get rid of all his earthly possession.\r\n\r\nThis is what God does, He always removes the things which keeps us away from following Him with all our hearts. God loves us so much and so the things which keeps us tied away from Him, He wants us to put away. It may be relationship, wealth or even our love for knowledge and outward hard work which may not seem to be harmful to us. God knows what hinders us to live the life full of heavenly and divine joy and God wants to remove those things from our lives.",
		"quitetimedate" : "2018-11-08"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 15,
		"verseid" : 21,
		"versetext" : "And they compel one Simon a Cyrenian, who passed by, coming out of the country, the father of Alexander and Rufus, to bear his cross.",
		"verseref" : null,
		"versecomment" : "Probably Jesus was so weak that Roman soldiers may have thought that he would die on the way to his crucifixion. And so they compelled Simon to carry His cross. How blessed it was for Simon to carry His cross while his two sons Alexander and Rufus were watching it. An unsung hero!",
		"quitetimedate" : "2019-01-31"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 4,
		"verseid" : 21,
		"versetext" : "And he began to say unto them, This day is this scripture fulfilled in your ears.",
		"verseref" : null,
		"versecomment" : "And so Jesus boldly told them what He meant by reading that specific scripture. He declared indirectly that He was the Messiah. Jesus clearly declared that scripture is fulfilled today what Isaiah prophesied almost 750 years ago. ",
		"quitetimedate" : "2019-02-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 21,
		"versetext" : "Blessed are ye that hunger now: for ye shall be filled. Blessed are ye that weep now: for ye shall laugh.",
		"verseref" : null,
		"versecomment" : "There are some who say that Jesus was not talking about literal physical hunger or tears here. But let us not make the mistake, He was talking about literal hunger and tears. ",
		"quitetimedate" : "2019-03-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 21,
		"versetext" : "And in that same hour he cured many of their infirmities and plagues, and of evil spirits; and unto many that were blind he gave sight.",
		"verseref" : null,
		"versecomment" : "As an answer to the inquiry made by John's disciples, Jesus performed more miracles and then asked them to report to John! There are times when God does not give us direct answers to our questions. He points us to His works and that may include the works He has done in our lives in the past or in someone else's life in the past. And He wants us to evaluate the situation and trust who He is. ",
		"quitetimedate" : "2019-04-03"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 21,
		"versetext" : "And he answered and said unto them, My mother and my brethren are these which hear the word of God, and do it.",
		"verseref" : null,
		"versecomment" : "At first sight, it seems that Jesus answer is rude but carefully examining we can see what He meant. If Jesus was preaching and many people were listening to then what possibly could be the reason for His mother and brethren stand without? Why they were not part of the audience? They did know many years ago when He was 12 He told His mother and father that His Father's business was His priority! What were they trying to talk to Him? Even if it was to check on his well being still standing outside and waiting for Him to leave preaching and see them seems odd. \r\n\r\nIn that sense, Jesus said that His mother and brethren were those who listen to Him and do it. Let us remember the hidden warning Jesus gave here that He does not consider the one of His own if he\/she is reluctant to hear and do God's word. What a great warning! May God help us to understand and apply this in our lives.",
		"quitetimedate" : "2019-04-16"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 21,
		"versetext" : "So that servant came, and shewed his lord these things. Then the master of the house being angry said to his servant, Go out quickly into the streets and lanes of the city, and bring in hither the poor, and the maimed, and the halt, and the blind.",
		"verseref" : null,
		"versecomment" : "the God of Abraham, Isaac, and Jacob is the only God who loves all downtrodden and enjoys the company of the humbles. He is always open for poor, maimed, halt and blind in other words He honors and invites all those who are forgotten and despised.  Our Father loves the smallest and cares for them. Those who are insignificant in the eyes of the world are great heroes for Him. He invites them to supper and feeds them till they are satisfied.",
		"quitetimedate" : "2019-07-16"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 21,
		"versetext" : "And desiring to be fed with the crumbs which fell from the rich man's table: moreover the dogs came and licked his sores.",
		"verseref" : null,
		"versecomment" : "Condition of Lazarus explained here is graphic. He eas extremely poor and sick, filled with sores all over his body. He was so weak that he saw digs licking his sores and probably he couldn't do much about it. He didn't come over to the table of the rich man, rather he was brought to the table. This must have been going for a while by now. Surprisingly there is no mention that this rich man ever offered food to this beggar. The rich man was lost in his sumptuous lifestyle and he did not pay attention to the need of this poor man.\r\n\r\nQuite often worldly rich people ignore the poor and needy and at times they even snatch whatever poor has. Riches and power can make one blind to this level. The sin of Sodom and Gomorrah was this, to ignore the poor and needy. God's words so repeatedly talk about taking care of poor and needy and a follower of Christ would never ignore poor and needy.",
		"quitetimedate" : "2019-08-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 17,
		"verseid" : 21,
		"versetext" : "Neither shall they say, Lo here! or, lo there! for, behold, the kingdom of God is within you.",
		"verseref" : null,
		"versecomment" : "Jesus referred to the kingdom of as something internal, something which lives within us. The Kingdom of God is not like the earthly kingdom. The kingdom of God is something which lives in us. It must be visible in us, in our conduct, our conversations, in our day to day life. It is never to be sought out side. We must not be deceived by anybody telling us where the kingdom of God is. ",
		"quitetimedate" : "2019-08-19"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 21,
		"versetext" : "And he said, All these have I kept from my youth up.",
		"verseref" : null,
		"versecomment" : "Jesus intentionally reminded him all the commandments and the ruler knew then all and kept them all from his youth up or in other words, since he knew what commandments he must keep, he kept it without fail. We have here a man who every parent would desire to be their son, every wife would desire to their husband! A perfect man, in theory, keeping all commandments, and surely he was not lying otherwise Jesus would have told him on his face, no he indeed was the keeper of the law to its fullest.",
		"quitetimedate" : "2019-09-02"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 21,
		"versetext" : "Then said the chief priests of the Jews to Pilate, Write not, The King of the Jews; but that he said, I am King of the Jews.",
		"verseref" : null,
		"versecomment" : "When the heart is under the demonic influence bloodshed only propels for more bloodshed. The normal human concience becomes so foggy and blinded that pain fails to produce compassion. Rather it makes one more blood thirsty. Chief priest claiming to be the servants of God from outside but from inside filled with jealousy, hatred and envy didn't let him take his last shot of anger and revenge at Jesus. He wanted to amplify that He claimed and did say that He was the king. Somehow they were thinking they can that will take away their guilt of crucifying Him. They were trying to prove that He was crucified of His own doings and not of their false accusations.",
		"quitetimedate" : "2020-05-23"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 22,
		"versetext" : "And he was sad at that saying, and went away grieved: for he had great possessions.",
		"verseref" : null,
		"versecomment" : "This is the very very sad moment in entire Bible. A man who knew what he was lacking, he knew where to get it and when offered what he was looking for could not accept it for his love for the riches of this world. He was not ready to accept that his riches is a snare for him. He did not trust Jesus. He trusted his riches. He chose the destruction of his soul over the gift of eternal life. \r\n\r\nWhat a great sad story this is! Love for riches at the cost of permanent, eternal destruction. ",
		"quitetimedate" : "2018-11-08"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 22,
		"versetext" : "But when Jesus perceived their thoughts, he answering said unto them, What reason ye in your hearts?",
		"verseref" : null,
		"versecomment" : "Jesus is God and so he indeed is capable to perceive the thoughts of all. What a great comfort we have in Him! He knows our thoughts, all unspoken prayers, unspoken grief, He knows them all. At the same time, He indeed knows all kind of evils rising within our thoughts too! ",
		"quitetimedate" : "2019-03-14"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 22,
		"versetext" : "Blessed are ye, when men shall hate you, and when they shall separate you from their company, and shall reproach you, and cast out your name as evil, for the Son of man's sake.",
		"verseref" : null,
		"versecomment" : "Those who are ungodly will hate the followers of Christ. They would hate us to be in their company and they will reproach us and cast our names as evil, useless, retarded and what not! But we must not be worried about it or lose our heart over it as our Saviour has told us in advance that that will happen when we follow Him.\r\n\r\nWe should be rather worried when we get along quite well with worldly people.",
		"quitetimedate" : "2019-03-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 22,
		"versetext" : "Now it came to pass on a certain day, that he went into a ship with his disciples: and he said unto them, Let us go over unto the other side of the lake. And they launched forth.",
		"verseref" : null,
		"versecomment" : "When God tells us that He wants to go with us to the other side of the lake we must rest assured of His presence to go with us. We, however, should not dare to go to the other side in our own leadings. ",
		"quitetimedate" : "2019-04-17"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 22,
		"versetext" : "And he went through the cities and villages, teaching, and journeying toward Jerusalem.",
		"verseref" : null,
		"versecomment" : "Jesus went through cities and villages teaching and that is how our life also should be. Wherever God takes us through we must be a proclaimer of the Gospel. He journeyed toward Jerusalem where He was going to suffer the death of the cross and He was fully aware of it. Despite the end, we must continue to preach Gospel and the good news with the people we come across.",
		"quitetimedate" : "2019-07-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 22,
		"versetext" : "And the servant said, Lord, it is done as thou hast commanded, and yet there is room.",
		"verseref" : null,
		"versecomment" : "Yet there is room - meaning our heavenly Father always has room for all those who want to come in. He does not reject anyone who comes to Him humbly. He does not break the bruised reed. He exalts the poor and brings the lofty one down.",
		"quitetimedate" : "2019-07-16"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 22,
		"versetext" : "And it came to pass, that the beggar died, and was carried by the angels into Abraham's bosom: the rich man also died, and was buried;",
		"verseref" : null,
		"versecomment" : "This poor man died first and it was obvious that he would as he must have come to the point where his body fainted to the point that he may have not been able to even pick up the falling crumbs to feed himself. But his death brought a glorious change in his life. He was carried by angels to Abraham's bosom. This is beyond our understanding but Jesus said ti happened and Jesus was not playing words or making up some fancy stories. \r\n\r\nThe most neglected man in his time, a beggar, whose only hope of survival was the crumbs falling from the table of this rich man. But obviously, a godly man as angels received him in glory so gloriously. The rich man in his utter blindness never noticed that this beggar did not come any more to his table. But death is no respecter of man. The poor man died and the rich man also died. All his riches could not stop death, his money could not stop death, his best doctors could not stop death. We must know that death is far more real than we can think. It comes and no one is out of its grip. The rich man probably lived longer because he had the best food, the best medicine, best doctors, the best facilities but the reality is that he died. \r\n\r\nHe died and he was buried. Probably here is a great distinction between those who die in the Lord and those who in their sins. Those who die in the Lord are carried by angels in the presence of the living God. But those who die in their sins they are buried and fall into hell. ",
		"quitetimedate" : "2019-08-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 17,
		"verseid" : 22,
		"versetext" : "And he said unto the disciples, The days will come, when ye shall desire to see one of the days of the Son of man, and ye shall not see it.",
		"verseref" : null,
		"versecomment" : "What Jesus meant by \"the days of the Son of man\"? Jesus was referring to His own days on this earth where Truth was spoken unhindered and uncompromised, where the power of God was really seen in the Miracles people saw, the living gospel which they saw almost every day and touched Him, sup with Him and learned from Him. That pure ministry will be lost and there will be sigh rising up out of the one's heart to see that same pure ministry, selfless ministry, sacrificial ministry, a self-giving ministry! A ministry which did not trick anyone did not make any false promise and a ministry which laid out Himself all the way to death.",
		"quitetimedate" : "2019-08-22"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 22,
		"versetext" : "Now when Jesus heard these things, he said unto him, Yet lackest thou one thing: sell all that thou hast, and distribute unto the poor, and thou shalt have treasure in heaven: and come, follow me.",
		"verseref" : null,
		"versecomment" : "The one thing which was a hurdle for this young ruler to receive eternal life was his heart so much blended in his riches. Jesus who knew what is in men's heart knew that this man has his treasures on this earth. His heart was so much tugged into this world. How to get more and keep it safe was his utmost priority. So Jesus asked him just one thing and that is to get rid of all his riches and distribute it among the poor and needy. This ruler must have done everything to be done to the poor as per the law but hsi heart must have cringed every time he gave. \r\n\r\nSo Jesus asked him just one thing, give all that he has to the poor. And now his real heart was exposed. He could not let go of his treasures on this earth to gain heavenly treasure. How sad it is!\r\n\r\nWe have so many today who would fulfill the law so no one can find any fault in them but how sad it is that their heart is far far away from God. They keep the law to look good in the sight of men while God desires the truth in the inward parts. God wants us to have treasure in heaven. God wants us to understand that treasure in heaven is the only treasure what matters. \r\n\r\nWe must not misuse the parable of fruit multipliers to hide our love for earthly treasure. Be sure, God will expose our hearts before us and we cant hide from Him who looks at our heart.\r\n",
		"quitetimedate" : "2019-09-02"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 22,
		"versetext" : "Pilate answered, What I have written I have written.",
		"verseref" : null,
		"versecomment" : "The character of Pilate is interesting. He knew that the man He crucified is innocent, he even sought the ways to let him go free but not at the cost of his worldly honor and possessions. Here he seems to be fed up with priest outrightly trashing his suggestion to change the text.\r\n\r\nWhat a tragedy, the man who even washed his hands in this matter but to no avail he ended up doing exactly what he washed his hands off.",
		"quitetimedate" : "2020-05-23"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 23,
		"versetext" : "And blessed is he, whosoever shall not be offended in me.",
		"verseref" : null,
		"versecomment" : "It seems the inquiry of John was not something Jesus was happy about. He blessed those who do not doubt His deity or His Messianic work. We must not come under a load of the situation to the point where we may start doubting who He is. Now it may surely sound very difficult and God does understand all our limitations as a human being but God surely does not encourage that we may live behind the excuse of our limitations.",
		"quitetimedate" : "2019-04-03"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 23,
		"versetext" : "But as they sailed he fell asleep: and there came down a storm of wind on the lake; and they were filled with water, and were in jeopardy.",
		"verseref" : null,
		"versecomment" : "We must also know that lake or the ocean is filled with uncertainties, it may roar on us like mighty waves. It may baffle us and frighten us and we may even feel that God is so silent. All these may be the real possibilities. We may be filled with effects of the storm, we may be filled with water of this world which may produce fear and dread in us. We may feel that we are in jeopardy but above all, we must still remember that it is He who asked us to sail to the other side and no one else.\r\n\r\nWe must know that the presence of God does not always mean the absence of trouble and also that the presence of trouble does not always mean the absence of God.",
		"quitetimedate" : "2019-04-17"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 23,
		"versetext" : "And he said to them all, If any man will come after me, let him deny himself, and take up his cross daily, and follow me.",
		"verseref" : null,
		"versecomment" : "O God I have probably never understood the depth of these words. Help me to understand the depth of it. Help me to deny myself, all of me so you can be all of me and there no greater security and peace except you be my all in all.",
		"quitetimedate" : "2019-04-27"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 23,
		"versetext" : "And in hell he lift up his eyes, being in torments, and seeth Abraham afar off, and Lazarus in his bosom.",
		"verseref" : null,
		"versecomment" : "He was able to see from hell. He was being tormented. He was able to see Abraham and Lazarus both. This rich man must have boasted all his life how he is the descendant of Abraham but to no avail, he is now burning in the hell which is never going to end. His torment would be eternal with no hope of exit ever. Again let us keep in mind that Jesus was not playing with words or weaving some fancy stories to woo his audience. Jesus was God manifested in the human form and so what none could see what happened to these two men, he did see and he reported the same to his audience.\r\n\r\nWhat happens after death? Let us hear from the author of life and death Himself. A godly one is carried by angels ushered into the presence of the living God along with the saints who have gone before us. But ungodly fall into eternal torment and despair where the worm never dies and fir never quench.",
		"quitetimedate" : "2019-08-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 17,
		"verseid" : 23,
		"versetext" : "And they shall say to you, See here; or, see there: go not after them, nor follow them.",
		"verseref" : null,
		"versecomment" : "The days will come where they will make up the stories about the kingdom of God and they will present all kind of things in the name of the kingdom of God. But Jesus clearly warned His disciples not to go after them or to follow them.",
		"quitetimedate" : "2019-08-22"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 24,
		"versetext" : "But woe unto you that are rich! for ye have received your consolation.",
		"verseref" : null,
		"versecomment" : "Some say that Jesus calling poor blessed was not literal poor but that seems to be quite wrong. They say He referred poor here as poor in Spirit but then how about rich then? Was Jesus referring to rich as rich in Spirit? Why Jesus would make this contrast so clear by talking about the two very opposite ends of the spectrum and have a different meaning to it? Jesus was talking about literal poor and literal rich!",
		"quitetimedate" : "2019-03-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 24,
		"versetext" : "And they came to him, and awoke him, saying, Master, master, we perish. Then he arose, and rebuked the wind and the raging of the water: and they ceased, and there was a calm.",
		"verseref" : null,
		"versecomment" : "Disciples did the right thing that they reached out to Jesus and woke Him up. But they were so overtaken by fear that they already declared that they are perishing! We must know that reaching out to God for help and telling Him that we are perishing is a bit out of tune. Jesus indeed took charge of the situation and calmed the storm down. God upon our cry for help would never deny to help us. He indeed is ever present help in the time of trouble and we should never forget about it.",
		"quitetimedate" : "2019-04-17"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 24,
		"versetext" : "For whosoever will save his life shall lose it: but whosoever will lose his life for my sake, the same shall save it.",
		"verseref" : null,
		"versecomment" : "The thoughts and efforts of self-preservation are futile and foolish. It is not in man's hand to avoid all threats and dangers, no not even the mightest of the mighty has been successful to preserve himself. Desiring to save ourselves and that also in our own attempts would be so futile and we will wear out so soon in despair and disappointments. But when we have our life hid in Christ, death does not have any strongholds and there are no fears who can beset us or threaten us.  ",
		"quitetimedate" : "2019-04-27"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 24,
		"versetext" : "Strive to enter in at the strait gate: for many, I say unto you, will seek to enter in, and shall not be able.",
		"verseref" : null,
		"versecomment" : "We need to strive to enter in at the strait gate and not just wait for being zapped in. The teaching which says that salvation is free and a gift of God and hence works are not required is false. We do not work to impress God, rather we work because we are obliged and He now has made us co-workers in Christ. Those who cannot and will not be able to enter is not that God wanted them to remain outside but they were disobedient and did not trust God when He called them and gave them chances after chances before God shut the door. Just like as it happened in the days of Noah, God gave them enough warnings and they chose to laugh at it and ignore it. finally they did approach to the door but it was shut and cant be opened.",
		"quitetimedate" : "2019-07-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 16,
		"verseid" : 24,
		"versetext" : "And he cried and said, Father Abraham, have mercy on me, and send Lazarus, that he may dip the tip of his finger in water, and cool my tongue; for I am tormented in this flame.",
		"verseref" : null,
		"versecomment" : "The rich man cried, there was the time he never cried, he always ordered and things were done. But now the scene has changed for forever, he is constantly in agony and pain and crying out for help. He never needed mercy as he was so rich probably he had a lot of people at his mercy, even Lazarus was at his mercy. But now he is in the hell crying out for mercy. Those who are too prideful to receive mercy one day will cry out for mercy at no avail. What a loss!!!\r\n\r\nThis rich man in his time on earth never took care of Lazarus, while Lazarus was trying to feed on the crumbs falling from his table. He never paid any attention to his need. And now he was begging for just touch of a wet finger, not even a drop of water! He is in a severe physical torment and wishes that someone may just give him a touch of the water. O what a severeity! what a pain!",
		"quitetimedate" : "2019-08-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 7,
		"verseid" : 24,
		"versetext" : "Judge not according to the appearance, but judge righteous judgment.",
		"verseref" : null,
		"versecomment" : "This is a great commandment of Jesus to us. It is useful in our daily lives. We should never judge by outward appearance. Judgments made by outward appearance would be quick, faulty and fatal for us and also for the person who is being judged. But Jesus commands us to judge with righteous judgment. Now righteous judgment is not inherent for us. We must rely on Jesus for righteousness and hence we need to go to God before we pass the judgment. When we have God helping us to make righteous judgment, it may be slow but it will be very constructive and edifying for both parties.",
		"quitetimedate" : "2020-02-16"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 25,
		"versetext" : "It is easier for a camel to go through the eye of a needle, than for a rich man to enter into the kingdom of God.",
		"verseref" : null,
		"versecomment" : "Three times Jesus repeated the snare of riches which keep one from entering into the kingdom of God. \r\n\r\nO God, I surrender myself into your mighty hands. Lord uproot all the love of riches from my heart. Make it wholly thine O Lord in your mercy. Let not my heart pay attention to the wealth of this world. Let not my heart get ensnared into the riches of this world. O Lord, I want to be with you and guided by you under your loving, caring, eternally wise Lordship. Amen.",
		"quitetimedate" : "2018-11-08"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 25,
		"versetext" : "Woe unto you that are full! for ye shall hunger. Woe unto you that laugh now! for ye shall mourn and weep.",
		"verseref" : null,
		"versecomment" : "Same as poor and rich, Jesus was talking about literal hungry and full here. So once again we must reject the convenient interpretation of Gods words and be more sensitive and truthful about what actually it is saying irrespective of whether we like it or not.",
		"quitetimedate" : "2019-03-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 25,
		"versetext" : "And he said unto them, Where is your faith? And they being afraid wondered, saying one to another, What manner of man is this! for he commandeth even the winds and water, and they obey him.",
		"verseref" : null,
		"versecomment" : "What brought rebuke was Jesus noticing the lack of faith. If they saw Jesus raising a man from the dead why it would be so difficult for them to believe in Him for their safety. Our God deserves our faith in Him. He has proved His power in our lives so many times in the past and still if we lack faith in Him for our present trouble, we will invite rebuke from Him for sure. We must know who is with us. We must know who has asked us to go to other side. We must know and remember all the mighty works He has done in the past and we must know that He is the King of kings and God of Gods. We must know that He is caring Father and He cares for His children.",
		"quitetimedate" : "2019-04-17"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 25,
		"versetext" : "And there went great multitudes with him: and he turned, and said unto them,",
		"verseref" : null,
		"versecomment" : "Great multitude kept following Jesus and Jesus taught them and challenged them about their understanding of what t exactly means to follow Him. There were so many who followed Him but how many did know what would it cost them? Many of them knew only outward apparent benefits of following Him. They followed Him because of miracles, healing, and free food. But they were not sure what it would be to really follow Christ.",
		"quitetimedate" : "2019-07-21"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 26,
		"versetext" : "But what went ye out for to see? A prophet? Yea, I say unto you, and much more than a prophet.",
		"verseref" : null,
		"versecomment" : "Jesus repeated question to the audience was quite penetrating. What went ye out to see? Mostly all people knew John to be a prophet and they honored him a lot to the point where Pharisees and Sadducees were afraid to assume anything about John. So Jesus was asking people for what reason they went out to the wilderness to listen to John. If they heard John so much then why can't they understand who He was?\r\n\r\nMany times in our lives we surround ourselves with all Christian activities and people and still we are not changed! May God save us from such errors.",
		"quitetimedate" : "2019-04-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 14,
		"verseid" : 26,
		"versetext" : "If any man come to me, and hate not his father, and mother, and wife, and children, and brethren, and sisters, yea, and his own life also, he cannot be my disciple.",
		"verseref" : null,
		"versecomment" : "Jesus clearly taught that following Him often means to get in troubles with others. At times it may be our own family members whom we would not really wish to get in trouble with. Jesus did clarify that there cannot be competing priorities when it comes to following Him. We cannot love our families more than we love Jesus and that no way means we have to hate any of our family members but if our family members are worldly than we cannot walk with them in their ways, we will have to make serious choice to follow Christ and that will require to choose different path than some of our closes family members. Jesus even said that we would need to count our own life also secondary when it comes to following Him. And so we can understand now how high is the bar set for following Him. ",
		"quitetimedate" : "2019-07-21"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 26,
		"versetext" : "And they that heard it said, Who then can be saved?",
		"verseref" : null,
		"versecomment" : "Our God is the Holy God and when He lays out His standard of righteousness before us we as a human are baffled with the same question as these people had. Who then can be saved? How a fallen human being can ever be saved? Very real intriguing question. How we can be saved? Contemplating this question we all should do.",
		"quitetimedate" : "2019-09-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 7,
		"verseid" : 26,
		"versetext" : "But, lo, he speaketh boldly, and they say nothing unto him. Do the rulers know indeed that this is the very Christ?",
		"verseref" : null,
		"versecomment" : "What a great testimony from the hearers of Jesus! \"He speaketh boldly\". Jesus never spoke the things with half meaning or half-truths. Ha taught that our speaking should be plain, yes to yes and no to no and anything above that is from the devil. We must never speak giving a different impression then what our intention. Some people have taken speaking with grace with a meaning that we can hide our emotions or sometimes even truths behind some sugary words. Now that is what Jesus has never taught neither He practiced it Himself. We must bold and still loving and gracious. ",
		"quitetimedate" : "2020-02-16"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 27,
		"versetext" : "And after these things he went forth, and saw a publican, named Levi, sitting at the receipt of custom: and he said unto him, Follow me.",
		"verseref" : null,
		"versecomment" : "It is so strange to understand how Jesus called Levi (Matthew). Was it arbitrary, we cannot think so. Here is the example of a glorious and divine combination of Sovereignty of God and human response. Matthew was called miraculously and he indeed followed Jesus. ",
		"quitetimedate" : "2019-03-14"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 27,
		"versetext" : "But I say unto you which hear, Love your enemies, do good to them which hate you,",
		"verseref" : null,
		"versecomment" : "For a child of God, revenge is never an option. The way Jesus stands out in His teaching is that He taught His followers to love their enemies. And do good to them who hate us! As difficult as it may sound but with the grace of God there are multitudes who have gone before us have lived such life and we also must lead such a life in complete obedience to the command of our Savior!",
		"quitetimedate" : "2019-03-23"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 27,
		"versetext" : "This is he, of whom it is written, Behold, I send my messenger before thy face, which shall prepare thy way before thee.",
		"verseref" : null,
		"versecomment" : "Jesus testifies about John that he was appointed messenger by God Almighty Himself to go before Him. ",
		"quitetimedate" : "2019-04-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 27,
		"versetext" : "And when he went forth to land, there met him out of the city a certain man, which had devils long time, and ware no clothes, neither abode in any house, but in the tombs.",
		"verseref" : null,
		"versecomment" : "Demonic presence in one's life leads to nudity and so many other abnormalities. OR we also can say in other words that people who practice nudity are indeed possessed by demons. Such people align themselves with the dead and all deadly things.",
		"quitetimedate" : "2019-04-18"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 27,
		"versetext" : "And it came to pass, as he spake these things, a certain woman of the company lifted up her voice, and said unto him, Blessed is the womb that bare thee, and the paps which thou hast sucked.",
		"verseref" : null,
		"versecomment" : "There is a starch contrast between worldly people and godly people the way they see someone blessed. For this woman, being a woman the greatest honor is to be a mother of such a great man. I believe that she was genuine in her feelings and her expression here. She could see the greatness of Jesus, of His teachings and the mighty works He was performing. She was perhaps filled with awe where she could not help but say these words.",
		"quitetimedate" : "2019-05-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 27,
		"versetext" : "And he said, The things which are impossible with men are possible with God.",
		"verseref" : null,
		"versecomment" : "We will never be able to comprehend fully the plan of salvation God has laid out for us. It is one thing to realize, acknowledge and trust that blood of Jesus Christ is able and more than sufficient to forgive us our sins and save us from the hell. But for us to understand with our finite human knowledge how it is possible for a sinner to be forgiven by righteous and Holy God. It is impossible for us to fully comprehend the saving grace of God, at least it is incomprehensible for me.\r\n\r\nBut thats where faith picks up. We must know for sure that what is impossible with men is effortlessly possible with God. My heart just bows down with utter humbleness thinking about the vastness of His grace which covers multitudes of my sins and gives me hope that He is faithful irrespective of myself being able to understand His saving grace.",
		"quitetimedate" : "2019-09-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 27,
		"versetext" : "Then saith he to the disciple, Behold thy mother! And from that hour that disciple took her unto his own home.",
		"verseref" : null,
		"versecomment" : "Jesus even on the cross filled with physical pain and unspeakable agony, still thought of her mother and asked his disciple to take care of her. What a great picture of being an example how children should care for their parents. ",
		"quitetimedate" : "2020-05-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 28,
		"versetext" : "And he left all, rose up, and followed him.",
		"verseref" : null,
		"versecomment" : "The great lesson here is the response of Matthew. He \"left all\". Many times we want to follow Lord but we can't leave all. We want some of the baggage to go with us and it just keeps us dragging back. We must let go \"everything\" to follow the Lord our saviour Lord Jesus Christ. ",
		"quitetimedate" : "2019-03-14"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 28,
		"versetext" : "Bless them that curse you, and pray for them which despitefully use you.",
		"verseref" : null,
		"versecomment" : "These commandments of Jesus our Savior is quite important for us to be His follower. We must pray for them who are using us despitefully. By doing so we in no way are strengthening the are of our oppressors, rather we are securing our selves by putting ourselves in the mighty arms of God of Israel. These words come to me exactly at the time I needed. As I became anxious and even became aware that maybe I am being used despitefully by my superiors, I need to pray for them as my savior Jesus Christ is clearly asking here me to do.",
		"quitetimedate" : "2019-03-23"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 28,
		"versetext" : "For I say unto you, Among those that are born of women there is not a greater prophet than John the Baptist: but he that is least in the kingdom of God is greater than he.",
		"verseref" : null,
		"versecomment" : "Jesus testifies that John was the highest among all born of women. Jesus makes people understand who John is\/was. But also says that in the kingdom of God it is not so. The earthly greatness is not applicable in the kingdom of God. In the kingdom of God, all it matters is that a person is sealed in the blood of Christ. And that qualification is far greater than any other qualification a person may have acquired on this earth.",
		"quitetimedate" : "2019-04-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 28,
		"versetext" : "When he saw Jesus, he cried out, and fell down before him, and with a loud voice said, What have I to do with thee, Jesus, thou Son of God most high? I beseech thee, torment me not.",
		"verseref" : null,
		"versecomment" : "Devil certainly is not afraid of us but he trembles at the presence of the Lord. Even though the devil might seem to be winning but let us reassure our selves that he trembles at the presence of our God, the God of Abraham, Isaac, and Jacob. ",
		"quitetimedate" : "2019-04-18"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 28,
		"versetext" : "And it came to pass about an eight days after these sayings, he took Peter and John and James, and went up into a mountain to pray.",
		"verseref" : null,
		"versecomment" : "Jesus went into the mountain to pray. He needed to pray while He was on earth. How much more should we? He took the prayer companions with Himself. And how much blessed were these three guys who went with Him and witnessed the unexplainable things. They had so far only heard about Moses and Elias but now they saw them. What a divine experience it must have been to see Moses and Elias in recognizable human form but still in their heavenly bodies! If we spend time with God in prayer and go with Him up into the mountain we God will surely show us the things which we have never imagined so far. Let not the care of this world keep us from such divine experience.",
		"quitetimedate" : "2019-04-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 28,
		"versetext" : "But he said, Yea rather, blessed are they that hear the word of God, and keep it.",
		"verseref" : null,
		"versecomment" : "But for God, there is nothing more blessed than to give attention to His words and do it or keep it. We must not forget this truth. For a Christian to meditate upon God's words is a blessing and a way of living. It must be his first breath in the morning and the last breath before he is asleep. Jesus called such a man a blessed one. Even David in his first psalm called such man a blessed one who meditates upon His words day and night.",
		"quitetimedate" : "2019-05-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 28,
		"versetext" : "There shall be weeping and gnashing of teeth, when ye shall see Abraham, and Isaac, and Jacob, and all the prophets, in the kingdom of God, and you yourselves thrust out.",
		"verseref" : null,
		"versecomment" : "These words of Jesus clearly shows that the people who will miss entering into the kingdom of Heaven will be able to see them who entered in it. Gnashing of teeth is not just because of the torment of hell but it is also because of the highest degree of regret they never experienced before. A regret which never can be fixed for eternity.",
		"quitetimedate" : "2019-07-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 28,
		"versetext" : "Ye are they which have continued with me in my temptations.",
		"verseref" : null,
		"versecomment" : "Can Jesus say this about me? How I have been with Jesus? God must show me how I have been in the time of persecution, troubles, and suffering for His name's sake. This was a very blessed testimony Jesus gave about disciples. It shows the level of commitment and loyalty all the disciples showed in their walk with Jesus in His 3 years of ministry which is about to end. Jesus appreciated and commended them for their companionship and fellowship in times of troubles from Pharisees, Sadducees and all other spiritual leaders. Disciples must have suffered for being Jesus' alliance.\r\n\r\nGod remembers how we have been with Him in the face of persecution and troubles.",
		"quitetimedate" : "2019-11-17"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 12,
		"verseid" : 29,
		"versetext" : "And Jesus answered him, The first of all the commandments is, Hear, O Israel; The Lord our God is one Lord:",
		"verseref" : null,
		"versecomment" : "Jesus emphatically taught that there is only one God. Our God is absolute and is perfect in His nature containing all holiness within Him. He is not a god of something but He is the God of everything, the creator of everything and the sustainer of everything. The first commandment is to have our concept about God to be very clear that He is not plural, He is one. At times we may fail to wrap our head around this as we try to understand this from our human rationale. But He is One.",
		"quitetimedate" : "2018-11-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 29,
		"versetext" : "(For he had commanded the unclean spirit to come out of the man. For oftentimes it had caught him: and he was kept bound with chains and in fetters; and he brake the bands, and was driven of the devil into the wilderness.)",
		"verseref" : null,
		"versecomment" : "Let us also learn that demons need a home a human body to work their way out. And demons cannot stay at rest either, whomsoever they possess they kill and destroy! But the power of the living God can surely make them flee. ",
		"quitetimedate" : "2019-04-18"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 29,
		"versetext" : "And as he prayed, the fashion of his countenance was altered, and his raiment was white and glistering.",
		"verseref" : null,
		"versecomment" : "As He prayed He was transfigured. When we pray God undeniably and undoubtedly changes us from Glory to Glory. After knowing this Truth how foolish it would be not to pray? God certainly purifies us when we go into His presence up into the mountain. We cannot pray without distractions when we are surrounded by all earthly clutter. But we must go up to the mountain, we must get alone with God in a place where there are no earthly distractions to steal our attention.",
		"quitetimedate" : "2019-04-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 29,
		"versetext" : "And they shall come from the east, and from the west, and from the north, and from the south, and shall sit down in the kingdom of God.",
		"verseref" : null,
		"versecomment" : "Sitting down speaks of rest. When we get tired we sit down. The people of God will find eternal rest in the kingdom of God. While ungodly spend eternity in the torment of hell and that also seeing those who are resting in the kingdom of God.",
		"quitetimedate" : "2019-07-05"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 12,
		"verseid" : 30,
		"versetext" : "And thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind, and with all thy strength: this is the first commandment.",
		"verseref" : "Deuteronomy,Deuteronomy 6:4-5,Deuteronomy 6:5",
		"versecomment" : "We must love our God with ALL our heart and ALL our soul and ALL our mind. Our affection, Our being\/existence, Our intellectual all must be surrendered to Him without any reservation. We can give Him all or we have given Him nothing.",
		"quitetimedate" : "2018-11-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 1,
		"verseid" : 30,
		"versetext" : "And the angel said unto her, Fear not, Mary: for thou hast found favour with God.",
		"verseref" : null,
		"versecomment" : "God's sovereignty with Human sanctity",
		"quitetimedate" : "2019-02-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 7,
		"verseid" : 30,
		"versetext" : "But the Pharisees and lawyers rejected the counsel of God against themselves, being not baptized of him.",
		"verseref" : null,
		"versecomment" : "Publicans heard and believed and got baptized but Pharisees and lawyers rejected the counsel of God \"against themselves\". They heard but not believe and were not baptized. The pride kept them away from salvation even though they were so privileged to see the Son of God with their naked eyes and touch Him for three years! What a devastation pride can bring!",
		"quitetimedate" : "2019-04-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 30,
		"versetext" : "For as Jonas was a sign unto the Ninevites, so shall also the Son of man be to this generation.",
		"verseref" : null,
		"versecomment" : "Jesus was appalled by the people who were seeking a sign from God. Now God in the past did give a sign to His people in many different ways but when the Word Himself was with them they were supposed to believe in Him. And Jesus clarified it by saying that there will not be any other sign than the sign of Jonah. Jonah was sent to Nineveh to proclaim God's judgment which would come over them if they do not repent. Ninevehites did not ask for any miracles or sign from heaven. They believed the word God sent to them through His prophet Jonah. And So Jesus said that these people have received the word and did not believe and hence there will not be any other sign given to them.\r\n\r\nWe must believe in God's words instead of seeking a sign. ",
		"quitetimedate" : "2019-06-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 30,
		"versetext" : "Who shall not receive manifold more in this present time, and in the world to come life everlasting.",
		"verseref" : null,
		"versecomment" : "Many false teachers love these verses and twist them to create a false theology out of it to support their greed and earthly desires. God is faithful to His words and he indeed means what He says. Jesus did not speak about personal financial prosperity here. If that was the case all disciples must have been wealthiest men on the earth but we know that they all died as an average person financially. But we know that they had many houses, they had many children, they had many brethren for sure......\r\n\r\nWe must be careful twisting God's words in our favor when it is not.   ",
		"quitetimedate" : "2019-09-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 30,
		"versetext" : "That ye may eat and drink at my table in my kingdom, and sit on thrones judging the twelve tribes of Israel.",
		"verseref" : null,
		"versecomment" : "Jesus our savior has shared everything with us what He received from His Father. He appointed us a kingdom as Father appointed unto Him. He is sitting at Father's right hand and He enabled us also sit at Father's right hand at His throne. He will judge the nations and He enabled us also to judge the twelve tribes of Israel and to judge the angels. These things are not small by any means, these are the glorious things which we will never be able to understand fully until we see them with our own eyes and experience it ourselves when we enter into His kingdom.",
		"quitetimedate" : "2019-11-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 30,
		"versetext" : "When Jesus therefore had received the vinegar, he said, It is finished: and he bowed his head, and gave up the ghost.",
		"verseref" : null,
		"versecomment" : "In this verse and also in verse 28 Jesus seems to be at rest knowing that everything is finished exactly as it should be. What a feeling and confirmation this is just before you die you know deep down in your heart that work is finished. I must have this confirmation of having fulfilled God's will in my life before I depart from this world. ",
		"quitetimedate" : "2020-05-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 31,
		"versetext" : "Who appeared in glory, and spake of his decease which he should accomplish at Jerusalem.",
		"verseref" : null,
		"versecomment" : "This baffles me a bit and I fall short to understand what exactly was going on here. Why Father sent Moses and Elias to talk to Him what Jesus had to accomplish in Jerusalem and that He has to suffer death. But here they are having a conversation with Jesus about His coming death. God will not leave us in delusion about our future but He will surely give us clarity when we submit ourselves to Him. He will show us what waters we have to go thro. And at times He will reveal to us what troubles we will have to go thro to carry out His divine will. God showed Paul also what He will have to suffer for His name!",
		"quitetimedate" : "2019-04-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 31,
		"versetext" : "The queen of the south shall rise up in the judgment with the men of this generation, and condemn them: for she came from the utmost parts of the earth to hear the wisdom of Solomon; and, behold, a greater than Solomon is here.",
		"verseref" : null,
		"versecomment" : "Jesus again solidified His point further by giving an example of the queen of Sheeba. She had only heard about the wisdom of Solomon and she believed. Jesus said that He is greater than Solomon and people did not believe in Him.",
		"quitetimedate" : "2019-06-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 31,
		"versetext" : "The same day there came certain of the Pharisees, saying unto him, Get thee out, and depart hence: for Herod will kill thee.",
		"verseref" : null,
		"versecomment" : "We do not know if these Pharisees were really well-wishers but they came to Jesus and asked Him to depart from the place He was in because Herod might catch Him and kill Him there. ",
		"quitetimedate" : "2019-07-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 31,
		"versetext" : "And if any man ask you, Why do ye loose him? thus shall ye say unto him, Because the Lord hath need of him.",
		"verseref" : null,
		"versecomment" : "There are times the queries of people around us may make us doubt what we are doing as asked by the Lord. We must not use our own knowledge or intellectual to explain why we are doing what we are doing rather we must exactly say what God has asked us to say. At times God's commands may sound strange and questions of people also may make us doubt if we are on the right track. We must not rely on our abilities to give answers at such time. We must rely on God almighty to complete the task He has given us. ",
		"quitetimedate" : "2019-09-24"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 4,
		"verseid" : 31,
		"versetext" : "In the mean while his disciples prayed him, saying, Master, eat.",
		"verseref" : null,
		"versecomment" : "While Jesus was given to talk to Samaritan woman and save her soul and thro her to bring the gospel to Samaria, disciples were all worried about food. First, they left Jesus to buy meat and after returning when they see Jesus talking to a woman they did not show any interest what had just happened. They started pursuing Jesus as well to eat the meat. Their concern probably was correct but not mature enough.",
		"quitetimedate" : "2020-01-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 31,
		"versetext" : "The Jews therefore, because it was the preparation, that the bodies should not remain upon the cross on the sabbath day, (for that sabbath day was an high day,) besought Pilate that their legs might be broken, and that they might be taken away.",
		"verseref" : null,
		"versecomment" : "The cruelty of Romans were beyond imagination. if the person on the cross is not dead then their legs would be broken and then they would be taken off the cross. The person would die in extreme pain with broken legs, body flogged and bleeding, thirst and starvation, may be lying somewhere on the ground out of the sight of normal society . ",
		"quitetimedate" : "2020-05-26"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 32,
		"versetext" : "And they were in the way going up to Jerusalem; and Jesus went before them: and they were amazed; and as they followed, they were afraid. And he took again the twelve, and began to tell them what things should happen unto him,",
		"verseref" : null,
		"versecomment" : "It is interesting to know that they all were on their way to Jerusalem but Jesus ended up going ahead of them! What could be the reason? Was it that Jesus already started telling them in advance what was going to happen in Jerusalem that chief priests and scribes are going to have Him killed? Was that the reason disciples were afraid as they followed Him? What a great reality of human nature affected by sinful nature! Even while we know He is the author of life we are afraid of following Him as it seems risk to our lives! ",
		"quitetimedate" : "2018-11-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 32,
		"versetext" : "But Peter and they that were with him were heavy with sleep: and when they were awake, they saw his glory, and the two men that stood with him.",
		"verseref" : null,
		"versecomment" : "Peter, James, and John were heavy with sleep but when they awoke they could see the indescribable things! We lose so many things God wants us to see because of our spiritual slumber. Our lives become dry and have nothing exciting because of our spiritual sleep. May God help us to remain awake that we may not lose the glorious things God has in store for us to see.",
		"quitetimedate" : "2019-04-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 32,
		"versetext" : "The men of Nineve shall rise up in the judgment with this generation, and shall condemn it: for they repented at the preaching of Jonas; and, behold, a greater than Jonas is here.",
		"verseref" : null,
		"versecomment" : "Why men of Nineveh will rise up and condemn the generation who is seeking a sign? Because they believed in the preaching of Jonah, they did not look for the sign from heaven. But these people after having the Word Himself with them were reluctant to believe. Jesus said He is far greater than Jonah and Solomon. \r\n\r\nAlso, both these people - queen of Sheeba and Ninevehites were gentiles and they had no problem in believing in Jesus but jews they could not believe in Him.",
		"quitetimedate" : "2019-06-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 32,
		"versetext" : "And he said unto them, Go ye, and tell that fox, Behold, I cast out devils, and I do cures to day and to morrow, and the third day I shall be perfected.",
		"verseref" : null,
		"versecomment" : "To the advice of Pharisees responds that Herod cannot kill Him now as He knows the exact day and time when and how He will be killed. Jesus indirectly tells them that He will be killed in Jerusalem only. Jesus refers to the ruler of that region as a fox. Even though Herod is a ruler there is a supreme ruler whose times cannot be defied. Jesus said He has work to finish before His death arrives.",
		"quitetimedate" : "2019-07-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 32,
		"versetext" : "And they that were sent went their way, and found even as he had said unto them.",
		"verseref" : null,
		"versecomment" : "If we believe in what God says now we must know that we will surely find it to be so even though there may not be any glimpse around us what He has told us. We must not forget that He is God and we are not. He laid the foundation of the earth and He knows all the days of every man living or who are about to be born. Such knowledge is beyond human comprehension but He has it. HE is the source of all past present and future. He knows all the details of our tomorrow and even till our last breath on this earth. He is God and no one else. He is the God of Abraham, Isaac and Jacob.",
		"quitetimedate" : "2019-09-24"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 32,
		"versetext" : "But I have prayed for thee, that thy faith fail not: and when thou art converted, strengthen thy brethren.",
		"verseref" : null,
		"versecomment" : "Jesus could see beforehand how was the devil had planned to attack Peter. We must know that our loving savior knows beforehand what devil is planning to do to us and He does not only know but He intercedes for us, He Himself prays for us that devil may not overpower us. Such knowledge is so amazing and so glorious! We must rejoice with trembling and to worship such a loving savior. He did not simply forgive all our sins but He is mindful of every single moment of our lives and He deeply cares for us, far more than we can ever fathom. Yes, He pleads for us to the Father. He loves us and cares for us.",
		"quitetimedate" : "2019-11-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 4,
		"verseid" : 32,
		"versetext" : "But he said unto them, I have meat to eat that ye know not of.",
		"verseref" : null,
		"versecomment" : "Jesus in response to the pleading of disciples to eat said that He already has meat that they know not! Is it possible to stay with Jesus all the time and still not know the things God wants us to know? Based on this example it seems it is very much possible that we have not gone down to the depth of fellowship with God that one day we may hear from Him that we do not know yet.\r\n\r\nDisciples indeed must have heard about how Jesus fanned devil off when he was tempted in the wilderness. Jesus must have told disciples how he replied devil that \"man shall not live by bread alone\"! But disciples forgot and now have their eyes set on the food. Even though concern may be right and bodily need may be very legitimate but when it gets primary place when the heavenly task is left unfinished, we as a follower of Christ must put our legitimate need aside and finish the task. God is not a cruel taskmaster, but He surely expects first preference and if we obey He will give us the strength even when we haven't eat. ",
		"quitetimedate" : "2020-01-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 7,
		"verseid" : 32,
		"versetext" : "The Pharisees heard that the people murmured such things concerning him; and the Pharisees and the chief priests sent officers to take him.",
		"verseref" : null,
		"versecomment" : "Enemies of righteousness always try to take advantage of the situation. Here when Pharisees saw that people have confusion about the identity of Jesus that they are not fully convinced yet that this is the Christ, they tried to leverage this situation by arresting Jesus. They sent soldiers\/officers to take Him.\r\n\r\nWe should know that the devil is going to play the same with us as well. Devil may use people, circumstances and time to his evil advantage and hence such situations whoudl not surprise us. Our author of faith walked that path and we will too.",
		"quitetimedate" : "2020-02-17"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 33,
		"versetext" : "And it came to pass, as they departed from him, Peter said unto Jesus, Master, it is good for us to be here: and let us make three tabernacles; one for thee, and one for Moses, and one for Elias: not knowing what he said.",
		"verseref" : null,
		"versecomment" : "Peter was quick in speaking and so he had bouts of speaking not knowing what he was speaking. We must be ready to hear from the Lord and less in speaking to Him. Prayer does not always mean to keep on speaking but also to keep ourselves in His presence on our knees and wait for God to speak to us and Him being a faithful God He will surely speak to us. Hurrying up in prayer keeps us away from really listening to His voice. May God enable us to hear His voice.",
		"quitetimedate" : "2019-04-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 33,
		"versetext" : "Nevertheless I must walk to day, and to morrow, and the day following: for it cannot be that a prophet perish out of Jerusalem.",
		"verseref" : null,
		"versecomment" : "Jesus in a way lashes out at Jerusalem saying it would be difficult to believe that a prophet is killed outside of Jerusalem. What a reputation of this city, a city of temple, a city of center of worship to living God of Abraham, Isaac, and Jacob! A city about which God said that His throne will be there forever and ever, the throne of David!",
		"quitetimedate" : "2019-07-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 33,
		"versetext" : "Heaven and earth shall pass away: but my words shall not pass away.",
		"verseref" : null,
		"versecomment" : "These words are so glorious and so comforting for all of us God's children. There cannot be greater promise for us than this. We can bet our life on this promise without any smallest doubt or fear.",
		"quitetimedate" : "2019-11-12"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 4,
		"verseid" : 33,
		"versetext" : "Therefore said the disciples one to another, Hath any man brought him ought to eat?",
		"verseref" : null,
		"versecomment" : "Disciples in their ignorance still do not give a thought about what Jesus was talking about. They thought that someone else has already given food to Jesus. There is no reason to believe that Jesus would leave His disciples behind and eat by Himself! He was more mindful of disciples than they could ever imagine. But they ended up applying their natural rationale to the situation instead of trying to understand His heavenly nature.",
		"quitetimedate" : "2020-01-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 7,
		"verseid" : 33,
		"versetext" : "Then said Jesus unto them, Yet a little while am I with you, and then I go unto him that sent me.",
		"verseref" : null,
		"versecomment" : "Jesus told people where He came from, that is from Father and He also told where is He is going, that is to Him who had sent Him. It was plain talk and people could not believe. He confirmed His heavenly authority by signs, wonders, and miracles but still, people could not believe Him. What will it take for us to trust Him? How much He has to prove Himself to us to trust Him and obey Him?",
		"quitetimedate" : "2020-02-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 10,
		"verseid" : 33,
		"versetext" : "The Jews answered him, saying, For a good work we stone thee not; but for blasphemy; and because that thou, being a man, makest thyself God.",
		"verseref" : null,
		"versecomment" : "Pharisees understood the claim of Jesus and so they confirmed that there is nothing Jesus do why they would stone Him but His claim of being equal to God was the reason they would stone Him.",
		"quitetimedate" : "2020-03-08"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 33,
		"versetext" : "But when they came to Jesus, and saw that he was dead already, they brake not his legs:",
		"verseref" : null,
		"versecomment" : "Jesus was already dead and so they had no need to do that extra work of breaking his legs. They couldn't have impose any additional torture by doing it so they didn't do it. ",
		"quitetimedate" : "2020-05-26"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 34,
		"versetext" : "And they shall mock him, and shall scourge him, and shall spit upon him, and shall kill him: and the third day he shall rise again.",
		"verseref" : null,
		"versecomment" : "Jesus told His disciples all the terrible things which was about to happen to Him in Jerusalem. It was loaded description what was going to happen. Disciples were well aware what cross means and hence they indeed would have realized the intense torture beyond description and public shame it will bring. They must have realized how dangerous it is to follow Him through. Jesus provided quite graphic details to them in advance.\r\n\r\nWhat Jesus didn't tell them was how they are going to respond to the situation. Jesus did not tell them that they are also going to leave Him alone. Jesus had to tell Peter because he was boasting too much and Jesus knew that that boasting will not stand when the deadly cruelty comes face to face with Peter. But we know all disciples left Him alone, they ran for their lives when the moment came. Jesus knew that too but He didnt tell that to disciples. He probably didnt want to discourage them beforehand. How infinitely wise and loving savior we have in Jesus! \r\n\r\nOh what could compare to this savior when being in a human flesh He needed the same encouragement which any other human would need in the time of trouble. How severely tormenting it would have been to Him where in His Godhood He knew all HE will be going through in human form! But He cared for his disciples. He did not tell them about how greatly they were going to fail Him!\r\n\r\nO Father, please forgive me and help as day by day I spend my time here on earth in fear and trembling about my future. O God of Abraham, Isaac and Jacob fill my whole being with the knowledge that You are on my side and You are mighty and faithful enough to fight all my fights and lead me through the Red sea when it requires. O God help me in my unbelief. Take my hand precious Lord, lead me on let me stand in your absolute mercy. Father it seems that the fall is just a moment away shine on me O God. Let not the darkness cover me but Lord that your glorious light may shine on me. Amen.",
		"quitetimedate" : "2018-11-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 1,
		"verseid" : 34,
		"versetext" : "Then said Mary unto the angel, How shall this be, seeing I know not a man?",
		"verseref" : null,
		"versecomment" : "God's divine ability against human disability",
		"quitetimedate" : "2019-02-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 11,
		"verseid" : 34,
		"versetext" : "The light of the body is the eye: therefore when thine eye is single, thy whole body also is full of light; but when thine eye is evil, thy body also is full of darkness.",
		"verseref" : null,
		"versecomment" : "God clearly is speaking to me once again in a very straightforward manner.\r\n\r\nO Father, please forgive me in your faithfulness and because of your great name. My eyes have wandered to see evil things and yes Lord whole of my being including my body is been defiled due to my eyes. Wash me O Father in the blood of Christ and seal me in the blood of Christ.",
		"quitetimedate" : "2019-06-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 34,
		"versetext" : "O Jerusalem, Jerusalem, which killest the prophets, and stonest them that are sent unto thee; how often would I have gathered thy children together, as a hen doth gather her brood under her wings, and ye would not!",
		"verseref" : null,
		"versecomment" : "Jesus shows His utter desperation for this city of Jerusalem which has a history of killing the prophets. God in His abundance of mercy and love kept on sending His people to warn this city and they were met with hostility. God wanted to gather them in His healing wings but they rejected this divine love and chose their own self-righteousness.",
		"quitetimedate" : "2019-07-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 17,
		"verseid" : 34,
		"versetext" : "I tell you, in that night there shall be two men in one bed; the one shall be taken, and the other shall be left.",
		"verseref" : null,
		"versecomment" : "The center idea about two people doing the same thing still one will be taken and the other will be left os that by outward activities of any person we never can know whether he\/she knows God and is ready to be taken up to be with the Lord. We must be very sure about our heart and not just our outward activities. People might see us entire our lives as good as any other good Christian only to find in the end that we were just living a double life and never really had heart yielded to God in its entirety.\r\n\r\nMay God almighty give me this depth where my heart maybe with the Lord for His glory forever.\r\n\r\n\r\nO Lord, please forgive me for the sake of thy name as entire my day I have reeled into dep deep lust of the flesh, defiling my eyes with the lust and my body with the lust while all the time I kept up the show of godliness for others to see. O Loving Father now because of your great name and because of your unchaning promises I beg you that you forgive me, cleanse me and wash me in the blood of Christ. Amen.",
		"quitetimedate" : "2019-08-27"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 34,
		"versetext" : "And they understood none of these things: and this saying was hid from them, neither knew they the things which were spoken.",
		"verseref" : null,
		"versecomment" : "Jesus informed His twelve disciples in advance all the suffering Hew will go through in Jerusalem. His words were plain and simple but disciples could not understand it. They carried a different picture of Jesus in their head. For them, He was the Son of God who cannot be defeated by anyone. The one who orders even the sea and it listens to Him. For them to understand that Jesus can fall into the hands of men was baffling thought. \r\n\r\nWe also sometimes carry very wrong picture of God in our head. Thinking that He is almighty and creator of heaven and earth we think that we will always soar high. But we must know from Jesus example that we may go thru the sufferings, we may fall into the hands of evil people and they can even kill us. But the most glorious thought and confirmation we have is that we are eternally secured in His presence. Just because our bodies fall into the hands of evildoers cannot do any bad to our soul or our eternal life we have in Him.\r\n\r\nO God of Abraham, Isaac, and Jacob I worship for your unfathomable love and forgiveness. I feel like I have just began to understand what Cross is and the vastness of your mercies. Now for thy names sake seal me in the blood of Christ and let my heart rest in peace in thy eternally blissful abode. Amen.",
		"quitetimedate" : "2019-09-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 34,
		"versetext" : "And they said, The Lord hath need of him.",
		"verseref" : null,
		"versecomment" : "How glorious words....The Lord hath need of him! A colt who has no experience of carrying anything, have never done anything by itself. have no education or training and is just a baby in the eyes of all. But the Lord hath need of him and for a grand event where He is going to be proclaimed as a King. God has the need of people who are meek and have nothing to boast in themselves. God can use such people so gloriously. We must be like a colt to be used greatly by God.",
		"quitetimedate" : "2019-09-24"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 34,
		"versetext" : "And take heed to yourselves, lest at any time your hearts be overcharged with surfeiting, and drunkenness, and cares of this life, and so that day come upon you unawares.",
		"verseref" : null,
		"versecomment" : "Jesus has encouraged us to be always mindful of that day when we realize that the kingdom of God is near and our redemption is near. But if we are lost in the cares of this life and submerged into the affairs of this earth, lost in the lust of the flesh and pride of life then we may end up being unaware of that day. and that day may come upon as a snare as the rest of the people on the earth.",
		"quitetimedate" : "2019-11-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 34,
		"versetext" : "And he said, I tell thee, Peter, the cock shall not crow this day, before that thou shalt thrice deny that thou knowest me.",
		"verseref" : null,
		"versecomment" : "Peter in His hastiness spoke how He is going to be with Him all the way even to death but Jesus in His divine foreknowledge knew what Peter is going to do and He explained it to Peter so clearly. Peter did not dare to deny or argue with Jesus. Probably he was already filled with fear but he was trying to look so courageous! It wasn't much long after this Peter exactly did what Jesus told him he would do. Jesus instead of rebuking Peter prayed for him. This is such a great example of how our attitude should be toward the people we know would do mistakes.",
		"quitetimedate" : "2019-11-17"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 4,
		"verseid" : 34,
		"versetext" : "Jesus saith unto them, My meat is to do the will of him that sent me, and to finish his work.",
		"verseref" : null,
		"versecomment" : "Jesus explained to disciples what meat He was talking about. The earthly food may satisfy our body but our soul may still remain hungry. The real hunger is not in our stomach but it is much deeper. A person may remain unsatisfied even after having all the food he desired. But when we know, understand and do God's will that will supersede all satisfaction. The joy of doing God's will be far more satisfying and fulfilling than having food. If Jesus is our leader than we must have this mind of Jesus that we may be ready to put doing God's will ahead of our bodily hunger. We many times start doing God's work but it remains unfinished because we are more careful about our bodily needs. ",
		"quitetimedate" : "2020-01-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 19,
		"verseid" : 34,
		"versetext" : "But one of the soldiers with a spear pierced his side, and forthwith came there out blood and water.",
		"verseref" : null,
		"versecomment" : "Not sure why piercing his side as he was already dead. But there is not a lot of tittle which was written in vain what all would happen to Him. So here they pierced His side and blood and water came out. His blood was literally shed not just he was bleeding but the literal shedding of His blood for me for many.",
		"quitetimedate" : "2020-05-26"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 35,
		"versetext" : "And James and John, the sons of Zebedee, come unto him, saying, Master, we would that thou shouldest do for us whatsoever we shall desire.",
		"verseref" : null,
		"versecomment" : "James and John were the first whom Jesus called out as His disciples and so have spent the longest time with Jesus. While Jesus is talking about how He is going to die they are concerned about the desire of their heart. The very real picture coming out of the gospel about disciples how deeply rooted sinful nature is that even after walking and talking with Jesus 24x7 for almost 3 years they were still struggling to get rid of their selfishness. This is the picture of us. No matter how much we claim to be walking with the Lord we struggle with our old sinful nature almost on a daily basis. And our savior knows that and He still loves us and cares for us.",
		"quitetimedate" : "2018-11-13"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 35,
		"versetext" : "And there came a voice out of the cloud, saying, This is my beloved Son: hear him.",
		"verseref" : null,
		"versecomment" : "This experience must have been very ecstatic and divine for Peter, James, and John. Getting covered by the cloud of heavenly Glory and listening to an audible voice. They would have never forgotten this in their life!",
		"quitetimedate" : "2019-04-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 13,
		"verseid" : 35,
		"versetext" : "Behold, your house is left unto you desolate: and verily I say unto you, Ye shall not see me, until the time come when ye shall say, Blessed is he that cometh in the name of the Lord.",
		"verseref" : null,
		"versecomment" : "The punishment for this city was the absence of God until an appointed time. Rejecting God almighty is the costliest choice one can make. And at times that choice may become irreversible. God certainly gives time and chances to reverse it but not too long before it becomes irreversible. God gives chances even at the expense of the men and women of God whom He gives this tough task to go and talk to murderous and merciless God haters. But soon He will rise up as a judge and declare the eternal sentence on those who have defied His love and grace times and again.",
		"quitetimedate" : "2019-07-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 35,
		"versetext" : "And they brought him to Jesus: and they cast their garments upon the colt, and they set Jesus thereon.",
		"verseref" : null,
		"versecomment" : "It is very interesting to know that the name of the person whose donkey Jesus used is never mentioned in the scripture and Jesus did not take his name either. The triumphant entry of Jesus into Jerusalem - it was a grand event and the whole city was in tumult and excited over it. It was an event of a lifetime and the person whose donkey was used could have received the status as a celebrity if people knew Jesus asked for his donkey to be used for this glorious event. But surprisingly this persons identity is never known.\r\n\r\nWe must know that there is a multitude of Gods servants whom nobody would ever know on this side of eternity. We must not serve God so people know that we are the ones being used. We must not have slightest boasting in our hearts or desire of being known by men. We must be ready to serve the Lord even there is no name or fame.",
		"quitetimedate" : "2019-09-24"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 35,
		"versetext" : "And he said unto them, When I sent you without purse, and scrip, and shoes, lacked ye any thing? And they said, Nothing.",
		"verseref" : null,
		"versecomment" : "When God sends someone for His service, He provides everything and he\/she would not lack anything. Not necessarily he\/she will be rich but for sure will not lack anything and never be in want or sleep hungry. A person will never have to beg when he is in the ministry ordained by god. Disciples confirmed this great truth and faithfulness of the Lord.",
		"quitetimedate" : "2019-11-18"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 5,
		"verseid" : 36,
		"versetext" : "And he spake also a parable unto them; No man putteth a piece of a new garment upon an old; if otherwise, then both the new maketh a rent, and the piece that was taken out of the new agreeth not with the old.",
		"verseref" : null,
		"versecomment" : "Jesus was trying to explain here that salvation is not a patchwork. The work of the cross in a Christian is not to improve but to replace. We must not expect God to fix things in our lives rather our old life must be totally done away with in the cross and we must become a new creature. It is not a covering of sins it is the removing of sins. Until we have the experience of dying there is no new life. Born again cannot happen until we are dead to this world where old is in the grave and new life in Christ is now all in all. There cannot be even micro level agreement with old sinful life, no not at all.",
		"quitetimedate" : "2019-03-14"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 36,
		"versetext" : "Be ye therefore merciful, as your Father also is merciful.",
		"verseref" : null,
		"versecomment" : "The standard of being merciful is not what we set but what God has set before us. I have come across many Christians who have set the standard of being merciful and I myself also have done this many times. But let us understand and contemplate how merciful our heavenly Father is and try to reflect that same mercifulness in us.",
		"quitetimedate" : "2019-03-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 36,
		"versetext" : "Watch ye therefore, and pray always, that ye may be accounted worthy to escape all these things that shall come to pass, and to stand before the Son of man.",
		"verseref" : null,
		"versecomment" : "Lord Jesus has commanded us to pray for the days are coming which are filled with persecution and sorrows. We will not be able to stand firm during those heavy days. Those days will be filled with physical and mental torture. The only strength we have is the strength that comes from above. All other strength will fall so short and hence we must pray. ",
		"quitetimedate" : "2019-11-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 36,
		"versetext" : "Then said he unto them, But now, he that hath a purse, let him take it, and likewise his scrip: and he that hath no sword, let him sell his garment, and buy one.",
		"verseref" : null,
		"versecomment" : "Was Jesus really alluding to the fact that now disciples would need to start worrying about how they will survive? That they would need to have financial security and physical security? No never. Probably Jesus was saying that they would need to be prepared for all situations and better organized for all situations. ",
		"quitetimedate" : "2019-11-18"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 36,
		"versetext" : "And as they thus spake, Jesus himself stood in the midst of them, and saith unto them, Peace be unto you.",
		"verseref" : null,
		"versecomment" : "The disciples were in a confused state and also probably emotionally down with what all had happened. They were almost unable to process to the news they got through these two men that Jesus appeared unto them on the way to Emmaus. Jesus appears to them and the first thing He speaks to them is \"Peace be unto you\". Our loving savior always brings peace and offers peace to us - His children. No matter where we stand in our spiritual state. At times we are on top of the mountain spiritually and other times we are wailing deep in the valley for days. But we must know that our savior is loving and caring. He will meet us and will certainly bring peace to us.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 7,
		"verseid" : 36,
		"versetext" : "What manner of saying is this that he said, Ye shall seek me, and shall not find me: and where I am, thither ye cannot come?",
		"verseref" : null,
		"versecomment" : "Jews could not understand what Jesus was saying! They were so earthly minded that they were interpreting words of Jesus as if He was going to some \"place\" where they cannot find Him neither they themselves cannot go. They did not ask Jesus to explain, they did not show interest to learn from Him further. He surely would have explained to them rather they chose to question Him wrongly and be prideful in their heart.",
		"quitetimedate" : "2020-02-17"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 9,
		"verseid" : 37,
		"versetext" : "Whosoever shall receive one of such children in my name, receiveth me: and whosoever shall receive me, receiveth not me, but him that sent me.",
		"verseref" : null,
		"versecomment" : "Jesus took very simple route to convey the great truth about how to serve the Lord? Receiving a small child with love & compassion HE said is equal to receiving Him and ultimately is equivalent to receiving Father in heaven. There are times when we do not clearly understand what it is to receive God's will or to do His will, we always think they to serve God we need to be on the stage as a preacher or a missionary in a jungle. While they are certainly one of the areas to serve the Lord but there are so many opportunities in our day to day life we can serve God. A little help to fellow human irrespective of he\/she is Christian or not, good or bad, poor or rich, a little help which might seem little in our eyes but God evaluates that so differently. He considers that as if it was done to Him. We must never miss such opportunities.",
		"quitetimedate" : "2018-10-30"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 37,
		"versetext" : "They said unto him, Grant unto us that we may sit, one on thy right hand, and the other on thy left hand, in thy glory.",
		"verseref" : null,
		"versecomment" : "James and John were trying to secure their place in glory. It is difficult to say what actually they had in their mind. If they though of Jesus as a king and themselves as His top 2 rulers, we dont know. But Jesus indeed confronted them and so there is a possibility that they had come up with selfish desires to become a ruler next to Jesus in His kingdom. ",
		"quitetimedate" : "2018-11-13"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 37,
		"versetext" : "Then the whole multitude of the country of the Gadarenes round about besought him to depart from them; for they were taken with great fear: and he went up into the ship, and returned back again.",
		"verseref" : null,
		"versecomment" : "This is so strange! People asked Jesus to leave from their territory and Jesus did not force Himself on them either. They were fine living with a man possed with demons but they were not ready to have a Man filled with Holy Spirit! We do not know much about this region but it seems to be that they were in one accord to put Jesus out of their territory. And Jesus left! \r\n\r\nOh, that we may realize how costly it is to not having the presence of God. These people were offended because of the loss of swine, their earthly possession. They rather would have a demon-possessed people among them than having Jesus! How sad! But there are times in our lives we also choose our earthly things over Jesus. Oh, that God may open our eyes and heart to realize our own situation where we have rejected Him over our own sinful life and possession.",
		"quitetimedate" : "2019-04-21"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 37,
		"versetext" : "And it came to pass, that on the next day, when they were come down from the hill, much people met him.",
		"verseref" : null,
		"versecomment" : "Jesus, Peter, James, and John came down from the hill the next day. That means they were there the entire night. And it is logical to believe that Jesus spent time in prayer far more than the disciples as they got heavy with the sleep and indeed fell asleep but when they woke up they found Jesus with Moses Elias. This indeed speaks of the prayer life of Jesus. We have the greatest example of a prayer warrior we can learn from.",
		"quitetimedate" : "2019-05-02"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 37,
		"versetext" : "And in the day time he was teaching in the temple; and at night he went out, and abode in the mount that is called the mount of Olives.",
		"verseref" : null,
		"versecomment" : "Jesus taught how to pray and he also set an example of a prayerful life. He taught during the day and in the night He went into the mount of Olives to pray. We do not know how long did he pray but we surely can assume that He prayed for quite some time. Our private prayers can be long and should be long while our public prayers should be short. Jesus prayed nights after nights and if He needed to pray how much more do we need to pray.",
		"quitetimedate" : "2019-11-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 37,
		"versetext" : "But they were terrified and affrighted, and supposed that they had seen a spirit.",
		"verseref" : null,
		"versecomment" : "It is so apparent that disciples are so unable to believe what they were seeing and hearing. They were afraid and thought that it is some kind of spirit. In their state of mind, they are totally unable to recognize Jesus. And so we are, because of the constant failure in our spiritual life and struggling with sin we lose the capacity to recognize the voice of the Lord. ",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 7,
		"verseid" : 37,
		"versetext" : "In the last day, that great day of the feast, Jesus stood and cried, saying, If any man thirst, let him come unto me, and drink.",
		"verseref" : null,
		"versecomment" : "Multiple times we read here that during the feast Jesus did not stand up and teach, but He cried. This was the tone of desperation, tone of pleading, tone of persuasion. ",
		"quitetimedate" : "2020-02-17"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 1,
		"verseid" : 38,
		"versetext" : "And Mary said, Behold the handmaid of the Lord; be it unto me according to thy word. And the angel departed from her.",
		"verseref" : null,
		"versecomment" : "God's faithfulness for human faith and humbleness",
		"quitetimedate" : "2019-02-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 38,
		"versetext" : "Give, and it shall be given unto you; good measure, pressed down, and shaken together, and running over, shall men give into your bosom. For with the same measure that ye mete withal it shall be measured to you again.",
		"verseref" : null,
		"versecomment" : "This is surely God's promise and His words are never to fail. However, we have to be watchful that we may not fall into the trap of giving only that we may receive. The message of Jesus is so different than others in this that it does not flow with most of the average goodness which you can find even in the worldly people. He wants us to give without any expectations and not keep looking for reward and be wary of it. Let Him decide of His times to reward us without we being so mindful about it.",
		"quitetimedate" : "2019-03-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 38,
		"versetext" : "And he cried, saying, Jesus, thou son of David, have mercy on me.",
		"verseref" : null,
		"versecomment" : "Who taught this blind man that Jesus was the son of David? Probably it seems that this blind man and a beggar was a godly man. He must have talked to people about Jesus, he may have heard Jesus preaching. He must have contemplated all that he must have heard and he must have received this understanding and clarity from God about who Jesus was.",
		"quitetimedate" : "2019-09-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 21,
		"verseid" : 38,
		"versetext" : "And all the people came early in the morning to him in the temple, for to hear him.",
		"verseref" : null,
		"versecomment" : "Not only He prayed the entire night but early in the morning He was back in the temple as well as this verse says. People came to the temple early in the morning to listen to Him and it clearly shows that Jesus was there in the temple early in the morning. What a great example we have in our savior. A life of solid hard work not to get rich but to be close to the Father's heart. Having this lifestyle nothing would shake us from our stand in Christ. Spending time in God's presence is never waste. It is where we find the direction and the meaning for our life.",
		"quitetimedate" : "2019-11-12"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 38,
		"versetext" : "And they said, Lord, behold, here are two swords. And he said unto them, It is enough.",
		"verseref" : null,
		"versecomment" : "If Jesus really meant that every disciple needs to have a sword then he would not say that two are enough among twelve. Disciples immediately took Jesus' words literally to be prepared for the physical fight and started counting the swords. They might have even thought that they would need to buy them more swords but Jesus stopped them. We must know that God would not allow us to use worldly weapons against our spiritual enemies. He has already warned us that our war is not against flesh and blood but against the power of darkness. Devil cannot be defeated by the sword and by bloodshed. The devil can be defeated only by the spiritual weapons and the greatest of such weapons is prayer. Prayer will keep us humble and knelt before God and tall before devil.",
		"quitetimedate" : "2019-11-18"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 38,
		"versetext" : "And he said unto them, Why are ye troubled? and why do thoughts arise in your hearts?",
		"verseref" : null,
		"versecomment" : "What a great question Jesus asked? It was not for intimidation or for condemnation but it was for comfort and to open the eyes of these frightened disciples.  Our loving Savior is asking us today, He is asking me today, \"Why are ye troubled? and why do thoughts arise in your heart?\" In other words, He is asking us why are you so anxious and worried? What a comforting God we have! He has promised He will never break the bruised reed. He will surely restore us and He will never despise the one who comes to Him with true repentance and brokenness.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 39,
		"versetext" : "And they said unto him, We can. And Jesus said unto them, Ye shall indeed drink of the cup that I drink of; and with the baptism that I am baptized withal shall ye be baptized:",
		"verseref" : null,
		"versecomment" : "Jesus promised the cup of persecution to His disciple. Jesus knew how they all were going to die for the sake of the gospel.  We must follow Jesus fully aware that it may cost us everything or else we must stop to follow Him. He calls us to dare and trust Him for our very breathe. Following Jesus was never so easy until our time when suddenly following Jesus meant to be on top of the world by means of finance and every other worldly way!",
		"quitetimedate" : "2018-11-13"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 39,
		"versetext" : "And he spake a parable unto them, Can the blind lead the blind? shall they not both fall into the ditch?",
		"verseref" : null,
		"versecomment" : "Jesus clearly warned the blind leaders as well as the followers who follow the blind leaders. Spiritual leaders who can not see the truth cannot show the truth to others. In their blindness, if they start leading others then both the leader and the followers are doomed to fall into the ditch. A ditch is something you cannot come out by yourselves, you need someone who is outside to pull you out. There is a great responsibility for us to know who we are following.",
		"quitetimedate" : "2019-03-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 39,
		"versetext" : "Return to thine own house, and shew how great things God hath done unto thee. And he went his way, and published throughout the whole city how great things Jesus had done unto him.",
		"verseref" : null,
		"versecomment" : "Jesus saw the need of this man to be in his own home town to spread the good news and become light. People of the region rejected Him but they would listen to this man from whom the demons were cast out. Jesus sent him back to his home and be an evangelist. And this man indeed became a zealous evangelist. \r\n\r\nGod does not save men to simply go to heaven. He saves us so we become message bearer and become blessings to others. Am I a message bearer? If not then may God have mercy upon me to become a message bearer He wants me to be.",
		"quitetimedate" : "2019-04-21"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 39,
		"versetext" : "And they which went before rebuked him, that he should hold his peace: but he cried so much the more, Thou son of David, have mercy on me.",
		"verseref" : null,
		"versecomment" : "He was persistent in his cries to Jesus. He knew for sure that the one who can heal him and give him sight is Jesus and no one else. He knew for sure that He is the messiah and he will cure him without any doubt. So he persisted in his cries for help.",
		"quitetimedate" : "2019-09-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 39,
		"versetext" : "And he came out, and went, as he was wont, to the mount of Olives; and his disciples also followed him.",
		"verseref" : null,
		"versecomment" : "It was customary for Jesus to go into the mountains to pray and spend time with His Father in heaven. And probably at times disciples also went with Him into the mountains. We must learn from our savior to depart into our mountain to spend time with our Father in heaven. ",
		"quitetimedate" : "2019-11-19"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 39,
		"versetext" : "Behold my hands and my feet, that it is I myself: handle me, and see; for a spirit hath not flesh and bones, as ye see me have.",
		"verseref" : null,
		"versecomment" : "He assures us even in the midst of our lowest moment that He Himself is there. He wants us to stop worrying and stop getting anxious. He offers Himself to us to touch Him and have the first-hand experience and not just to hear from others about who He is. He wants us to get rid of all other thoughts and the impression we may have about Him. He wants us to know that He is the one who was nailed to the cross for us to bear our sins and He indeed carries the marks of the cross. He is resurrected savior, the glorious and the triumphant King. \r\n\r\nWe do not know fully what kind of body we will have in the resurrection but here Jesus in His resurrected body and He has flesh and bones. These things are so mind boggling and we will have eternity to fathom it.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 1,
		"verseid" : 39,
		"versetext" : "He saith unto them, Come and see. They came and saw where he dwelt, and abode with him that day: for it was about the tenth hour.",
		"verseref" : null,
		"versecomment" : "When these two disciples started following Jesus, the first question of Jesus to them was \"What seek ye?\". God is asking the same question to us as well today if we are following Him. What are you seeking? The question of Jesus is very important. We must know why are we following Him? These two disciples wanted to see where Jesus lived and Jesus did show them where He lived and these two stayed\/abode with Him because it was the tenth hour. If we follow Jesus we must continue to abide with Him because we are living not just in the tenth hour but probably in the eleventh hour.\r\n\r\nGod is happy in we abiding with Him and for us, that is the safest and most joyful place to be in.",
		"quitetimedate" : "2019-12-16"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 11,
		"verseid" : 39,
		"versetext" : "Jesus said, Take ye away the stone. Martha, the sister of him that was dead, saith unto him, Lord, by this time he stinketh: for he hath been dead four days.",
		"verseref" : null,
		"versecomment" : "When God asks to do a certain thing, which we may find to be abnormal and unusual but we must obey to do what He asks and we would see His power. The situation may be very adverse but it should not stop us from believing His words.",
		"quitetimedate" : "2020-03-16"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 10,
		"verseid" : 40,
		"versetext" : "But to sit on my right hand and on my left hand is not mine to give; but it shall be given to them for whom it is prepared.",
		"verseref" : null,
		"versecomment" : "Jesus showed His obedience to the Father. This is such a great mystery and I do not know how we will understand but Jesus being God He did not assume the authority while He was on the earth. ",
		"quitetimedate" : "2018-11-13"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 40,
		"versetext" : "And it came to pass, that, when Jesus was returned, the people gladly received him: for they were all waiting for him.",
		"verseref" : null,
		"versecomment" : "What a great contrast in the response Jesus got on two shores? In Gadarenes He was asked to depart and in Galilee, He was so greatly awaited and received! Which category do we fall in? Gadarenes didn't want Him because they loved their pigs and loss of pigs was a great concern for them over having Jesus with them. When we choose earthly things over Jesus we are indirectly rejecting Him. May God help us to understand this and also save us from this terrible folly.",
		"quitetimedate" : "2019-04-23"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 12,
		"verseid" : 40,
		"versetext" : "Be ye therefore ready also: for the Son of man cometh at an hour when ye think not.",
		"verseref" : null,
		"versecomment" : "This might sound to be a threat but that is the reality. God of Abraham, Isaac, and Jacob obviously is not interested in part-time Christians. Every moment and all the time we must be ready and glad to see Him. \r\n\r\nO God I am the biggest culprit here. My heart has grown so cold and ugly over the period that I love to cling to my sin and especially the sin of lust. In your mercy Lord please forgive me and pull me out of this sin which my heart naturally loves to enjoy. Forgive me because of your great name and fill me with your Holy Spirit O Lord. Amen.",
		"quitetimedate" : "2019-06-22"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 40,
		"versetext" : "And Jesus stood, and commanded him to be brought unto him: and when he was come near, he asked him,",
		"verseref" : null,
		"versecomment" : "Jesus stood. We must know for sure without any doubt in our mind and heart that there is no prayer coming out of a righteous and desperate heart, God would would ever despise, no He never wouldn't. Jesus stopped and responded to the cries of this blind beggar. He asked others to bring this blind man to him. Jesus would have given him sight without any need of him beeb brought to Him. There is a great principle we must learn to hear that God wants us to be the partakers of His glorious work on this earth. God wants us to bring the people to Him which He can do without our help. ",
		"quitetimedate" : "2019-09-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 40,
		"versetext" : "And when he was at the place, he said unto them, Pray that ye enter not into temptation.",
		"verseref" : null,
		"versecomment" : "This is a command from Jesus Himself to us if we want to save ourselves from temptations. We cannot determine to be strong against temptations in our own strength, we can pray to receive strength from above to stay strong against temptations. Yes, we have a God shown way to save ourselves from temptations and that way is prayer. We must not neglect to pray to our own folly.",
		"quitetimedate" : "2019-11-19"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 40,
		"versetext" : "And when he had thus spoken, he shewed them his hands and his feet.",
		"verseref" : null,
		"versecomment" : "Jesus offered His hands and feet to disciples so that they can touch and experience His nailed pierced hands. Jesus does that even today. In our moments of despair and devastation, He is there offering us Himself that we may know that He is there and He cares for us.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 41,
		"versetext" : "And why beholdest thou the mote that is in thy brother's eye, but perceivest not the beam that is in thine own eye?",
		"verseref" : null,
		"versecomment" : "Here is another great lesson for us that if we try to correct our brother while we assume to go by our own rules and righteousness, God doesn't approve that kind of correction as well. Clearly when we roll into sin and go out proving others how sinful they are is pure hypocrisy and is not acceptable into the site of God. ",
		"quitetimedate" : "2019-03-26"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 18,
		"verseid" : 41,
		"versetext" : "Saying, What wilt thou that I shall do unto thee? And he said, Lord, that I may receive my sight.",
		"verseref" : null,
		"versecomment" : "Jesus asked this blind man what He wanted to do unto him? And the blind man had just one simple ask \"to receive my sight\". Jesus knew already what this blind man needed. His cries were in general for mercy but Jesus gave him chance to open up and be specific. The ask of this blind man was genuine and honest. He needed the sight and Jesus instantly restored his sight.",
		"quitetimedate" : "2019-09-07"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 41,
		"versetext" : "And when he was come near, he beheld the city, and wept over it,",
		"verseref" : null,
		"versecomment" : "All around Jesus there is an atmosphere of celebration. All people are going thru an ecstatic experience of welcoming the King. In that whole scenario, Jesus looked at the city and wept. This is the sign of the godly mind. The true followers of Christ do not get caught up in the so-called party when there are lost people around. The sign of a saved person is that no matter where he or she is his\/her heart is always broken over the lost. We must have the mind of Christ and this is the one example of how we should be.",
		"quitetimedate" : "2019-09-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 41,
		"versetext" : "And he was withdrawn from them about a stone's cast, and kneeled down, and prayed,",
		"verseref" : null,
		"versecomment" : "It was customary to Jesus not only to pray but to get alone with God, away even from His disciples. We must realize and understand the need of getting alone with God. Those who get alone with God are never lonely, helpless or powerless. People who do not spend time alone with God, no matter how great they may become in the sight of men but they would be extremely poor in their walk with God and their relationship with God and it would be almost impossible for God to be glorified in and thru them. Jesus kneeled down and pray and so do we. Kneeling is a very humbling experience and those exercise it, God can work our the humbleness in them deeply.",
		"quitetimedate" : "2019-11-19"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 42,
		"versetext" : "Saying, If thou hadst known, even thou, at least in this thy day, the things which belong unto thy peace! but now they are hid from thine eyes.",
		"verseref" : null,
		"versecomment" : "God sighs about the city of Jerusalem, a city where God was worshiped. The City a dwelling place and a ruling place forever and ever for living God as God promised to king David. The city which was the pinnacle for the worship of living God. But it deteriorated to the point that it cannot see anymore as Jesus said. All the show of religiosity and rituals but no knowledge of the living God. What a sad situation!\r\n\r\nThis is possible with us as well. We can be so spiritual from outside while when God looks inside He cannot find any godliness inside!",
		"quitetimedate" : "2019-09-29"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 42,
		"versetext" : "Saying, Father, if thou be willing, remove this cup from me: nevertheless not my will, but thine, be done.",
		"verseref" : null,
		"versecomment" : "This is the example of prayer we must follow. God would not beat us up to be honest about the desire of our heart to put before him but we must always allow God almighty to choose for us because in the best of our judgment what we can choose always would be inferior to His choice for us.",
		"quitetimedate" : "2019-11-19"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 1,
		"verseid" : 42,
		"versetext" : "And he brought him to Jesus. And when Jesus beheld him, he said, Thou art Simon the son of Jona: thou shalt be called Cephas, which is by interpretation, A stone.",
		"verseref" : null,
		"versecomment" : "On the very first site of Peter Jesus called him a stone. Jesus was and is the cornerstone of the church but Peter was a stone and we all a stone in the church. Whom God chooses usually He changes the identity and there is a great purpose I believe behind it. God wants them to detach and separate themselves completely even from their old name. God changed Peter's name at the very first meeting. God called Abram and changed his name to Abraham, God changed Sarai's name to Sarah and God changed Jacob's name to Israel. And after that the only time God Himself changed someone's name was Peter. But Jesus even after changing his name continued calling him Peter as it was supposed to be meaningful over many generations in the future in church history. Peter remained Peter and he ended up denying Jesus three times. But HE was chosen one and God does not change His mind for our failures. ",
		"quitetimedate" : "2019-12-16"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 15,
		"verseid" : 43,
		"versetext" : "Joseph of Arimathaea, an honourable counsellor, which also waited for the kingdom of God, came, and went in boldly unto Pilate, and craved the body of Jesus.",
		"verseref" : null,
		"versecomment" : "Joseph must have been a very devotee of Jesus but he never surfaced anywhere. But in the times when even disciples were afraid to identify themselves as companion of Jesus, Joseph went to Pilate and boldly asked to have the body of Jesus. This could have been a total disaster for his career but he did it anyways. Being bold for Jesus is very much needed. \r\n\r\nO Lord, I have not been bold as you want me to be. I have been bold wrongly in many cases but being bold for Jesus is which something I have missed and at times missed deliberately. Please forgive me O Lord in your mercy to be a bold witness and a follower of Christ. Amen.",
		"quitetimedate" : "2019-02-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 43,
		"versetext" : "And there appeared an angel unto him from heaven, strengthening him.",
		"verseref" : null,
		"versecomment" : "Honest and desperate prayers are never ignored by God. Whether we can see an angel or not but we can be sure that He strengthens us when we pray. He does not break the bruised reed.",
		"quitetimedate" : "2019-11-19"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 43,
		"versetext" : "And he took it, and did eat before them.",
		"verseref" : null,
		"versecomment" : "Still, disciples were not able to believe because they were overwhelmed with joy as sometimes it happens to us! So Jesus asked them for food and ate broiled fish and honey! Jesus did not leave any stone unturned to assure disciples that it was Him, their savior! Such a savior we have who would not leave us in darkness about who He is. He assures us in many different ways that He is with us and that His promises are unfailing unchanging.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 15,
		"verseid" : 44,
		"versetext" : "And Pilate marvelled if he were already dead: and calling unto him the centurion, he asked him whether he had been any while dead.",
		"verseref" : null,
		"versecomment" : "Why would Pilate marvel at Jesus death? May be Jesus was death was quicker than usual time it would take for someone to die on the cross. May be Jesus was beaten up and tortured so much before his crucifixion that He could not pull longer on the cross and He died. Also the scripture that his body will not see any rottenness. ",
		"quitetimedate" : "2019-02-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 2,
		"verseid" : 44,
		"versetext" : "But they, supposing him to have been in the company, went a day's journey; and they sought him among their kinsfolk and acquaintance.",
		"verseref" : null,
		"versecomment" : "Heavenly minded people are not easily found in earthly folks. They are so marked by Holy Spirit that they never seek the company of earthly minded. They are not much bothered by earthly business, they are so abandoned to God and for the Father's business.",
		"quitetimedate" : "2019-02-15"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 44,
		"versetext" : "And shall lay thee even with the ground, and thy children within thee; and they shall not leave in thee one stone upon another; because thou knewest not the time of thy visitation.",
		"verseref" : null,
		"versecomment" : "The result of spiritual deterioration is fatal for any person. The enemy first will throw all the things we love and would have us believe that we are doing great. But in the end, the enemy is nothing else but to kill and destroy. Jesus prophesied that Jerusalem will be desolate. All the glory of the temple and all so-called righteousness will be exposed and gone. And the reason is that it did not realize the time God gave to return and set right.\r\n\r\nMay God help us not to be so blind and lost in our own spiritual fancies that we may lose the sight of God's truth and become so deaf that we may not be able to hear the God's voice.",
		"quitetimedate" : "2019-09-29"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 15,
		"verseid" : 45,
		"versetext" : "And when he knew it of the centurion, he gave the body to Joseph.",
		"verseref" : null,
		"versecomment" : "It is so amazing and surprising how much care Joseph took to obtain the body of Jesus!",
		"quitetimedate" : "2019-02-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 45,
		"versetext" : "And he went into the temple, and began to cast out them that sold therein, and them that bought;",
		"verseref" : null,
		"versecomment" : "God does not like the business done on His name. He gave freely and He expects us to give freely. He would not suffer people making profits out of His name even in the name of facilitating the Christian resources. He will surely hold them accountable who build their empires making profits on His name, maybe an individual or a church or a so-called Christian organization.",
		"quitetimedate" : "2019-09-30"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 45,
		"versetext" : "And when he rose up from prayer, and was come to his disciples, he found them sleeping for sorrow,",
		"verseref" : null,
		"versecomment" : "Disciples fell asleep of sorrow. Probably they realized how severe the time will be for Jesus and they were probably even were filled with uncertainty of their own future. They probably Jesus agonizing in prayer little away from them. The sorrow of their heart took tall on them and they fell asleep as their mind froze with the burden and sorrow. They felt so tired and their energy level went down so much that they couldn't keep on anymore.",
		"quitetimedate" : "2019-11-19"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 1,
		"verseid" : 45,
		"versetext" : "Philip findeth Nathanael, and saith unto him, We have found him, of whom Moses in the law, and the prophets, did write, Jesus of Nazareth, the son of Joseph.",
		"verseref" : null,
		"versecomment" : "This is a great example of finding. Andrew finds his brother Simon, Jesus finds Phillip, Phillip finds Nathanael. God is finding and we are His co-laborers in finding!",
		"quitetimedate" : "2019-12-16"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 15,
		"verseid" : 46,
		"versetext" : "And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre.",
		"verseref" : null,
		"versecomment" : "Jesus had no place oh His own to lay His own head while He was alive and He had no plan how He would be buried either. Joseph put Him in his own tomb!",
		"quitetimedate" : "2019-02-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 46,
		"versetext" : "And why call ye me, Lord, Lord, and do not the things which I say?",
		"verseref" : null,
		"versecomment" : "Just by saying that we are the follower of Christ is not enough, in fact, that does not make us follower of Christ at all. We must do all that He is asking us to do day after day. We must walk with Him and it is possible only if we are in agreement with Him in everything He says. We must be doers.",
		"quitetimedate" : "2019-03-27"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 8,
		"verseid" : 46,
		"versetext" : "And Jesus said, Somebody hath touched me: for I perceive that virtue is gone out of me.",
		"verseref" : null,
		"versecomment" : "What a great touch which was noticed by Jesus. When people were falling over Him but none touched Him but here is the woman she did not really touch Him except the border of His garment and she was the only sho really touched Him! How do we really approach God? Are we just part of a crowd or the one little meek soul who really touched Him?",
		"quitetimedate" : "2019-04-23"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 46,
		"versetext" : "Saying unto them, It is written, My house is the house of prayer: but ye have made it a den of thieves.",
		"verseref" : null,
		"versecomment" : "How the house of God look like? Jesus pointed them to scripture for the answer. \"It is written\" (Isaiah 56:7, Jeremiah 7:11). We don't have to sit and figure out how a church should be. God has laid out the foundation of the church. Acts 2:42 is the foundation of the church. Introducing all sorts of additional things to the assembly is mostly a western idea and not found in the Bible anywhere. God did not accept and will not accept the assembly founded on the human fancies however great it may look like and especially the activities related to buying and selling to make profits will never be able to accept in the sight of God.",
		"quitetimedate" : "2019-09-30"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 46,
		"versetext" : "And said unto them, Why sleep ye? rise and pray, lest ye enter into temptation.",
		"verseref" : null,
		"versecomment" : "Sorrow is not an excuse to refrain from prayer. God expects us to rise up and pray or else the temptations will catch us and overpower us. There is no other formula offered in the scripture to overcome the temptations but prayer.",
		"quitetimedate" : "2019-11-19"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 46,
		"versetext" : "And said unto them, Thus it is written, and thus it behoved Christ to suffer, and to rise from the dead the third day:",
		"verseref" : null,
		"versecomment" : "Jesus expounded the scripture to His disciples. He personally taught scripture to them. The same scripture which they already knew but HE himself taught them and opened their understanding. We can be great scholars to make 5 point sermons and 10 principles here and 10 principles there about Christian life out of our own study in our own understanding. But until God opens our understanding we are still unlearned and cannot grasp or understand the beauty and depth of His words. Jesus showed Himself from the scripture. All miracles didn't work and even Jesus Himself standing before them as resurrected one didn't work but when He showed Himself from the scripture and gave them understanding they knew that it was He, their savior, triumphant king, everlasting Father, the almighty, prince of Peace.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 41,
		"bookname" : "Mark",
		"chapterid" : 15,
		"verseid" : 47,
		"versetext" : "And Mary Magdalene and Mary the mother of Joses beheld where he was laid.",
		"verseref" : null,
		"versecomment" : "Mary Magdalene and Mary the mother of Jesus has been with Jesus for a very long time! They were there when Jesus was walking to Golgatha, they watched His crucifixion, they watched Him giving up his ghost, they watched Him buried by Joseph. These was very long spell of time and these ladies stayed up during all these! This was love which didnt let them take rest! \r\n\r\nHow do we love Jesus? \r\n\r\nO God, please forgive me for giving into my own comfort while there is lot of work to do for you. Forgive me father for not enduring with you, in laboring with you when there is so much work to do! Amen.",
		"quitetimedate" : "2019-02-01"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 19,
		"verseid" : 47,
		"versetext" : "And he taught daily in the temple. But the chief priests and the scribes and the chief of the people sought to destroy him,",
		"verseref" : null,
		"versecomment" : "Jealousy blinds justice. All the chief priests knew clearly in their heart what they were doing and trying to do to Jesus. They knew that killing is a sin and is clearly mentioned in ten commandments something which a law keeper cannot do. But Jealousy won over the justice. They could not bear the Truth as it was ribbing them of their place in the society, their earthly profits, and power.",
		"quitetimedate" : "2019-09-30"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 47,
		"versetext" : "And that repentance and remission of sins should be preached in his name among all nations, beginning at Jerusalem.",
		"verseref" : null,
		"versecomment" : "Ministry does not start from anywhere else but right where we live. It starts from our home and our street and our town and our country! Ministry and especially preaching is always about repentance and remission of sins, not how big you can get financially or in your earthly life.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 48,
		"versetext" : "He is like a man which built an house, and digged deep, and laid the foundation on a rock: and when the flood arose, the stream beat vehemently upon that house, and could not shake it: for it was founded upon a rock.",
		"verseref" : null,
		"versecomment" : "Are we founded upon the rock? When our foundation is Christ Himself and His words, there are no storms out there which can destroy us. We will not be moved. Now the interesting thing to note here is that Christ has not promised us the life free of troubles, but rather the foundation and the power to sustain all the troubles. It says that \"stream vehemently upon the house\". We might go through the fiercest storm but the glorious thing is that we would not shake if oru foundation is Christ.",
		"quitetimedate" : "2019-03-27"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 48,
		"versetext" : "And said unto them, Whosoever shall receive this child in my name receiveth me: and whosoever shall receive me receiveth him that sent me: for he that is least among you all, the same shall be great.",
		"verseref" : null,
		"versecomment" : "Message from our God is so clear that only person great in His eyes is the one who is least among all men. God does not look at the credentials of man, He looks the obedience of man. He does not look for the best He makes the best. He does not look for the influential He makes one influential. He does not let His glory flow thru human knowledge and excellence, rather He lets His glory flow thru contrite and humble one. ",
		"quitetimedate" : "2019-05-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 48,
		"versetext" : "But Jesus said unto him, Judas, betrayest thou the Son of man with a kiss?",
		"verseref" : null,
		"versecomment" : "Judas was outwardly trying to show that he loved Jesus while inwardly he was betraying Him. This is exactly possible for anyone and hence we must evaluate ourselves by the help and guidance of the Holy Spirit. Are we look outside as a lover of Christ while inside we have no desire to follow Him or get our personal desires accomplished. ",
		"quitetimedate" : "2019-11-20"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 24,
		"verseid" : 48,
		"versetext" : "And ye are witnesses of these things.",
		"verseref" : null,
		"versecomment" : "Jesus Himself has called us the witnesses of all that He has shown us about Himself. He didn't suggest that we are His witnessed but He has affirmed that we are His witnesses and so we should be. We have to live and walk like His witnesses on this earth.",
		"quitetimedate" : "2019-12-09"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 6,
		"verseid" : 48,
		"versetext" : "I am that bread of life.",
		"verseref" : null,
		"versecomment" : "We all eat to survive that our life may continue on this earth but Jesus talking about the bread which is Himself which makes surviving the eternity. He is the bread of life and if we do not nourish ourselves with Him we are starving ourselves and we live with no value only waiting to die.",
		"quitetimedate" : "2020-02-02"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 11,
		"verseid" : 48,
		"versetext" : "If we let him thus alone, all men will believe on him: and the Romans shall come and take away both our place and nation.",
		"verseref" : null,
		"versecomment" : "The conspiracy against a godly is not a new thing. history has many proofs that wicked always has conspired against the godly. What do we expect our God to do for us? Our God if He wants can remove all wicked in a blink of an eye but He waits for the wicked to turn. God takes the cost of the suffering of His children and faithful ones because of His patience and desire that wicked may turn and live.",
		"quitetimedate" : "2020-03-16"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 2,
		"verseid" : 49,
		"versetext" : "And he said unto them, How is it that ye sought me? wist ye not that I must be about my Father's business?",
		"verseref" : null,
		"versecomment" : "The gap between heavenly minded vs earthly minded relationship is visible here. Jesus did not disrespect His parents but He indeed made it very clear that heavenly relationship is a priority for Him. After 12 years of closely watching Jesus why Mary & Joseph was supposed to marvel? Why they would be worried or anxious of His well being? ",
		"quitetimedate" : "2019-02-15"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 6,
		"verseid" : 49,
		"versetext" : "But he that heareth, and doeth not, is like a man that without a foundation built an house upon the earth; against which the stream did beat vehemently, and immediately it fell; and the ruin of that house was great.",
		"verseref" : null,
		"versecomment" : "The difference between these two men Jesus talked about is 1) digging deeper and 2) laying the foundation. Both men indeed heard and till that point, both are the same and looked the same but both had a very different ending. Are we digging deeper in the word? Are we meditating upon it? Are we embracing it as if we have no other mean to live? If we do then we will have a strong and unshakable foundation. But if not then the ruin will be great!\r\n\r\nO God set my feet upon the rock in your mercy before its too late. Amen.",
		"quitetimedate" : "2019-03-27"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 6,
		"verseid" : 49,
		"versetext" : "Your fathers did eat manna in the wilderness, and are dead.",
		"verseref" : null,
		"versecomment" : "Jews thought that they were elite people as their forefathers ate the manna in the wilderness but they forget that they hated that manna as well. They did murmur to eat meat in the wilderness. You and I should never boast on the past blessings, God wants us to live in the present and being obedient to Him in the present time. We cannot live or boast on the experiences of our forefathers we surely can learn from it but we cannot please God just chanting how great our forefathers were.\r\n\r\nJesus says they died eating manna in the wilderness, it was not the food which was eternal. Don't rely on the physical things which seemingly may be good and heavenly but we must have our eyes fixed on the invisible and spiritual.",
		"quitetimedate" : "2020-02-02"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 50,
		"versetext" : "And Jesus said unto him, Forbid him not: for he that is not against us is for us.",
		"verseref" : null,
		"versecomment" : "This is a very practical issue among brethren. The expectation that for someone to be a real follower of Christ must walk with us is wrong. We must respect others who are the co-workers of Christ whom He has appointed. Obviously, someone can misuse this verse and let anything and anyone passing as a follower of Christ. But that is not what Jesus meant here. A true follower of Christ is appointed by God and bears the fruit worthy of it. Jesus did warn against Pharisees who had the show of all righteousness but would never make to the kingdom of Heaven. We are not supposed to align ourselves with anyone who comes in His name but only those who bears the fruits worthy of it.",
		"quitetimedate" : "2019-05-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 2,
		"verseid" : 51,
		"versetext" : "And he went down with them, and came to Nazareth, and was subject unto them: but his mother kept all these sayings in her heart.",
		"verseref" : null,
		"versecomment" : "Mary kept the things in her heart and pondered on it. And this is the 2nd time it is recorded by Luke. In V19 of this chapter is the first record.",
		"quitetimedate" : "2019-02-15"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 51,
		"versetext" : "And it came to pass, when the time was come that he should be received up, he stedfastly set his face to go to Jerusalem,",
		"verseref" : null,
		"versecomment" : "Jesus set His face to go to Jerusalem. He knew what kind of sufferings He will go thru in Jerusalem but He was more keen to fulfill God's purpose instead of being laden with self-pity or sorrow. We must be so determined to do God's will even it means facing death and persecution. Death and persecution are not at all an end for us. But once we go thru it the living God Himself will receive us in His eternal glory. O Death where is thy sting! We should be joyful to follow our savior's steps.",
		"quitetimedate" : "2019-05-05"
	},
	{
		"bookid" : 43,
		"bookname" : "John",
		"chapterid" : 1,
		"verseid" : 51,
		"versetext" : "And he saith unto him, Verily, verily, I say unto you, Hereafter ye shall see heaven open, and the angels of God ascending and descending upon the Son of man.",
		"verseref" : null,
		"versecomment" : "when Phillip told Nathanael about Jesus he just brushed it off casually but then he had an encounter with Jesus Himself which brought Him to the point where he could not but say \"thou are the Son of God\", \"thou art the king of Israel\". We must know that we may fail to convince someone about Christ and we must not presume either. Our job is to introduce Christ to the lost world. God, Himself is powerful enough to convince any stubborn heart.\r\n\r\nProbably Nathanael did not know that Jesus knew him even when he was not in the physical sigh of Him. It didn't take Nathanael to figure out that Jesus was the Son of God. How much we want Jesus to do for us so that we fall at His feet and make Him our God and King?",
		"quitetimedate" : "2019-12-16"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 53,
		"versetext" : "And they did not receive him, because his face was as though he would go to Jerusalem.",
		"verseref" : null,
		"versecomment" : "Jesus did not satisfy many religious traditions and leaders. For Samaritans, Jerusalem was never a place of worship. For them, it was Mount Gerizim and hence when they perceived that Jesus is set to go to Jerusalem, they were offended and did not receive him to spend his last day(s) with Him. They already knew who He was and how kind He was to the Samaritan woman and also how he valued a simple good Samaritan over all the Pharisees, Sadducees, Scribes and priests in the temple of Jerusalem. But their religious pride and tradition kept Jesus away!",
		"quitetimedate" : "2019-05-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 53,
		"versetext" : "When I was daily with you in the temple, ye stretched forth no hands against me: but this is your hour, and the power of darkness.",
		"verseref" : null,
		"versecomment" : "When we see evil triumph we need to understand that that is their hour and of power of darkness. We must not be too anxious and startled about it. God in His eternal wisdom lets the power of darkness have their hour and time. As Jesus let it happened we must let it happen and put ourselves in the hands of God instead of trying to fight. ",
		"quitetimedate" : "2019-11-23"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 54,
		"versetext" : "And when his disciples James and John saw this, they said, Lord, wilt thou that we command fire to come down from heaven, and consume them, even as Elias did?",
		"verseref" : null,
		"versecomment" : "This shows the utter deprivation of the human heart. Disciples after spending so much time with Jesus it seems were filled with so many follies and natural instincts. Although they really loved the Lord, left all their worldly things aside but they were still in the grip of their fallen nature. They were vengeful and probably ignorant of what God expects from them. ",
		"quitetimedate" : "2019-05-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 54,
		"versetext" : "Then took they him, and led him, and brought him into the high priest's house. And Peter followed afar off.",
		"verseref" : null,
		"versecomment" : "And Peter followed Him afar off. A few hours ago he was boasting to lay his life with Jesus but the moment of fear has taken him over. He is following him afar off. Not sure any of His other disciples were doing the same but it seems they weren't. Peter had a genuine desire to stay with Jesus but he couldn't in his own strength and pride. He ended up following Him afar off. So are we at times we end up following Him afar off. We lose the fervency of following Him due to fear of men or circumstances or whatever other reasons. And its not too long before we also would end up denying Him. ",
		"quitetimedate" : "2019-11-23"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 55,
		"versetext" : "And when they had kindled a fire in the midst of the hall, and were set down together, Peter sat down among them.",
		"verseref" : null,
		"versecomment" : "Peter sat down with the wrong crowd, the crowd which was after Jesus. Peter was running in his own wisdom, he may have thought that this is the way he can stay with Jesus. But ultimately he ended up denying Jesus three times.",
		"quitetimedate" : "2019-11-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 56,
		"versetext" : "For the Son of man is not come to destroy men's lives, but to save them. And they went to another village.",
		"verseref" : null,
		"versecomment" : "While Samaritans refused to receive Him, it angered disciples and they wanted to burn them down with the fire from heaven! And Jesus had to rebuke them. Such a vengeful heart is never approved of God. Jesus in His human form set such a great example for us humans to follow. We cannot be vengeful. Vengence belongs to the Lord and not to us. Jesus just turned to another village when not received by Samaritans. We must stay away from the vengeful heart as it will never be approved of God. rather we must pray for the salvation of those who persecute us and harras us.",
		"quitetimedate" : "2019-05-05"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 57,
		"versetext" : "And it came to pass, that, as they went in the way, a certain man said unto him, Lord, I will follow thee whithersoever thou goest.",
		"verseref" : null,
		"versecomment" : "This man surely had commitment but seems that Jesus did not agree with his desire. It is possible that God may not agree with our plans even though those plans may be godly. ",
		"quitetimedate" : "2019-05-10"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 9,
		"verseid" : 58,
		"versetext" : "And Jesus said unto him, Foxes have holes, and birds of the air have nests; but the Son of man hath not where to lay his head.",
		"verseref" : null,
		"versecomment" : "Jesus in His own words described His state on this earth. And it's not that He was helpless and living in a pitiful situation but because of His message and His pure life which was so much at odds with the world that HE hardly can find the place to rest. Godly men walk alone, they do not have much in common with a medicore follower of Christ. It is so difficult to find a kindred soul with whom a serious child of God can get along with. It's not that such man hates others but it is the question of companionship and he does not find rest with the compromising and half-hearted Christians.",
		"quitetimedate" : "2019-05-10"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 58,
		"versetext" : "And after a little while another saw him, and said, Thou art also of them. And Peter said, Man, I am not.",
		"verseref" : null,
		"versecomment" : "First Peter denied having known Jesus. Now he denied even being one of them, meaning follower of Christ, or one of His disciples. When we try to keep up with God in our pride, strength or wisdom it does not go too far. This divine principle is so deep and beyond our comprehension but it is so proven times and again that we cannot follow God in our own strength, even to follow Him we need strength and guidance from Him.",
		"quitetimedate" : "2019-11-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 59,
		"versetext" : "And about the space of one hour after another confidently affirmed, saying, Of a truth this fellow also was with him: for he is a Galilaean.",
		"verseref" : null,
		"versecomment" : "The third time Peter denied even of being from His vicinity. He even acted as if he doesn't know what Galilee is where Jesus also was from. This is such a clear picture of what happens to one who has a genuine desire to follow Christ and even till the death but the grips of fear and safety have overpowered him. Peter boasted that he would follow Jesus unto death but such a determination in his own strength didn't last for long.",
		"quitetimedate" : "2019-11-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 61,
		"versetext" : "And the Lord turned, and looked upon Peter. And Peter remembered the word of the Lord, how he had said unto him, Before the cock crow, thou shalt deny me thrice.",
		"verseref" : null,
		"versecomment" : "Our God is merciful even in our dire weakness. Jesus turned and looked upon Peter. It was a look of mercy and not condemnation. Jesus just wanted to remind Peter about what He had already said that he would deny Him thrice before the cock crow. Our God knows our follies even beforehand and it's not that He is happy to see us fall but when our pride and self-reliance take us over, He lets us learn the lesson and it is often very painful. ",
		"quitetimedate" : "2019-11-25"
	},
	{
		"bookid" : 42,
		"bookname" : "Luke",
		"chapterid" : 22,
		"verseid" : 62,
		"versetext" : "And Peter went out, and wept bitterly.",
		"verseref" : null,
		"versecomment" : "This is the child of God would do. when he realizes of his sin he is filled with godly sorrow and repentance. This is not just superficial, outward sorrow but it is utter brokenness. This weeping was unusual, it was not emotional but it was heart-piercing. Such repentance bring a great reconciliation with God and it God glorifies Himself in a person who is filled with utter remorse for his sin.",
		"quitetimedate" : "2019-11-25"
	}
]}
